JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/** AHB_SECURE_CTRL - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x20 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x03000000-0x0301FFFF, array offset: 0x0, array step: 0x20 */
         uint8_t RESERVED_0[12];
    __IO uint32_t MEM_RULE[4];                       /**< , array offset: 0x10, array step: index*0x20, index2*0x4 */
  } BOOTROM[1];
  struct {                                         /* offset: 0x20, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< , array offset: 0x20, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t QSPI0_MEM_RULE[4];                 /**< , array offset: 0x30, array step: index*0x50, index2*0x4 */
    __IO uint32_t QSPI1_MEM_RULE[4];                 /**< , array offset: 0x40, array step: index*0x50, index2*0x4 */
    __IO uint32_t QSPI2_MEM_RULE[4];                 /**< , array offset: 0x50, array step: index*0x50, index2*0x4 */
    __IO uint32_t QSPI3_MEM_RULE[4];                 /**< , array offset: 0x60, array step: index*0x50, index2*0x4 */
  } QSPI[1];
  struct {                                         /* offset: 0x70, array step: 0x30 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20000000--0x2000FFFF, array offset: 0x70, array step: 0x30 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM0_MEM_RULE[4];                  /**< , array offset: 0x80, array step: index*0x30, index2*0x4 */
    __IO uint32_t RAM1_MEM_RULE[4];                  /**< , array offset: 0x90, array step: index*0x30, index2*0x4 */
  } RAM0_1[1];
  struct {                                         /* offset: 0xA0, array step: 0x30 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20010000--0x2001FFFF, array offset: 0xA0, array step: 0x30 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM2_MEM_RULE[4];                  /**< , array offset: 0xB0, array step: index*0x30, index2*0x4 */
    __IO uint32_t RAM3_MEM_RULE[4];                  /**< , array offset: 0xC0, array step: index*0x30, index2*0x4 */
  } RAM2_3[1];
  struct {                                         /* offset: 0xD0, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20020000--0x2003FFFF, array offset: 0xD0, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM4_MEM_RULE[4];                  /**< , array offset: 0xE0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM5_MEM_RULE[4];                  /**< , array offset: 0xF0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM6_MEM_RULE[4];                  /**< , array offset: 0x100, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM7_MEM_RULE[4];                  /**< , array offset: 0x110, array step: index*0x50, index2*0x4 */
  } RAM4_7[1];
  struct {                                         /* offset: 0x120, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< , array offset: 0x120, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM8_MEM_RULE[4];                  /**< , array offset: 0x130, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM9_MEM_RULE[4];                  /**< , array offset: 0x140, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM10_MEM_RULE[4];                 /**< , array offset: 0x150, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM11_MEM_RULE[4];                 /**< , array offset: 0x160, array step: index*0x50, index2*0x4 */
  } RAM8_11[1];
  struct {                                         /* offset: 0x170, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20080000--0x200FFFFF, array offset: 0x170, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM12_MEM_RULE[4];                 /**< , array offset: 0x180, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM13_MEM_RULE[4];                 /**< , array offset: 0x190, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM14_MEM_RULE[4];                 /**< , array offset: 0x1A0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM15_MEM_RULE[4];                 /**< , array offset: 0x1B0, array step: index*0x50, index2*0x4 */
  } RAM12_15[1];
  struct {                                         /* offset: 0x1C0, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20100000--0x201FFFFF, array offset: 0x1C0, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM16_MEM_RULE[4];                 /**< , array offset: 0x1D0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM17_MEM_RULE[4];                 /**< , array offset: 0x1E0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM18_MEM_RULE[4];                 /**< , array offset: 0x1F0, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM19_MEM_RULE[4];                 /**< , array offset: 0x200, array step: index*0x50, index2*0x4 */
  } RAM16_19[1];
  struct {                                         /* offset: 0x210, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20200000--0x202FFFFF, array offset: 0x210, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM20_MEM_RULE[4];                 /**< , array offset: 0x220, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM21_MEM_RULE[4];                 /**< , array offset: 0x230, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM22_MEM_RULE[4];                 /**< , array offset: 0x240, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM23_MEM_RULE[4];                 /**< , array offset: 0x250, array step: index*0x50, index2*0x4 */
  } RAM20_23[1];
  struct {                                         /* offset: 0x260, array step: 0x50 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20300000--0x203FFFFF, array offset: 0x260, array step: 0x50 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM24_MEM_RULE[4];                 /**< , array offset: 0x270, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM25_MEM_RULE[4];                 /**< , array offset: 0x280, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM26_MEM_RULE[4];                 /**< , array offset: 0x290, array step: index*0x50, index2*0x4 */
    __IO uint32_t RAM27_MEM_RULE[4];                 /**< , array offset: 0x2A0, array step: index*0x50, index2*0x4 */
  } RAM24_27[1];
  struct {                                         /* offset: 0x2B0, array step: 0x30 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x20400000--0x2047FFFF, array offset: 0x2B0, array step: 0x30 */
         uint8_t RESERVED_0[12];
    __IO uint32_t RAM28_MEM_RULE[4];                 /**< , array offset: 0x2C0, array step: index*0x30, index2*0x4 */
    __IO uint32_t RAM29_MEM_RULE[4];                 /**< , array offset: 0x2D0, array step: index*0x30, index2*0x4 */
  } RAM28_29[1];
       uint8_t RESERVED_0[32];
  struct {                                         /* offset: 0x300, array step: 0x20 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x24000000--0x240FFFFF, array offset: 0x300, array step: 0x20 */
         uint8_t RESERVED_0[12];
    __IO uint32_t MEM_RULE[4];                       /**< , array offset: 0x310, array step: index*0x20, index2*0x4 */
  } PIF_HIFI4_X[1];
  struct {                                         /* offset: 0x320, array step: 0x30 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x40000000--0x4003FFFF, array offset: 0x320, array step: 0x30 */
         uint8_t RESERVED_0[12];
    __IO uint32_t APB_GRP0_MEM_RULE0;                /**< , array offset: 0x330, array step: 0x30 */
    __IO uint32_t APB_GRP0_MEM_RULE1;                /**< , array offset: 0x334, array step: 0x30 */
         uint32_t APB_GRP0_MEM_RULE2;                /**< , array offset: 0x338, array step: 0x30 */
    __IO uint32_t APB_GRP0_MEM_RULE3;                /**< , array offset: 0x33C, array step: 0x30 */
    __IO uint32_t APB_GRP1_MEM_RULE0;                /**< , array offset: 0x340, array step: 0x30 */
    __IO uint32_t APB_GRP1_MEM_RULE1;                /**< , array offset: 0x344, array step: 0x30 */
    __IO uint32_t APB_GRP1_MEM_RULE2;                /**< , array offset: 0x348, array step: 0x30 */
    __IO uint32_t APB_GRP1_MEM_RULE3;                /**< , array offset: 0x34C, array step: 0x30 */
  } APB_BRIDGE[1];
  struct {                                         /* offset: 0x350, array step: 0x18 */
    __IO uint32_t SLAVE_RULE0;                       /**< 0x40100000--0x4010FFFF, array offset: 0x350, array step: 0x18 */
    __IO uint32_t SLAVE_RULE1;                       /**< 0x40110000--0x4011FFFF, array offset: 0x354, array step: 0x18 */
         uint8_t RESERVED_0[8];
    __IO uint32_t AIPS_BRIDGE0_MEM_RULE0;            /**< 0x40110000--0x4011FFFF, array offset: 0x360, array step: 0x18 */
    __IO uint32_t AIPS_BRIDGE0_MEM_RULE1;            /**< 0x40110000--0x4011FFFF, array offset: 0x364, array step: 0x18 */
  } AHB_PERIPH0[1];
       uint8_t RESERVED_1[8];
  __IO uint32_t AHB_PERIPH1_SLAVE_RULE;            /**< the memory map is 0x40120000--0x40127FFF, offset: 0x370 */
       uint8_t RESERVED_2[12];
  struct {                                         /* offset: 0x380, array step: 0x18 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x40130000--0x4013FFFF, array offset: 0x380, array step: 0x18 */
         uint8_t RESERVED_0[12];
    __IO uint32_t MEM_RULE0;                         /**< , array offset: 0x390, array step: 0x18 */
    __IO uint32_t MEM_RULE1;                         /**< , array offset: 0x394, array step: 0x18 */
  } AIPS_BRIDGE[1];
       uint8_t RESERVED_3[8];
  struct {                                         /* offset: 0x3A0, array step: 0x14 */
    __IO uint32_t SLAVE_RULE;                        /**< 0x40140000--0x4014BFFF, array offset: 0x3A0, array step: 0x14 */
         uint8_t RESERVED_0[12];
    __IO uint32_t SECURITY_CTRL_MEM_RULE;            /**< 0x40148000--0x4014BFFF, array offset: 0x3B0, array step: 0x14 */
  } AHB_PERIPH2[1];
       uint8_t RESERVED_4[12];
  __IO uint32_t AHB_PERIPH3_SLAVE_RULE;            /**< the memory map is 0x40150000--0x40158FFF, offset: 0x3C0 */
       uint8_t RESERVED_5[2620];
  __I  uint32_t SEC_VIO_ADDR[18];                  /**< most recent security violation address for AHB layer n, array offset: 0xE00, array step: 0x4 */
       uint8_t RESERVED_6[56];
  __I  uint32_t SEC_VIO_MISC_INFO[18];             /**< most recent security violation miscellaneous information for AHB layer n, array offset: 0xE80, array step: 0x4 */
       uint8_t RESERVED_7[56];
  __IO uint32_t SEC_VIO_INFO_VALID;                /**< security violation address/information registers valid flags, offset: 0xF00 */
       uint8_t RESERVED_8[124];
  __IO uint32_t SEC_GPIO_MASK0;                    /**< Secure GPIO mask for port 0 pins. This register is used to block leakage of Secure interface (GPIOs, I2C, UART configured as secure peripherals) pin states to non-secure world., offset: 0xF80 */
  __IO uint32_t SEC_GPIO_MASK1;                    /**< Secure GPIO mask for port 1 pins., offset: 0xF84 */
  __IO uint32_t SEC_GPIO_MASK2;                    /**< Secure GPIO mask for port 2 pins., offset: 0xF88 */
  __IO uint32_t SEC_GPIO_MASK3;                    /**< Secure GPIO mask for port 3 pins., offset: 0xF8C */
  __IO uint32_t SEC_GPIO_MASK4;                    /**< Secure GPIO mask for port 4 pins., offset: 0xF90 */
  __IO uint32_t SEC_GPIO_MASK5;                    /**< Secure GPIO mask for port 5 pins., offset: 0xF94 */
  __IO uint32_t SEC_GPIO_MASK6;                    /**< Secure GPIO mask for port 6 pins., offset: 0xF98 */
  __IO uint32_t SEC_GPIO_MASK7;                    /**< Secure GPIO mask for port 7 pins., offset: 0xF9C */
  __IO uint32_t SEC_HIFI4_INT_MASK;                /**< secure general purpose register 8 used to mask interrupts to DSP for security purpose, offset: 0xFA0 */
       uint8_t RESERVED_9[24];
  __IO uint32_t SEC_GPIO_MASK_LOCK;                /**< sec_gp_reg write-lock bits, offset: 0xFBC */
       uint8_t RESERVED_10[16];
  __IO uint32_t MASTER_SEC_REG;                    /**< master secure level register, offset: 0xFD0 */
  __IO uint32_t MASTER_SEC_ANTI_POL_REG;           /**< master secure level anti-pole register, offset: 0xFD4 */
       uint8_t RESERVED_11[20];
  __IO uint32_t CM33_LOCK_REG;                     /**< m33 lock control register, offset: 0xFEC */
       uint8_t RESERVED_12[8];
  __IO uint32_t MISC_CTRL_DP_REG;                  /**< secure control duplicate register, offset: 0xFF8 */
  __IO uint32_t MISC_CTRL_REG;                     /**< secure control register, offset: 0xFFC */
} AHB_SECURE_CTRL_Type;

/* ----------------------------------------------------------------------------
   -- AHB_SECURE_CTRL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHB_SECURE_CTRL_Register_Masks AHB_SECURE_CTRL Register Masks
 * @{
 */

