JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* The count of AHB_SECURE_CTRL_RAM20_23_RAM23_MEM_RULE */
#define AHB_SECURE_CTRL_RAM20_23_RAM23_MEM_RULE_COUNT (1U)

/* The count of AHB_SECURE_CTRL_RAM20_23_RAM23_MEM_RULE */
#define AHB_SECURE_CTRL_RAM20_23_RAM23_MEM_RULE_COUNT2 (4U)

/*! @name RAM24_27_SLAVE_RULE - 0x20300000--0x203FFFFF */
/*! @{ */
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM24_RULE_MASK (0x3U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM24_RULE_SHIFT (0U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM24_RULE(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM24_RULE_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM24_RULE_MASK)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM25_RULE_MASK (0x30U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM25_RULE_SHIFT (4U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM25_RULE(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM25_RULE_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM25_RULE_MASK)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM26_RULE_MASK (0x300U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM26_RULE_SHIFT (8U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM26_RULE(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM26_RULE_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM26_RULE_MASK)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM27_RULE_MASK (0x3000U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM27_RULE_SHIFT (12U)
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM27_RULE(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM27_RULE_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_RAM27_RULE_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE */
#define AHB_SECURE_CTRL_RAM24_27_SLAVE_RULE_COUNT (1U)

/*! @name RAM24_27_RAM24_MEM_RULE -  */
/*! @{ */
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE0_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE0_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE1_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE1_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE2_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE2_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE3_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE3_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE4_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE4_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE5_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE5_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE6_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE6_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE7_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_COUNT (1U)

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM24_MEM_RULE_COUNT2 (4U)

/*! @name RAM24_27_RAM25_MEM_RULE -  */
/*! @{ */
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE0_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE0_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE1_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE1_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE2_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE2_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE3_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE3_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE4_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE4_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE5_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE5_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE6_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE6_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE7_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_COUNT (1U)

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM25_MEM_RULE_COUNT2 (4U)

/*! @name RAM24_27_RAM26_MEM_RULE -  */
/*! @{ */
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE0_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE0_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE1_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE1_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE2_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE2_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE3_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE3_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE4_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE4_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE5_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE5_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE6_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE6_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE7_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_COUNT (1U)

/* The count of AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE */
#define AHB_SECURE_CTRL_RAM24_27_RAM26_MEM_RULE_COUNT2 (4U)

/*! @name RAM24_27_RAM27_MEM_RULE -  */
/*! @{ */
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE0_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE0_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE1_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE1_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE2_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE2_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE3_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE3_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE4_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE4_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE5_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE5_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE6_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE6_MASK)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE7_SHIFT)) & AHB_SECURE_CTRL_RAM24_27_RAM27_MEM_RULE_RULE7_MASK)
/*! @} */

