JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* The count of AHB_SECURE_CTRL_PIF_HIFI4_X_PIF_HIFI4_X_MEM_RULE */
#define AHB_SECURE_CTRL_PIF_HIFI4_X_PIF_HIFI4_X_MEM_RULE_COUNT (1U)

/* The count of AHB_SECURE_CTRL_PIF_HIFI4_X_PIF_HIFI4_X_MEM_RULE */
#define AHB_SECURE_CTRL_PIF_HIFI4_X_PIF_HIFI4_X_MEM_RULE_COUNT2 (4U)

/*! @name APB_BRIDGE_SLAVE_RULE - 0x40000000--0x4003FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP0_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP0_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP0_RULE0_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP0_RULE0_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP1_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP1_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP1_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP1_RULE1_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_APB_GRP1_RULE1_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE */
#define AHB_SECURE_CTRL_APB_BRIDGE_SLAVE_RULE_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP0_MEM_RULE0 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_RSTCTL0_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_RSTCTL0_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_RSTCTL0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_RSTCTL0_RULE0_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_RSTCTL0_RULE0_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_CLKCTL0_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_CLKCTL0_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_CLKCTL0_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_CLKCTL0_RULE1_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_CLKCTL0_RULE1_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_SYSCTL0_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_SYSCTL0_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_SYSCTL0_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_SYSCTL0_RULE2_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_SYSCTL0_RULE2_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PVTCTL_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PVTCTL_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PVTCTL_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PVTCTL_RULE3_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PVTCTL_RULE3_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_IOPCTL_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_IOPCTL_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_IOPCTL_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_IOPCTL_RULE4_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_IOPCTL_RULE4_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PUFCTRL_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PUFCTRL_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PUFCTRL_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PUFCTRL_RULE6_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_PUFCTRL_RULE6_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE0_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP0_MEM_RULE1 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_WWDT0_RULE14_MASK (0x3000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_WWDT0_RULE14_SHIFT (24U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_WWDT0_RULE14(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_WWDT0_RULE14_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_WWDT0_RULE14_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_UTICK_RULE15_MASK (0x30000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_UTICK_RULE15_SHIFT (28U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_UTICK_RULE15(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_UTICK_RULE15_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_UTICK_RULE15_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE1_COUNT (1U)

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE2 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE2_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP0_MEM_RULE3 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_CAPT_RULE26_MASK (0x300U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_CAPT_RULE26_SHIFT (8U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_CAPT_RULE26(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_CAPT_RULE26_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_CAPT_RULE26_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP0_MEM_RULE3_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP1_MEM_RULE0 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_RSTCTL1_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_RSTCTL1_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_RSTCTL1_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_RSTCTL1_RULE0_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_RSTCTL1_RULE0_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_CLKCTL1_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_CLKCTL1_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_CLKCTL1_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_CLKCTL1_RULE1_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_CLKCTL1_RULE1_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_SYSCTL1_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_SYSCTL1_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_SYSCTL1_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_SYSCTL1_RULE2_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_SYSCTL1_RULE2_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_GPIO_INTR_CTRL_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_GPIO_INTR_CTRL_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_GPIO_INTR_CTRL_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_GPIO_INTR_CTRL_RULE5_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_GPIO_INTR_CTRL_RULE5_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_PERIPH_INPUT_MUX_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_PERIPH_INPUT_MUX_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_PERIPH_INPUT_MUX_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_PERIPH_INPUT_MUX_RULE6_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_PERIPH_INPUT_MUX_RULE6_MASK)
/*! @} */

