JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE0_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP1_MEM_RULE1 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT0_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT0_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT0_RULE0_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT0_RULE0_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT1_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT1_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT1_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT1_RULE1_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT1_RULE1_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT2_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT2_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT2_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT2_RULE2_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT2_RULE2_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT3_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT3_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT3_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT3_RULE3_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT3_RULE3_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT4_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT4_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT4_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT4_RULE4_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_CT32BIT4_RULE4_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_MRT_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_MRT_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_MRT_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_MRT_RULE5_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_MRT_RULE5_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_WWDT1_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_WWDT1_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_WWDT1_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_WWDT1_RULE6_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_WWDT1_RULE6_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_FREQME_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_FREQME_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_FREQME_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_FREQME_RULE7_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_FREQME_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE1_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP1_MEM_RULE2 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_RTC_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_RTC_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_RTC_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_RTC_RULE0_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_RTC_RULE0_MASK)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_I3C0_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_I3C0_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_I3C0_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_I3C0_RULE6_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_I3C0_RULE6_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE2_COUNT (1U)

/*! @name APB_BRIDGE_APB_GRP1_MEM_RULE3 -  */
/*! @{ */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_FREEMRT_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_FREEMRT_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_FREEMRT_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_FREEMRT_RULE7_SHIFT)) & AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_FREEMRT_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3 */
#define AHB_SECURE_CTRL_APB_BRIDGE_APB_GRP1_MEM_RULE3_COUNT (1U)

/*! @name AHB_PERIPH0_SLAVE_RULE0 - 0x40100000--0x4010FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_HSGPIO_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_HSGPIO_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_HSGPIO_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_HSGPIO_RULE0_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_HSGPIO_RULE0_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA0_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA0_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA0_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA0_RULE1_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA0_RULE1_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA1_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA1_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA1_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA1_RULE2_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DMA1_RULE2_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM0_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM0_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM0_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM0_RULE3_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM0_RULE3_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM1_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM1_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM1_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM1_RULE4_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM1_RULE4_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM2_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM2_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM2_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM2_RULE5_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM2_RULE5_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM3_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM3_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM3_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM3_RULE6_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_FLEXCOMM3_RULE6_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DEBUG_MAILBOX_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DEBUG_MAILBOX_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DEBUG_MAILBOX_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DEBUG_MAILBOX_RULE7_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_DEBUG_MAILBOX_RULE7_MASK)
/*! @} */

