JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* The count of AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0 */
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE0_COUNT (1U)

/*! @name AHB_PERIPH0_SLAVE_RULE1 - 0x40110000--0x4011FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_AIPS_BRIDGE0_RULE8_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_AIPS_BRIDGE0_RULE8_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_AIPS_BRIDGE0_RULE8(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_AIPS_BRIDGE0_RULE8_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_AIPS_BRIDGE0_RULE8_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1 */
#define AHB_SECURE_CTRL_AHB_PERIPH0_SLAVE_RULE1_COUNT (1U)

/*! @name AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0 - 0x40110000--0x4011FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_M33_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_M33_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_M33_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_M33_RULE0_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_M33_RULE0_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_DSP_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_DSP_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_DSP_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_DSP_RULE1_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_MU0_DSP_RULE1_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_SEMAPHORE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_SEMAPHORE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_SEMAPHORE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_SEMAPHORE_RULE2_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_SEMAPHORE_RULE2_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_M33_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_M33_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_M33_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_M33_RULE3_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_M33_RULE3_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_DSP_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_DSP_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_DSP_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_DSP_RULE4_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_OS_EVENT_TIMER_DSP_RULE4_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0 */
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE0_COUNT (1U)

/*! @name AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1 - 0x40110000--0x4011FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_DPM_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_DPM_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_DPM_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_DPM_RULE7_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_DPM_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1 */
#define AHB_SECURE_CTRL_AHB_PERIPH0_AIPS_BRIDGE0_MEM_RULE1_COUNT (1U)

/*! @name AHB_PERIPH1_SLAVE_RULE - the memory map is 0x40120000--0x40127FFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_CRC_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_CRC_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_CRC_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_CRC_RULE0_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_CRC_RULE0_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_DMIC_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_DMIC_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_DMIC_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_DMIC_RULE1_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_DMIC_RULE1_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM4_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM4_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM4_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM4_RULE2_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM4_RULE2_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM5_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM5_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM5_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM5_RULE3_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM5_RULE3_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM6_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM6_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM6_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM6_RULE4_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM6_RULE4_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM7_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM7_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM7_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM7_RULE5_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM7_RULE5_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM14_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM14_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM14_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM14_RULE6_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM14_RULE6_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM15_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM15_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM15_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM15_RULE7_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH1_SLAVE_RULE_FLEXCOMM15_RULE7_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_SLAVE_RULE - 0x40130000--0x4013FFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_AIPS_BRIDGE1_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_AIPS_BRIDGE1_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_AIPS_BRIDGE1_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_AIPS_BRIDGE1_RULE0_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_AIPS_BRIDGE1_RULE0_MASK)
/*! @} */

