JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* The count of AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_SLAVE_RULE_COUNT (1U)

/*! @name AIPS_BRIDGE_MEM_RULE0 -  */
/*! @{ */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE0_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE0_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE1_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE1_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE2_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE2_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE3_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OTP_RULE3_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OSPI_AND_OTFAD_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OSPI_AND_OTFAD_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OSPI_AND_OTFAD_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OSPI_AND_OTFAD_RULE4_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_OSPI_AND_OTFAD_RULE4_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_PMC_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_PMC_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_PMC_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_PMC_RULE5_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_PMC_RULE5_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO0_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO0_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO0_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO0_RULE6_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO0_RULE6_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO1_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO1_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO1_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO1_RULE7_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_SDIO1_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0 */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE0_COUNT (1U)

/*! @name AIPS_BRIDGE_MEM_RULE1 -  */
/*! @{ */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_RNG_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_RNG_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_RNG_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_RNG_RULE0_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_RNG_RULE0_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ACMP0_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ACMP0_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ACMP0_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ACMP0_RULE1_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ACMP0_RULE1_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ADC0_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ADC0_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ADC0_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ADC0_RULE2_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ADC0_RULE2_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_USB_HS_PHY_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_USB_HS_PHY_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_USB_HS_PHY_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_USB_HS_PHY_RULE3_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_USB_HS_PHY_RULE3_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ROM_CTRL_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ROM_CTRL_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ROM_CTRL_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ROM_CTRL_RULE4_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ROM_CTRL_RULE4_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_MTR_TEST_RULE6_MASK (0x3000000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_MTR_TEST_RULE6_SHIFT (24U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_MTR_TEST_RULE6(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_MTR_TEST_RULE6_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_MTR_TEST_RULE6_MASK)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ATX_TEST_RULE7_MASK (0x30000000U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ATX_TEST_RULE7_SHIFT (28U)
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ATX_TEST_RULE7(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ATX_TEST_RULE7_SHIFT)) & AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_ATX_TEST_RULE7_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1 */
#define AHB_SECURE_CTRL_AIPS_BRIDGE_MEM_RULE1_COUNT (1U)

/*! @name AHB_PERIPH2_SLAVE_RULE - 0x40140000--0x4014BFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_RAM_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_RAM_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_RAM_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_RAM_RULE0_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_RAM_RULE0_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_DEV_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_DEV_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_DEV_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_DEV_RULE1_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_DEV_RULE1_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_HOST_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_HOST_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_HOST_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_HOST_RULE2_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_USB_HS_HOST_RULE2_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SCT_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SCT_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SCT_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SCT_RULE3_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SCT_RULE3_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SRAM_IF_REG_RULE4_MASK (0x30000U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SRAM_IF_REG_RULE4_SHIFT (16U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SRAM_IF_REG_RULE4(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SRAM_IF_REG_RULE4_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SRAM_IF_REG_RULE4_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SECURITY_CTRL_RULE5_MASK (0x300000U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SECURITY_CTRL_RULE5_SHIFT (20U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SECURITY_CTRL_RULE5(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SECURITY_CTRL_RULE5_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_SECURITY_CTRL_RULE5_MASK)
/*! @} */

/* The count of AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE */
#define AHB_SECURE_CTRL_AHB_PERIPH2_SLAVE_RULE_COUNT (1U)

/*! @name AHB_PERIPH2_SECURITY_CTRL_MEM_RULE - 0x40148000--0x4014BFFF */
/*! @{ */
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE0_MASK (0x3U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE0_SHIFT (0U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE0_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE0_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE1_MASK (0x30U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE1_SHIFT (4U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE1_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE1_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE2_MASK (0x300U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE2_SHIFT (8U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE2_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE2_MASK)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE3_MASK (0x3000U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE3_SHIFT (12U)
#define AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE3_SHIFT)) & AHB_SECURE_CTRL_AHB_PERIPH2_SECURITY_CTRL_MEM_RULE_RULE3_MASK)
/*! @} */

