JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name SEC_HIFI4_INT_MASK - secure general purpose register 8 used to mask interrupts to DSP for security purpose */
/*! @{ */
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR5_SEC_MASK_MASK (0x20U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR5_SEC_MASK_SHIFT (5U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR5_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR5_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR5_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR6_SEC_MASK_MASK (0x40U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR6_SEC_MASK_SHIFT (6U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR6_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR6_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR6_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR7_SEC_MASK_MASK (0x80U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR7_SEC_MASK_SHIFT (7U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR7_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR7_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR7_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR8_SEC_MASK_MASK (0x100U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR8_SEC_MASK_SHIFT (8U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR8_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR8_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR8_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR9_SEC_MASK_MASK (0x200U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR9_SEC_MASK_SHIFT (9U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR9_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR9_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR9_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR10_SEC_MASK_MASK (0x400U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR10_SEC_MASK_SHIFT (10U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR10_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR10_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR10_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR11_SEC_MASK_MASK (0x800U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR11_SEC_MASK_SHIFT (11U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR11_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR11_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR11_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR12_SEC_MASK_MASK (0x1000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR12_SEC_MASK_SHIFT (12U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR12_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR12_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR12_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR13_SEC_MASK_MASK (0x2000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR13_SEC_MASK_SHIFT (13U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR13_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR13_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR13_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR14_SEC_MASK_MASK (0x4000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR14_SEC_MASK_SHIFT (14U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR14_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR14_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR14_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR15_SEC_MASK_MASK (0x8000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR15_SEC_MASK_SHIFT (15U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR15_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR15_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR15_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR16_SEC_MASK_MASK (0x10000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR16_SEC_MASK_SHIFT (16U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR16_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR16_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR16_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR17_SEC_MASK_MASK (0x20000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR17_SEC_MASK_SHIFT (17U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR17_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR17_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR17_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR18_SEC_MASK_MASK (0x40000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR18_SEC_MASK_SHIFT (18U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR18_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR18_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR18_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR19_SEC_MASK_MASK (0x80000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR19_SEC_MASK_SHIFT (19U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR19_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR19_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR19_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR20_SEC_MASK_MASK (0x100000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR20_SEC_MASK_SHIFT (20U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR20_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR20_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR20_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR21_SEC_MASK_MASK (0x200000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR21_SEC_MASK_SHIFT (21U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR21_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR21_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR21_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR22_SEC_MASK_MASK (0x400000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR22_SEC_MASK_SHIFT (22U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR22_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR22_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR22_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR23_SEC_MASK_MASK (0x800000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR23_SEC_MASK_SHIFT (23U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR23_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR23_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR23_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR24_SEC_MASK_MASK (0x1000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR24_SEC_MASK_SHIFT (24U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR24_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR24_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR24_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR25_SEC_MASK_MASK (0x2000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR25_SEC_MASK_SHIFT (25U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR25_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR25_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR25_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR26_SEC_MASK_MASK (0x4000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR26_SEC_MASK_SHIFT (26U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR26_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR26_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR26_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR27_SEC_MASK_MASK (0x8000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR27_SEC_MASK_SHIFT (27U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR27_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR27_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR27_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR28_SEC_MASK_MASK (0x10000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR28_SEC_MASK_SHIFT (28U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR28_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR28_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR28_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR29_SEC_MASK_MASK (0x20000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR29_SEC_MASK_SHIFT (29U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR29_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR29_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR29_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR30_SEC_MASK_MASK (0x40000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR30_SEC_MASK_SHIFT (30U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR30_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR30_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR30_SEC_MASK_MASK)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR31_SEC_MASK_MASK (0x80000000U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR31_SEC_MASK_SHIFT (31U)
#define AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR31_SEC_MASK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR31_SEC_MASK_SHIFT)) & AHB_SECURE_CTRL_SEC_HIFI4_INT_MASK_DSP_INTR31_SEC_MASK_MASK)
/*! @} */

/*! @name SEC_GPIO_MASK_LOCK - sec_gp_reg write-lock bits */
/*! @{ */
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG0_LOCK_MASK (0x3U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG0_LOCK_SHIFT (0U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG0_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG0_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG0_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG1_LOCK_MASK (0xCU)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG1_LOCK_SHIFT (2U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG1_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG1_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG1_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG2_LOCK_MASK (0x30U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG2_LOCK_SHIFT (4U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG2_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG2_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG2_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG3_LOCK_MASK (0xC0U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG3_LOCK_SHIFT (6U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG3_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG3_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG3_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG4_LOCK_MASK (0x300U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG4_LOCK_SHIFT (8U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG4_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG4_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG4_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG5_LOCK_MASK (0xC00U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG5_LOCK_SHIFT (10U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG5_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG5_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG5_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG6_LOCK_MASK (0x3000U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG6_LOCK_SHIFT (12U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG6_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG6_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG6_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG7_LOCK_MASK (0xC000U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG7_LOCK_SHIFT (14U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG7_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG7_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG7_LOCK_MASK)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG8_LOCK_MASK (0x30000U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG8_LOCK_SHIFT (16U)
#define AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG8_LOCK(x) (((uint32_t)(((uint32_t)(x)) << AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG8_LOCK_SHIFT)) & AHB_SECURE_CTRL_SEC_GPIO_MASK_LOCK_SEC_GP_REG8_LOCK_MASK)
/*! @} */

