JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name FFROCTL1 - FFRO control 1 */
/*! @{ */
#define CLKCTL0_FFROCTL1_UPDATE_MASK             (0x1U)
#define CLKCTL0_FFROCTL1_UPDATE_SHIFT            (0U)
/*! UPDATE - Update Safe Mode Control. In order to change any of the TRIM values, the user first
 *    needs to set the update safe mode bit, then proceed to change the respective TRIM values needed,
 *    followed by clearing the update safe mode bit.
 *  0b0..Normal Mode.
 *  0b1..Update Safe Mode.
 */
#define CLKCTL0_FFROCTL1_UPDATE(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FFROCTL1_UPDATE_SHIFT)) & CLKCTL0_FFROCTL1_UPDATE_MASK)
/*! @} */

/*! @name SFROCTL0 - SFRO control 0 */
/*! @{ */
#define CLKCTL0_SFROCTL0_TRIM_TEMPCO_MASK        (0xFU)
#define CLKCTL0_SFROCTL0_TRIM_TEMPCO_SHIFT       (0U)
#define CLKCTL0_SFROCTL0_TRIM_TEMPCO(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SFROCTL0_TRIM_TEMPCO_SHIFT)) & CLKCTL0_SFROCTL0_TRIM_TEMPCO_MASK)
#define CLKCTL0_SFROCTL0_TRIM_COARSE_MASK        (0x1F0U)
#define CLKCTL0_SFROCTL0_TRIM_COARSE_SHIFT       (4U)
#define CLKCTL0_SFROCTL0_TRIM_COARSE(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SFROCTL0_TRIM_COARSE_SHIFT)) & CLKCTL0_SFROCTL0_TRIM_COARSE_MASK)
#define CLKCTL0_SFROCTL0_TRIM_FINE_MASK          (0x3E00U)
#define CLKCTL0_SFROCTL0_TRIM_FINE_SHIFT         (9U)
#define CLKCTL0_SFROCTL0_TRIM_FINE(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SFROCTL0_TRIM_FINE_SHIFT)) & CLKCTL0_SFROCTL0_TRIM_FINE_MASK)
#define CLKCTL0_SFROCTL0_TRIM_DLY_MASK           (0x3C000U)
#define CLKCTL0_SFROCTL0_TRIM_DLY_SHIFT          (14U)
#define CLKCTL0_SFROCTL0_TRIM_DLY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SFROCTL0_TRIM_DLY_SHIFT)) & CLKCTL0_SFROCTL0_TRIM_DLY_MASK)
#define CLKCTL0_SFROCTL0_TRIM_IREF_MASK          (0x7C0000U)
#define CLKCTL0_SFROCTL0_TRIM_IREF_SHIFT         (18U)
#define CLKCTL0_SFROCTL0_TRIM_IREF(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SFROCTL0_TRIM_IREF_SHIFT)) & CLKCTL0_SFROCTL0_TRIM_IREF_MASK)
/*! @} */

/*! @name SYSOSCCTL0 - system oscillator control 0 */
/*! @{ */
#define CLKCTL0_SYSOSCCTL0_LP_ENABLE_MASK        (0x1U)
#define CLKCTL0_SYSOSCCTL0_LP_ENABLE_SHIFT       (0U)
/*! LP_ENABLE - Enable signal for low power mode. . .
 *  0b0..High Gain Mode(HP).
 *  0b1..Low Power mode (LP).
 */
#define CLKCTL0_SYSOSCCTL0_LP_ENABLE(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSOSCCTL0_LP_ENABLE_SHIFT)) & CLKCTL0_SYSOSCCTL0_LP_ENABLE_MASK)
#define CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE_MASK    (0x2U)
#define CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE_SHIFT   (1U)
/*! BYPASS_ENABLE - Enable signal for external bypass clock. . .
 *  0b0..Normal Mode.
 *  0b1..Bypass Mode.
 */
#define CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE_SHIFT)) & CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE_MASK)
/*! @} */

/*! @name SYSOSCBYPASS - system oscillator bypass */
/*! @{ */
#define CLKCTL0_SYSOSCBYPASS_SEL_MASK            (0x7U)
#define CLKCTL0_SYSOSCBYPASS_SEL_SHIFT           (0U)
/*! SEL - XTALIN Functional Clock Source Selection.
 *  0b000..External XTAL Clock.
 *  0b001..Clock IN Clock.
 *  0b010..Reserved.
 *  0b011..Reserved.
 *  0b100..Reserved.
 *  0b101..Reserved.
 *  0b110..Reserved.
 *  0b111..NONE.this may be selected in order to reduce power when no output is needed.
 */
#define CLKCTL0_SYSOSCBYPASS_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSOSCBYPASS_SEL_SHIFT)) & CLKCTL0_SYSOSCBYPASS_SEL_MASK)
/*! @} */

/*! @name LPOSCCTL0 - low power oscillator control 0 */
/*! @{ */
#define CLKCTL0_LPOSCCTL0_BIASCURRENT_MASK       (0xFFU)
#define CLKCTL0_LPOSCCTL0_BIASCURRENT_SHIFT      (0U)
#define CLKCTL0_LPOSCCTL0_BIASCURRENT(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_LPOSCCTL0_BIASCURRENT_SHIFT)) & CLKCTL0_LPOSCCTL0_BIASCURRENT_MASK)
#define CLKCTL0_LPOSCCTL0_PTAT_MASK              (0x3F00U)
#define CLKCTL0_LPOSCCTL0_PTAT_SHIFT             (8U)
#define CLKCTL0_LPOSCCTL0_PTAT(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_LPOSCCTL0_PTAT_SHIFT)) & CLKCTL0_LPOSCCTL0_PTAT_MASK)
#define CLKCTL0_LPOSCCTL0_ZTC_MASK               (0x3FC000U)
#define CLKCTL0_LPOSCCTL0_ZTC_SHIFT              (14U)
#define CLKCTL0_LPOSCCTL0_ZTC(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_LPOSCCTL0_ZTC_SHIFT)) & CLKCTL0_LPOSCCTL0_ZTC_MASK)
#define CLKCTL0_LPOSCCTL0_DIS_ZTC_MASK           (0x400000U)
#define CLKCTL0_LPOSCCTL0_DIS_ZTC_SHIFT          (22U)
#define CLKCTL0_LPOSCCTL0_DIS_ZTC(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_LPOSCCTL0_DIS_ZTC_SHIFT)) & CLKCTL0_LPOSCCTL0_DIS_ZTC_MASK)
#define CLKCTL0_LPOSCCTL0_CLKRDY_MASK            (0x80000000U)
#define CLKCTL0_LPOSCCTL0_CLKRDY_SHIFT           (31U)
#define CLKCTL0_LPOSCCTL0_CLKRDY(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_LPOSCCTL0_CLKRDY_SHIFT)) & CLKCTL0_LPOSCCTL0_CLKRDY_MASK)
/*! @} */

/*! @name OSC32KHZCTL0 - 32k oscillator control0 */
/*! @{ */
#define CLKCTL0_OSC32KHZCTL0_ENA32KHZ_MASK       (0x1U)
#define CLKCTL0_OSC32KHZCTL0_ENA32KHZ_SHIFT      (0U)
/*! ENA32KHZ - 32KHz Enable.
 *  0b0..disable
 *  0b1..enable
 */
#define CLKCTL0_OSC32KHZCTL0_ENA32KHZ(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_OSC32KHZCTL0_ENA32KHZ_SHIFT)) & CLKCTL0_OSC32KHZCTL0_ENA32KHZ_MASK)
/*! @} */

/*! @name SYSPLL0CLKSEL - system pll0 clock selection */
/*! @{ */
#define CLKCTL0_SYSPLL0CLKSEL_SEL_MASK           (0x7U)
#define CLKCTL0_SYSPLL0CLKSEL_SEL_SHIFT          (0U)
/*! SEL - System PLL Clock Source Selection. . .
 *  0b000..SFRO Clock.
 *  0b001..SYSXTALIN Clock.
 *  0b010..FFRO Clock Divided by 2.
 *  0b011..Reserved.
 *  0b100..Reserved.
 *  0b101..Reserved.
 *  0b110..Reserved.
 *  0b111..None, this may be selected in order to reduce power when no output is needed.
 */
#define CLKCTL0_SYSPLL0CLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CLKSEL_SEL_SHIFT)) & CLKCTL0_SYSPLL0CLKSEL_SEL_MASK)
/*! @} */

/*! @name SYSPLL0CTL0 - system pll0 control0 */
/*! @{ */
#define CLKCTL0_SYSPLL0CTL0_BYPASS_MASK          (0x1U)
#define CLKCTL0_SYSPLL0CTL0_BYPASS_SHIFT         (0U)
/*! BYPASS - SYSPLL0 BYPASS Mode
 *  0b0..PFD output is PFD programmed clock.
 *  0b1..PFD output is PLL Input clock. (Bypass)
 */
#define CLKCTL0_SYSPLL0CTL0_BYPASS(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_BYPASS_SHIFT)) & CLKCTL0_SYSPLL0CTL0_BYPASS_MASK)
#define CLKCTL0_SYSPLL0CTL0_RESET_MASK           (0x2U)
#define CLKCTL0_SYSPLL0CTL0_RESET_SHIFT          (1U)
/*! RESET - SYSPLL0 Reset:
 *  0b0..SYSPLL0 reset is removed.
 *  0b1..SYSPLL0 is placed into reset.
 */
#define CLKCTL0_SYSPLL0CTL0_RESET(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_RESET_SHIFT)) & CLKCTL0_SYSPLL0CTL0_RESET_MASK)
#define CLKCTL0_SYSPLL0CTL0_HALFLF_ENA_MASK      (0x8U)
#define CLKCTL0_SYSPLL0CTL0_HALFLF_ENA_SHIFT     (3U)
/*! HALFLF_ENA - Half Resistor in Low Pass Filter:
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_HALFLF_ENA(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_HALFLF_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_HALFLF_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_HALFCP_ENA_MASK      (0x10U)
#define CLKCTL0_SYSPLL0CTL0_HALFCP_ENA_SHIFT     (4U)
/*! HALFCP_ENA - Half Resistor Charge Pump:
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_HALFCP_ENA(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_HALFCP_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_HALFCP_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_DOUBLELF_ENA_MASK    (0x20U)
#define CLKCTL0_SYSPLL0CTL0_DOUBLELF_ENA_SHIFT   (5U)
/*! DOUBLELF_ENA - Use double resistor in low pass filter.
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_DOUBLELF_ENA(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_DOUBLELF_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_DOUBLELF_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_DOUBLECP_ENA_MASK    (0x40U)
#define CLKCTL0_SYSPLL0CTL0_DOUBLECP_ENA_SHIFT   (6U)
/*! DOUBLECP_ENA - Use doubled charge pump current.
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_DOUBLECP_ENA(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_DOUBLECP_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_DOUBLECP_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_DITHEREN_ENA_MASK    (0x800U)
#define CLKCTL0_SYSPLL0CTL0_DITHEREN_ENA_SHIFT   (11U)
/*! DITHEREN_ENA - Dither enable
 *  0b0..disable
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_DITHEREN_ENA(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_DITHEREN_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_DITHEREN_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_PFDOFFSETEN_ENA_MASK (0x1000U)
#define CLKCTL0_SYSPLL0CTL0_PFDOFFSETEN_ENA_SHIFT (12U)
/*! PFDOFFSETEN_ENA - Phase fractional diviver offset enable.
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_PFDOFFSETEN_ENA(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_PFDOFFSETEN_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_PFDOFFSETEN_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK (0x2000U)
#define CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_SHIFT (13U)
/*! HOLDRINGOFF_ENA - Hold Ring Off Control: This bit is used to avoid multi wave within the VCO.
 *  0b0..disbale
 *  0b1..enable
 */
#define CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_SHIFT)) & CLKCTL0_SYSPLL0CTL0_HOLDRINGOFF_ENA_MASK)
#define CLKCTL0_SYSPLL0CTL0_MULT_MASK            (0xFF0000U)
#define CLKCTL0_SYSPLL0CTL0_MULT_SHIFT           (16U)
/*! MULT - Multiplication Factor for FSYSPLL0_OUTPUT:
 *  0b00100001..Div 33
 *  0b00011011..Div 27
 *  0b00010110..Div 22
 *  0b00010100..Div 20
 *  0b00010001..Div 17
 *  0b00010000..Div 16
 */
#define CLKCTL0_SYSPLL0CTL0_MULT(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0CTL0_MULT_SHIFT)) & CLKCTL0_SYSPLL0CTL0_MULT_MASK)
/*! @} */

/*! @name SYSPLL0SS - syspll0 SS */
/*! @{ */
#define CLKCTL0_SYSPLL0SS_STEP_MASK              (0x7FFFU)
#define CLKCTL0_SYSPLL0SS_STEP_SHIFT             (0U)
#define CLKCTL0_SYSPLL0SS_STEP(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0SS_STEP_SHIFT)) & CLKCTL0_SYSPLL0SS_STEP_MASK)
#define CLKCTL0_SYSPLL0SS_ENSS_MASK              (0x8000U)
#define CLKCTL0_SYSPLL0SS_ENSS_SHIFT             (15U)
/*! ENSS - Enables the spread spectrum modulation.
 *  0b0..Spectrum modulation is disabled
 *  0b1..Spectrum modulation is enabled
 */
#define CLKCTL0_SYSPLL0SS_ENSS(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0SS_ENSS_SHIFT)) & CLKCTL0_SYSPLL0SS_ENSS_MASK)
#define CLKCTL0_SYSPLL0SS_STOP_MASK              (0xFFFF0000U)
#define CLKCTL0_SYSPLL0SS_STOP_SHIFT             (16U)
#define CLKCTL0_SYSPLL0SS_STOP(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_SYSPLL0SS_STOP_SHIFT)) & CLKCTL0_SYSPLL0SS_STOP_MASK)
/*! @} */

