JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name CHANNEL_DC_CTRL - DC Filter Control */
/*! @{ */
#define DMIC_CHANNEL_DC_CTRL_DCPOLE_MASK         (0x3U)
#define DMIC_CHANNEL_DC_CTRL_DCPOLE_SHIFT        (0U)
/*! DCPOLE - DC block filter
 *  0b00..Flat response, no filter.
 *  0b01..155 Hz.
 *  0b10..78 Hz.
 *  0b11..39 Hz
 */
#define DMIC_CHANNEL_DC_CTRL_DCPOLE(x)           (((uint32_t)(((uint32_t)(x)) << DMIC_CHANNEL_DC_CTRL_DCPOLE_SHIFT)) & DMIC_CHANNEL_DC_CTRL_DCPOLE_MASK)
#define DMIC_CHANNEL_DC_CTRL_DCGAIN_MASK         (0xF0U)
#define DMIC_CHANNEL_DC_CTRL_DCGAIN_SHIFT        (4U)
#define DMIC_CHANNEL_DC_CTRL_DCGAIN(x)           (((uint32_t)(((uint32_t)(x)) << DMIC_CHANNEL_DC_CTRL_DCGAIN_SHIFT)) & DMIC_CHANNEL_DC_CTRL_DCGAIN_MASK)
#define DMIC_CHANNEL_DC_CTRL_SATURATEAT16BIT_MASK (0x100U)
#define DMIC_CHANNEL_DC_CTRL_SATURATEAT16BIT_SHIFT (8U)
/*! SATURATEAT16BIT - Selects 16-bit saturation.
 *  0b0..Results roll over if out range and do not saturate.
 *  0b1..If the result overflows, it saturates at 0xFFFF for positive overflow and 0x8000 for negative overflow.
 */
#define DMIC_CHANNEL_DC_CTRL_SATURATEAT16BIT(x)  (((uint32_t)(((uint32_t)(x)) << DMIC_CHANNEL_DC_CTRL_SATURATEAT16BIT_SHIFT)) & DMIC_CHANNEL_DC_CTRL_SATURATEAT16BIT_MASK)
#define DMIC_CHANNEL_DC_CTRL_SIGNEXTEND_MASK     (0x200U)
#define DMIC_CHANNEL_DC_CTRL_SIGNEXTEND_SHIFT    (9U)
/*! SIGNEXTEND - Sign extend.
 *  0b0..The top byte of the FIFODATA register is always 0.
 *  0b1..The top byte of the FIFODATA register is sign extended. This allows processing of 24-bit audio data on 32-bit machines.
 */
#define DMIC_CHANNEL_DC_CTRL_SIGNEXTEND(x)       (((uint32_t)(((uint32_t)(x)) << DMIC_CHANNEL_DC_CTRL_SIGNEXTEND_SHIFT)) & DMIC_CHANNEL_DC_CTRL_SIGNEXTEND_MASK)
/*! @} */

/* The count of DMIC_CHANNEL_DC_CTRL */
#define DMIC_CHANNEL_DC_CTRL_COUNT               (8U)

/*! @name CHANEN - Channel Enable register */
/*! @{ */
#define DMIC_CHANEN_EN_CH0_MASK                  (0x1U)
#define DMIC_CHANEN_EN_CH0_SHIFT                 (0U)
#define DMIC_CHANEN_EN_CH0(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH0_SHIFT)) & DMIC_CHANEN_EN_CH0_MASK)
#define DMIC_CHANEN_EN_CH1_MASK                  (0x2U)
#define DMIC_CHANEN_EN_CH1_SHIFT                 (1U)
#define DMIC_CHANEN_EN_CH1(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH1_SHIFT)) & DMIC_CHANEN_EN_CH1_MASK)
#define DMIC_CHANEN_EN_CH2_MASK                  (0x4U)
#define DMIC_CHANEN_EN_CH2_SHIFT                 (2U)
#define DMIC_CHANEN_EN_CH2(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH2_SHIFT)) & DMIC_CHANEN_EN_CH2_MASK)
#define DMIC_CHANEN_EN_CH3_MASK                  (0x8U)
#define DMIC_CHANEN_EN_CH3_SHIFT                 (3U)
#define DMIC_CHANEN_EN_CH3(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH3_SHIFT)) & DMIC_CHANEN_EN_CH3_MASK)
#define DMIC_CHANEN_EN_CH4_MASK                  (0x10U)
#define DMIC_CHANEN_EN_CH4_SHIFT                 (4U)
#define DMIC_CHANEN_EN_CH4(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH4_SHIFT)) & DMIC_CHANEN_EN_CH4_MASK)
#define DMIC_CHANEN_EN_CH5_MASK                  (0x20U)
#define DMIC_CHANEN_EN_CH5_SHIFT                 (5U)
#define DMIC_CHANEN_EN_CH5(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH5_SHIFT)) & DMIC_CHANEN_EN_CH5_MASK)
#define DMIC_CHANEN_EN_CH6_MASK                  (0x40U)
#define DMIC_CHANEN_EN_CH6_SHIFT                 (6U)
#define DMIC_CHANEN_EN_CH6(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH6_SHIFT)) & DMIC_CHANEN_EN_CH6_MASK)
#define DMIC_CHANEN_EN_CH7_MASK                  (0x80U)
#define DMIC_CHANEN_EN_CH7_SHIFT                 (7U)
#define DMIC_CHANEN_EN_CH7(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_CHANEN_EN_CH7_SHIFT)) & DMIC_CHANEN_EN_CH7_MASK)
/*! @} */

/*! @name ONRATIO - Internal divider for decimator pipeline */
/*! @{ */
#define DMIC_ONRATIO_ONRATIO_MASK                (0x3U)
#define DMIC_ONRATIO_ONRATIO_SHIFT               (0U)
#define DMIC_ONRATIO_ONRATIO(x)                  (((uint32_t)(((uint32_t)(x)) << DMIC_ONRATIO_ONRATIO_SHIFT)) & DMIC_ONRATIO_ONRATIO_MASK)
/*! @} */

/*! @name INFREQSEL - Internal clock ratio (based on decimation rate) */
/*! @{ */
#define DMIC_INFREQSEL_FACTOR_MASK               (0xFU)
#define DMIC_INFREQSEL_FACTOR_SHIFT              (0U)
#define DMIC_INFREQSEL_FACTOR(x)                 (((uint32_t)(((uint32_t)(x)) << DMIC_INFREQSEL_FACTOR_SHIFT)) & DMIC_INFREQSEL_FACTOR_MASK)
/*! @} */

/*! @name IOCFG - I/O Configuration register */
/*! @{ */
#define DMIC_IOCFG_STEREO_DATA0_MASK             (0x4U)
#define DMIC_IOCFG_STEREO_DATA0_SHIFT            (2U)
/*! STEREO_DATA0 - Stereo PDM select.
 *  0b0..PDM_DATA01 is routed to PDM channels 0.
 *  0b1..PDM_DATA01 is routed to PDM channels 0 and 1.
 */
#define DMIC_IOCFG_STEREO_DATA0(x)               (((uint32_t)(((uint32_t)(x)) << DMIC_IOCFG_STEREO_DATA0_SHIFT)) & DMIC_IOCFG_STEREO_DATA0_MASK)
#define DMIC_IOCFG_STEREO_DATA2_MASK             (0x8U)
#define DMIC_IOCFG_STEREO_DATA2_SHIFT            (3U)
/*! STEREO_DATA2 - Stereo PDM select.
 *  0b0..PDM_DATA23 is routed to PDM channels 2.
 *  0b1..PDM_DATA23 is routed to PDM channels 2 and 3.
 */
#define DMIC_IOCFG_STEREO_DATA2(x)               (((uint32_t)(((uint32_t)(x)) << DMIC_IOCFG_STEREO_DATA2_SHIFT)) & DMIC_IOCFG_STEREO_DATA2_MASK)
#define DMIC_IOCFG_STEREO_DATA4_MASK             (0x10U)
#define DMIC_IOCFG_STEREO_DATA4_SHIFT            (4U)
/*! STEREO_DATA4 - Stereo PDM select.
 *  0b0..PDM_DATA45 is routed to PDM channels 4.
 *  0b1..PDM_DATA45 is routed to PDM channels 4 and 5.
 */
#define DMIC_IOCFG_STEREO_DATA4(x)               (((uint32_t)(((uint32_t)(x)) << DMIC_IOCFG_STEREO_DATA4_SHIFT)) & DMIC_IOCFG_STEREO_DATA4_MASK)
#define DMIC_IOCFG_STEREO_DATA6_MASK             (0x20U)
#define DMIC_IOCFG_STEREO_DATA6_SHIFT            (5U)
/*! STEREO_DATA6 - Stereo PDM select.
 *  0b0..PDM_DATA67 is routed to PDM channels 6.
 *  0b1..PDM_DATA67 is routed to PDM channels 6 and 7.
 */
#define DMIC_IOCFG_STEREO_DATA6(x)               (((uint32_t)(((uint32_t)(x)) << DMIC_IOCFG_STEREO_DATA6_SHIFT)) & DMIC_IOCFG_STEREO_DATA6_MASK)
/*! @} */

/*! @name USE2FS - Use 2FS register */
/*! @{ */
#define DMIC_USE2FS_USE2FS_MASK                  (0x1U)
#define DMIC_USE2FS_USE2FS_SHIFT                 (0U)
/*! USE2FS - Use 2FS register
 *  0b0..Use 1FS output for PCM data.
 *  0b1..Use 2FS output for PCM data.
 */
#define DMIC_USE2FS_USE2FS(x)                    (((uint32_t)(((uint32_t)(x)) << DMIC_USE2FS_USE2FS_SHIFT)) & DMIC_USE2FS_USE2FS_MASK)
/*! @} */

/*! @name HWVADGAIN - HWVAD input gain register */
/*! @{ */
#define DMIC_HWVADGAIN_GAIN_MASK                 (0xFU)
#define DMIC_HWVADGAIN_GAIN_SHIFT                (0U)
#define DMIC_HWVADGAIN_GAIN(x)                   (((uint32_t)(((uint32_t)(x)) << DMIC_HWVADGAIN_GAIN_SHIFT)) & DMIC_HWVADGAIN_GAIN_MASK)
/*! @} */

/*! @name HWVADHPFS - HWVAD filter control register */
/*! @{ */
#define DMIC_HWVADHPFS_FILTER_MASK               (0x3U)
#define DMIC_HWVADHPFS_FILTER_SHIFT              (0U)
/*! FILTER - This field chooses the High Pass filter in first part of HWVAD
 *  0b00..First filter by-pass.
 *  0b01..High pass filter with -3dB cut-off at 1750Hz.
 *  0b10..High pass filter with -3dB cut-off at 215Hz.
 *  0b11..Reserved.
 */
#define DMIC_HWVADHPFS_FILTER(x)                 (((uint32_t)(((uint32_t)(x)) << DMIC_HWVADHPFS_FILTER_SHIFT)) & DMIC_HWVADHPFS_FILTER_MASK)
/*! @} */

