JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name FIFOINTSTAT - FIFO interrupt status register. */
/*! @{ */
#define I2S_FIFOINTSTAT_TXERR_MASK               (0x1U)
#define I2S_FIFOINTSTAT_TXERR_SHIFT              (0U)
#define I2S_FIFOINTSTAT_TXERR(x)                 (((uint32_t)(((uint32_t)(x)) << I2S_FIFOINTSTAT_TXERR_SHIFT)) & I2S_FIFOINTSTAT_TXERR_MASK)
#define I2S_FIFOINTSTAT_RXERR_MASK               (0x2U)
#define I2S_FIFOINTSTAT_RXERR_SHIFT              (1U)
#define I2S_FIFOINTSTAT_RXERR(x)                 (((uint32_t)(((uint32_t)(x)) << I2S_FIFOINTSTAT_RXERR_SHIFT)) & I2S_FIFOINTSTAT_RXERR_MASK)
#define I2S_FIFOINTSTAT_TXLVL_MASK               (0x4U)
#define I2S_FIFOINTSTAT_TXLVL_SHIFT              (2U)
#define I2S_FIFOINTSTAT_TXLVL(x)                 (((uint32_t)(((uint32_t)(x)) << I2S_FIFOINTSTAT_TXLVL_SHIFT)) & I2S_FIFOINTSTAT_TXLVL_MASK)
#define I2S_FIFOINTSTAT_RXLVL_MASK               (0x8U)
#define I2S_FIFOINTSTAT_RXLVL_SHIFT              (3U)
#define I2S_FIFOINTSTAT_RXLVL(x)                 (((uint32_t)(((uint32_t)(x)) << I2S_FIFOINTSTAT_RXLVL_SHIFT)) & I2S_FIFOINTSTAT_RXLVL_MASK)
#define I2S_FIFOINTSTAT_PERINT_MASK              (0x10U)
#define I2S_FIFOINTSTAT_PERINT_SHIFT             (4U)
#define I2S_FIFOINTSTAT_PERINT(x)                (((uint32_t)(((uint32_t)(x)) << I2S_FIFOINTSTAT_PERINT_SHIFT)) & I2S_FIFOINTSTAT_PERINT_MASK)
/*! @} */

/*! @name FIFOWR - FIFO write data. */
/*! @{ */
#define I2S_FIFOWR_TXDATA_MASK                   (0xFFFFFFFFU)
#define I2S_FIFOWR_TXDATA_SHIFT                  (0U)
#define I2S_FIFOWR_TXDATA(x)                     (((uint32_t)(((uint32_t)(x)) << I2S_FIFOWR_TXDATA_SHIFT)) & I2S_FIFOWR_TXDATA_MASK)
/*! @} */

/*! @name FIFOWR48H - FIFO write data for upper data bits. May only be used if the I2S is configured for 2x 24-bit data and not using DMA. */
/*! @{ */
#define I2S_FIFOWR48H_TXDATA_MASK                (0xFFFFFFU)
#define I2S_FIFOWR48H_TXDATA_SHIFT               (0U)
#define I2S_FIFOWR48H_TXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << I2S_FIFOWR48H_TXDATA_SHIFT)) & I2S_FIFOWR48H_TXDATA_MASK)
/*! @} */

/*! @name FIFORD - FIFO read data. */
/*! @{ */
#define I2S_FIFORD_RXDATA_MASK                   (0xFFFFFFFFU)
#define I2S_FIFORD_RXDATA_SHIFT                  (0U)
#define I2S_FIFORD_RXDATA(x)                     (((uint32_t)(((uint32_t)(x)) << I2S_FIFORD_RXDATA_SHIFT)) & I2S_FIFORD_RXDATA_MASK)
/*! @} */

/*! @name FIFORD48H - FIFO read data for upper data bits. May only be used if the I2S is configured for 2x 24-bit data and not using DMA. */
/*! @{ */
#define I2S_FIFORD48H_RXDATA_MASK                (0xFFFFFFU)
#define I2S_FIFORD48H_RXDATA_SHIFT               (0U)
#define I2S_FIFORD48H_RXDATA(x)                  (((uint32_t)(((uint32_t)(x)) << I2S_FIFORD48H_RXDATA_SHIFT)) & I2S_FIFORD48H_RXDATA_MASK)
/*! @} */

/*! @name FIFORDNOPOP - FIFO data read with no FIFO pop. */
/*! @{ */
#define I2S_FIFORDNOPOP_RXDATA_MASK              (0xFFFFFFFFU)
#define I2S_FIFORDNOPOP_RXDATA_SHIFT             (0U)
#define I2S_FIFORDNOPOP_RXDATA(x)                (((uint32_t)(((uint32_t)(x)) << I2S_FIFORDNOPOP_RXDATA_SHIFT)) & I2S_FIFORDNOPOP_RXDATA_MASK)
/*! @} */

/*! @name FIFORD48HNOPOP - FIFO data read for upper data bits with no FIFO pop. May only be used if the I2S is configured for 2x 24-bit data and not using DMA. */
/*! @{ */
#define I2S_FIFORD48HNOPOP_RXDATA_MASK           (0xFFFFFFU)
#define I2S_FIFORD48HNOPOP_RXDATA_SHIFT          (0U)
#define I2S_FIFORD48HNOPOP_RXDATA(x)             (((uint32_t)(((uint32_t)(x)) << I2S_FIFORD48HNOPOP_RXDATA_SHIFT)) & I2S_FIFORD48HNOPOP_RXDATA_MASK)
/*! @} */

/*! @name FIFOSIZE - FIFO size register */
/*! @{ */
#define I2S_FIFOSIZE_fifosize_MASK               (0x1FU)
#define I2S_FIFOSIZE_fifosize_SHIFT              (0U)
#define I2S_FIFOSIZE_fifosize(x)                 (((uint32_t)(((uint32_t)(x)) << I2S_FIFOSIZE_fifosize_SHIFT)) & I2S_FIFOSIZE_fifosize_MASK)
/*! @} */

/*! @name ID - I2S Module identification */
/*! @{ */
#define I2S_ID_Aperture_MASK                     (0xFFU)
#define I2S_ID_Aperture_SHIFT                    (0U)
#define I2S_ID_Aperture(x)                       (((uint32_t)(((uint32_t)(x)) << I2S_ID_Aperture_SHIFT)) & I2S_ID_Aperture_MASK)
#define I2S_ID_Minor_Rev_MASK                    (0xF00U)
#define I2S_ID_Minor_Rev_SHIFT                   (8U)
#define I2S_ID_Minor_Rev(x)                      (((uint32_t)(((uint32_t)(x)) << I2S_ID_Minor_Rev_SHIFT)) & I2S_ID_Minor_Rev_MASK)
#define I2S_ID_Major_Rev_MASK                    (0xF000U)
#define I2S_ID_Major_Rev_SHIFT                   (12U)
#define I2S_ID_Major_Rev(x)                      (((uint32_t)(((uint32_t)(x)) << I2S_ID_Major_Rev_SHIFT)) & I2S_ID_Major_Rev_MASK)
#define I2S_ID_ID_MASK                           (0xFFFF0000U)
#define I2S_ID_ID_SHIFT                          (16U)
#define I2S_ID_ID(x)                             (((uint32_t)(((uint32_t)(x)) << I2S_ID_ID_SHIFT)) & I2S_ID_ID_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group I2S_Register_Masks */


/* I2S - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral I2S0 base address */
  #define I2S0_BASE                                (0x50106000u)
  /** Peripheral I2S0 base address */
  #define I2S0_BASE_NS                             (0x40106000u)
  /** Peripheral I2S0 base pointer */
  #define I2S0                                     ((I2S_Type *)I2S0_BASE)
  /** Peripheral I2S0 base pointer */
  #define I2S0_NS                                  ((I2S_Type *)I2S0_BASE_NS)
  /** Peripheral I2S1 base address */
  #define I2S1_BASE                                (0x50107000u)
  /** Peripheral I2S1 base address */
  #define I2S1_BASE_NS                             (0x40107000u)
  /** Peripheral I2S1 base pointer */
  #define I2S1                                     ((I2S_Type *)I2S1_BASE)
  /** Peripheral I2S1 base pointer */
  #define I2S1_NS                                  ((I2S_Type *)I2S1_BASE_NS)
  /** Peripheral I2S2 base address */
  #define I2S2_BASE                                (0x50108000u)
  /** Peripheral I2S2 base address */
  #define I2S2_BASE_NS                             (0x40108000u)
  /** Peripheral I2S2 base pointer */
  #define I2S2                                     ((I2S_Type *)I2S2_BASE)
  /** Peripheral I2S2 base pointer */
  #define I2S2_NS                                  ((I2S_Type *)I2S2_BASE_NS)
  /** Peripheral I2S3 base address */
  #define I2S3_BASE                                (0x50109000u)
  /** Peripheral I2S3 base address */
  #define I2S3_BASE_NS                             (0x40109000u)
  /** Peripheral I2S3 base pointer */
  #define I2S3                                     ((I2S_Type *)I2S3_BASE)
  /** Peripheral I2S3 base pointer */
  #define I2S3_NS                                  ((I2S_Type *)I2S3_BASE_NS)
  /** Peripheral I2S4 base address */
  #define I2S4_BASE                                (0x50122000u)
  /** Peripheral I2S4 base address */
  #define I2S4_BASE_NS                             (0x40122000u)
  /** Peripheral I2S4 base pointer */
  #define I2S4                                     ((I2S_Type *)I2S4_BASE)
  /** Peripheral I2S4 base pointer */
  #define I2S4_NS                                  ((I2S_Type *)I2S4_BASE_NS)
  /** Peripheral I2S5 base address */
  #define I2S5_BASE                                (0x50123000u)
  /** Peripheral I2S5 base address */
  #define I2S5_BASE_NS                             (0x40123000u)
  /** Peripheral I2S5 base pointer */
  #define I2S5                                     ((I2S_Type *)I2S5_BASE)
  /** Peripheral I2S5 base pointer */
  #define I2S5_NS                                  ((I2S_Type *)I2S5_BASE_NS)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { I2S0_BASE, I2S1_BASE, I2S2_BASE, I2S3_BASE, I2S4_BASE, I2S5_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { I2S0, I2S1, I2S2, I2S3, I2S4, I2S5 }
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS_NS                        { I2S0_BASE_NS, I2S1_BASE_NS, I2S2_BASE_NS, I2S3_BASE_NS, I2S4_BASE_NS, I2S5_BASE_NS }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS_NS                         { I2S0_NS, I2S1_NS, I2S2_NS, I2S3_NS, I2S4_NS, I2S5_NS }
#else
  /** Peripheral I2S0 base address */
  #define I2S0_BASE                                (0x40106000u)
  /** Peripheral I2S0 base pointer */
  #define I2S0                                     ((I2S_Type *)I2S0_BASE)
  /** Peripheral I2S1 base address */
  #define I2S1_BASE                                (0x40107000u)
  /** Peripheral I2S1 base pointer */
  #define I2S1                                     ((I2S_Type *)I2S1_BASE)
  /** Peripheral I2S2 base address */
  #define I2S2_BASE                                (0x40108000u)
  /** Peripheral I2S2 base pointer */
  #define I2S2                                     ((I2S_Type *)I2S2_BASE)
  /** Peripheral I2S3 base address */
  #define I2S3_BASE                                (0x40109000u)
  /** Peripheral I2S3 base pointer */
  #define I2S3                                     ((I2S_Type *)I2S3_BASE)
  /** Peripheral I2S4 base address */
  #define I2S4_BASE                                (0x40122000u)
  /** Peripheral I2S4 base pointer */
  #define I2S4                                     ((I2S_Type *)I2S4_BASE)
  /** Peripheral I2S5 base address */
  #define I2S5_BASE                                (0x40123000u)
  /** Peripheral I2S5 base pointer */
  #define I2S5                                     ((I2S_Type *)I2S5_BASE)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { I2S0_BASE, I2S1_BASE, I2S2_BASE, I2S3_BASE, I2S4_BASE, I2S5_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { I2S0, I2S1, I2S2, I2S3, I2S4, I2S5 }
#endif
/** Interrupt vectors for the I2S peripheral type */
#define I2S_IRQS                                 { FLEXCOMM0_IRQn, FLEXCOMM1_IRQn, FLEXCOMM2_IRQn, FLEXCOMM3_IRQn, FLEXCOMM4_IRQn, FLEXCOMM5_IRQn }

/*!
 * @}
 */ /* end of group I2S_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- I3C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Peripheral_Access_Layer I3C Peripheral Access Layer
 * @{
 */

/** I3C - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCONFIG;                           /**< Configuration for Master., offset: 0x0 */
  __IO uint32_t CONFIG;                            /**< Configuration fields for things setup before block is activated, offset: 0x4 */
  __IO uint32_t STATUS;                            /**< Status for Master and Slave. Not all bits used if only Slave. This document only explains the slave bits., offset: 0x8 */
  __IO uint32_t CTRL;                              /**< Control for active use - in particular event generation (e.g. interrupts to the Master), offset: 0xC */
  __IO uint32_t INTSET;                            /**< Interrupt enable, offset: 0x10 */
  __IO uint32_t INTCLR;                            /**< Interrupt disable, offset: 0x14 */
  __I  uint32_t INTMASKED;                         /**< Mask of sourced interrupts (STATUS and INTSET), offset: 0x18 */
  __IO uint32_t ERRWARN;                           /**< Error and Warning state from protocol errors and issues. Related to ERRWARN status and interrupt., offset: 0x1C */
  __IO uint32_t DMACTRL;                           /**< DMA control register, if DMA is enabled in the block., offset: 0x20 */
       uint8_t RESERVED_0[8];
  __IO uint32_t DATACTRL;                          /**< Allows control of data buffering and indicates current buffer state.If FIFO enabled, this is also the FIFO control., offset: 0x2C */
  __O  uint32_t WDATAB;                            /**< Write a byte of data, including use of a 9th bit to mark as end (last byte), offset: 0x30 */
  __O  uint32_t WDATABE;                           /**< Write a byte of data, which is end (last byte)., offset: 0x34 */
  __O  uint32_t WDATAH;                            /**< Write a half-word of data, including use of a 16th bit to mark as end (last byte of half-word is end)., offset: 0x38 */
  __O  uint32_t WDATAHE;                           /**< Write a half-word of data, which is end (last byte of half-word is end)., offset: 0x3C */
  __I  uint32_t RDATAB;                            /**< Read a byte of data, offset: 0x40 */
       uint8_t RESERVED_1[4];
  __I  uint32_t RDATAH;                            /**< Read a half-word of data, offset: 0x48 */
       uint8_t RESERVED_2[20];
  __I  uint32_t CAPABILITIES;                      /**< Indicates what is available/supported in this block, including Master and/or Slave, HDR modes, etc., offset: 0x60 */
  __IO uint32_t DYNADDR;                           /**< Dynamic address once assigned, else 0., offset: 0x64 */
  __IO uint32_t MAXLIMITS;                         /**< Indicates the limits set by the Master (or the original requested limits)., offset: 0x68 */
  __IO uint32_t IDPARTNO;                          /**< Allows application to write the ID part-number if configured to provide by register, offset: 0x6C */
  __IO uint32_t IDEXT;                             /**< Allows application to write the ID extension of DCR and/or BCR and/or instance if so configured, offset: 0x70 */
  __IO uint32_t VENDORID;                          /**< Allows application to write the Vendor ID if so configured., offset: 0x74 */
  __IO uint32_t TCCLOCK;                           /**< Allows application to set Time control clock and accuracy info dynamically., offset: 0x78 */
       uint8_t RESERVED_3[8];
  __IO uint32_t MCTRL;                             /**< Master main control. Starts actions on bus, offset: 0x84 */
  __IO uint32_t MSTATUS;                           /**< Status for Master, including interrupt causes. Parallel to Slave STATUS., offset: 0x88 */
  __IO uint32_t IBIRULES;                          /**< Rules for IBI use, and registry of Slaves which use IBI byte., offset: 0x8C */
  __IO uint32_t MINTSET;                           /**< Interrupt enable - parallel to Slave INTSET, only one is active depending on current state, offset: 0x90 */
  __O  uint32_t MINTCLR;                           /**< Interrupt disable - parallel to Slave INTCLR., offset: 0x94 */
  __I  uint32_t MINTMASKED;                        /**< Mask of sourced interrupts (MSTATUS and MINTSET), offset: 0x98 */
  __IO uint32_t MERRWARN;                          /**< Error and Warning state from misuse of registers and detected errors on bus. Related to ERRWARN bit in MSTATUS. Parallel to Slave ERRWARN., offset: 0x9C */
  __IO uint32_t MDMACTRL;                          /**< DMA control register, if DMA is enabled in the block. Alias of Slave DMACTRL, offset: 0xA0 */
       uint8_t RESERVED_4[8];
  __IO uint32_t MDATACTRL;                         /**< Allows control of data buffering and indicates current buffer state. Alias of Slave DATACTRL If FIFO enabled, this is also the FIFO control., offset: 0xAC */
  __O  uint32_t MWDATAB;                           /**< Write a byte of data, possibly last. Alias of WDATAB., offset: 0xB0 */
  __O  uint32_t MWDATABE;                          /**< Write last byte. Alias of WDATABE., offset: 0xB4 */
  __O  uint32_t MWDATAH;                           /**< Write a Half-word of data, possibly last. Alias of WDATAH., offset: 0xB8 */
  __O  uint32_t MWDATAHE;                          /**< Write last half-word. Alias of WDATAHE., offset: 0xBC */
  __I  uint32_t MRDATAB;                           /**< Read a byte of data. Alias of RDATAB., offset: 0xC0 */
       uint8_t RESERVED_5[4];
  __I  uint32_t MRDATAH;                           /**< Read a half-word of data. Alias of RDATAH., offset: 0xC8 */
       uint8_t RESERVED_6[4];
  __O  uint32_t MWMSG_SDR;                         /**< Setup and push through a message in SDR mode. Written with 16b words., offset: 0xD0 */
  __I  uint32_t MRMSG_SDR;                         /**< Read content from Slave in message mode. Read as 16b words., offset: 0xD4 */
  __O  uint32_t MWMSG_DDR;                         /**< Setup and push through a message in DDR mode. Written with 16b words., offset: 0xD8 */
  __IO uint32_t MRMSG_DDR;                         /**< Read content from Slave in DDR message mode. Read as 16b words., offset: 0xDC */
       uint8_t RESERVED_7[4];
  __IO uint32_t MDYNADDR;                          /**< Allows writing own Dynamic Address for when switches to Slave mode, offset: 0xE4 */
       uint8_t RESERVED_8[3860];
  __I  uint32_t ID;                                /**< Block ID and revision., offset: 0xFFC */
} I3C_Type;

/* ----------------------------------------------------------------------------
   -- I3C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Register_Masks I3C Register Masks
 * @{
 */

/*! @name MCONFIG - Configuration for Master. */
/*! @{ */
#define I3C_MCONFIG_MSTENA_MASK                  (0x3U)
#define I3C_MCONFIG_MSTENA_SHIFT                 (0U)
/*! MSTENA - Indicates if master is enabled and what "states" are allowed for it
 *  0b00..Master off - not enabled. May only use Slave (if enabled).
 *  0b01..Master on; when used from start, means is Master by default (Main master). Will be controlling bus
 *        unless master is handed off. Will need to move to 2 if that happens. The handoff means emitting GETACCMST and
 *        if accepted, emitting a STOP and setting this bit to 2 (or 0).
 *  0b10..Master capable; acting as slave now. When used from start, will start as slave, but be prepared to
 *        switch to Master. To switch to master, the Slave emits an MR or gets a GETACCMST CCC and accepts it to switch
 *        on the STOP.
 *  0b11..reserved
 */
#define I3C_MCONFIG_MSTENA(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_MSTENA_SHIFT)) & I3C_MCONFIG_MSTENA_MASK)
#define I3C_MCONFIG_DISTO_MASK                   (0x8U)
#define I3C_MCONFIG_DISTO_SHIFT                  (3U)
#define I3C_MCONFIG_DISTO(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_DISTO_SHIFT)) & I3C_MCONFIG_DISTO_MASK)
#define I3C_MCONFIG_HKEEP_MASK                   (0x30U)
#define I3C_MCONFIG_HKEEP_SHIFT                  (4U)
/*! HKEEP - Indicates how High-Keeper is to be supported
 *  0b00..None, use PUR. Hold SCL High
 *  0b01..Wired in, use pin_HK controls. SCL may use a HK or that signal (pin_HK_SCL) may only OR into SCL_oena.
 *  0b10..Passive on SDA, can Hi-Z for Bus Free (IDLE) and hold
 *  0b11..Passive on SDA and SCL, can Hi-Z both for Bus Free (IDLE), and can Hi-Z SDA for hold
 */
#define I3C_MCONFIG_HKEEP(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_HKEEP_SHIFT)) & I3C_MCONFIG_HKEEP_MASK)
#define I3C_MCONFIG_ODSTOP_MASK                  (0x40U)
#define I3C_MCONFIG_ODSTOP_SHIFT                 (6U)
#define I3C_MCONFIG_ODSTOP(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_ODSTOP_SHIFT)) & I3C_MCONFIG_ODSTOP_MASK)
#define I3C_MCONFIG_PERLOW_MASK                  (0x80U)
#define I3C_MCONFIG_PERLOW_SHIFT                 (7U)
#define I3C_MCONFIG_PERLOW(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_PERLOW_SHIFT)) & I3C_MCONFIG_PERLOW_MASK)
#define I3C_MCONFIG_PPBAUD_MASK                  (0xF00U)
#define I3C_MCONFIG_PPBAUD_SHIFT                 (8U)
#define I3C_MCONFIG_PPBAUD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_PPBAUD_SHIFT)) & I3C_MCONFIG_PPBAUD_MASK)
#define I3C_MCONFIG_PPLOW_MASK                   (0xF000U)
#define I3C_MCONFIG_PPLOW_SHIFT                  (12U)
#define I3C_MCONFIG_PPLOW(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_PPLOW_SHIFT)) & I3C_MCONFIG_PPLOW_MASK)
#define I3C_MCONFIG_ODBAUD_MASK                  (0xFF0000U)
#define I3C_MCONFIG_ODBAUD_SHIFT                 (16U)
#define I3C_MCONFIG_ODBAUD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_ODBAUD_SHIFT)) & I3C_MCONFIG_ODBAUD_MASK)
#define I3C_MCONFIG_ODHPP_MASK                   (0x1000000U)
#define I3C_MCONFIG_ODHPP_SHIFT                  (24U)
#define I3C_MCONFIG_ODHPP(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_ODHPP_SHIFT)) & I3C_MCONFIG_ODHPP_MASK)
#define I3C_MCONFIG_SKEW_MASK                    (0xE000000U)
#define I3C_MCONFIG_SKEW_SHIFT                   (25U)
#define I3C_MCONFIG_SKEW(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_SKEW_SHIFT)) & I3C_MCONFIG_SKEW_MASK)
#define I3C_MCONFIG_I2CBAUD_MASK                 (0xF0000000U)
#define I3C_MCONFIG_I2CBAUD_SHIFT                (28U)
#define I3C_MCONFIG_I2CBAUD(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MCONFIG_I2CBAUD_SHIFT)) & I3C_MCONFIG_I2CBAUD_MASK)
/*! @} */

/*! @name CONFIG - Configuration fields for things setup before block is activated */
/*! @{ */
#define I3C_CONFIG_SLVENA_MASK                   (0x1U)
#define I3C_CONFIG_SLVENA_SHIFT                  (0U)
#define I3C_CONFIG_SLVENA(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_SLVENA_SHIFT)) & I3C_CONFIG_SLVENA_MASK)
#define I3C_CONFIG_NACK_MASK                     (0x2U)
#define I3C_CONFIG_NACK_SHIFT                    (1U)
#define I3C_CONFIG_NACK(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_NACK_SHIFT)) & I3C_CONFIG_NACK_MASK)
#define I3C_CONFIG_MATCHSS_MASK                  (0x4U)
#define I3C_CONFIG_MATCHSS_SHIFT                 (2U)
#define I3C_CONFIG_MATCHSS(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_MATCHSS_SHIFT)) & I3C_CONFIG_MATCHSS_MASK)
#define I3C_CONFIG_S0IGNORE_MASK                 (0x8U)
#define I3C_CONFIG_S0IGNORE_SHIFT                (3U)
#define I3C_CONFIG_S0IGNORE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_S0IGNORE_SHIFT)) & I3C_CONFIG_S0IGNORE_MASK)
#define I3C_CONFIG_DDROK_MASK                    (0x10U)
#define I3C_CONFIG_DDROK_SHIFT                   (4U)
#define I3C_CONFIG_DDROK(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_DDROK_SHIFT)) & I3C_CONFIG_DDROK_MASK)
#define I3C_CONFIG_TSPOK_MASK                    (0x20U)
#define I3C_CONFIG_TSPOK_SHIFT                   (5U)
#define I3C_CONFIG_TSPOK(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_TSPOK_SHIFT)) & I3C_CONFIG_TSPOK_MASK)
#define I3C_CONFIG_TSLOK_MASK                    (0x40U)
#define I3C_CONFIG_TSLOK_SHIFT                   (6U)
#define I3C_CONFIG_TSLOK(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_TSLOK_SHIFT)) & I3C_CONFIG_TSLOK_MASK)
#define I3C_CONFIG_IDRAND_MASK                   (0x100U)
#define I3C_CONFIG_IDRAND_SHIFT                  (8U)
#define I3C_CONFIG_IDRAND(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_IDRAND_SHIFT)) & I3C_CONFIG_IDRAND_MASK)
#define I3C_CONFIG_OFFLINE_MASK                  (0x200U)
#define I3C_CONFIG_OFFLINE_SHIFT                 (9U)
#define I3C_CONFIG_OFFLINE(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_OFFLINE_SHIFT)) & I3C_CONFIG_OFFLINE_MASK)
#define I3C_CONFIG_BAMATCH_MASK                  (0xFF0000U)
#define I3C_CONFIG_BAMATCH_SHIFT                 (16U)
#define I3C_CONFIG_BAMATCH(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_BAMATCH_SHIFT)) & I3C_CONFIG_BAMATCH_MASK)
#define I3C_CONFIG_SADDR_MASK                    (0xFE000000U)
#define I3C_CONFIG_SADDR_SHIFT                   (25U)
#define I3C_CONFIG_SADDR(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CONFIG_SADDR_SHIFT)) & I3C_CONFIG_SADDR_MASK)
/*! @} */

