JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name STATUS - Status for Master and Slave. Not all bits used if only Slave. This document only explains the slave bits. */
/*! @{ */
#define I3C_STATUS_STNOTSTOP_MASK                (0x1U)
#define I3C_STATUS_STNOTSTOP_SHIFT               (0U)
#define I3C_STATUS_STNOTSTOP(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STNOTSTOP_SHIFT)) & I3C_STATUS_STNOTSTOP_MASK)
#define I3C_STATUS_STMSG_MASK                    (0x2U)
#define I3C_STATUS_STMSG_SHIFT                   (1U)
#define I3C_STATUS_STMSG(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STMSG_SHIFT)) & I3C_STATUS_STMSG_MASK)
#define I3C_STATUS_STCCCH_MASK                   (0x4U)
#define I3C_STATUS_STCCCH_SHIFT                  (2U)
#define I3C_STATUS_STCCCH(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STCCCH_SHIFT)) & I3C_STATUS_STCCCH_MASK)
#define I3C_STATUS_STREQRD_MASK                  (0x8U)
#define I3C_STATUS_STREQRD_SHIFT                 (3U)
#define I3C_STATUS_STREQRD(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STREQRD_SHIFT)) & I3C_STATUS_STREQRD_MASK)
#define I3C_STATUS_STREQWR_MASK                  (0x10U)
#define I3C_STATUS_STREQWR_SHIFT                 (4U)
#define I3C_STATUS_STREQWR(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STREQWR_SHIFT)) & I3C_STATUS_STREQWR_MASK)
#define I3C_STATUS_STDAA_MASK                    (0x20U)
#define I3C_STATUS_STDAA_SHIFT                   (5U)
#define I3C_STATUS_STDAA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STDAA_SHIFT)) & I3C_STATUS_STDAA_MASK)
#define I3C_STATUS_STHDR_MASK                    (0x40U)
#define I3C_STATUS_STHDR_SHIFT                   (6U)
#define I3C_STATUS_STHDR(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STHDR_SHIFT)) & I3C_STATUS_STHDR_MASK)
#define I3C_STATUS_START_MASK                    (0x100U)
#define I3C_STATUS_START_SHIFT                   (8U)
#define I3C_STATUS_START(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_START_SHIFT)) & I3C_STATUS_START_MASK)
#define I3C_STATUS_MATCHED_MASK                  (0x200U)
#define I3C_STATUS_MATCHED_SHIFT                 (9U)
#define I3C_STATUS_MATCHED(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_MATCHED_SHIFT)) & I3C_STATUS_MATCHED_MASK)
#define I3C_STATUS_STOP_MASK                     (0x400U)
#define I3C_STATUS_STOP_SHIFT                    (10U)
#define I3C_STATUS_STOP(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_STOP_SHIFT)) & I3C_STATUS_STOP_MASK)
#define I3C_STATUS_RX_PEND_MASK                  (0x800U)
#define I3C_STATUS_RX_PEND_SHIFT                 (11U)
#define I3C_STATUS_RX_PEND(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_RX_PEND_SHIFT)) & I3C_STATUS_RX_PEND_MASK)
#define I3C_STATUS_TXNOTFULL_MASK                (0x1000U)
#define I3C_STATUS_TXNOTFULL_SHIFT               (12U)
#define I3C_STATUS_TXNOTFULL(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_TXNOTFULL_SHIFT)) & I3C_STATUS_TXNOTFULL_MASK)
#define I3C_STATUS_DACHG_MASK                    (0x2000U)
#define I3C_STATUS_DACHG_SHIFT                   (13U)
#define I3C_STATUS_DACHG(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_DACHG_SHIFT)) & I3C_STATUS_DACHG_MASK)
#define I3C_STATUS_CCC_MASK                      (0x4000U)
#define I3C_STATUS_CCC_SHIFT                     (14U)
#define I3C_STATUS_CCC(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_CCC_SHIFT)) & I3C_STATUS_CCC_MASK)
#define I3C_STATUS_ERRWARN_MASK                  (0x8000U)
#define I3C_STATUS_ERRWARN_SHIFT                 (15U)
#define I3C_STATUS_ERRWARN(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_ERRWARN_SHIFT)) & I3C_STATUS_ERRWARN_MASK)
#define I3C_STATUS_HDRMATCH_MASK                 (0x10000U)
#define I3C_STATUS_HDRMATCH_SHIFT                (16U)
#define I3C_STATUS_HDRMATCH(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_HDRMATCH_SHIFT)) & I3C_STATUS_HDRMATCH_MASK)
#define I3C_STATUS_CHANDLED_MASK                 (0x20000U)
#define I3C_STATUS_CHANDLED_SHIFT                (17U)
#define I3C_STATUS_CHANDLED(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_CHANDLED_SHIFT)) & I3C_STATUS_CHANDLED_MASK)
#define I3C_STATUS_EVENT_MASK                    (0x40000U)
#define I3C_STATUS_EVENT_SHIFT                   (18U)
#define I3C_STATUS_EVENT(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_EVENT_SHIFT)) & I3C_STATUS_EVENT_MASK)
#define I3C_STATUS_EVDET_MASK                    (0x300000U)
#define I3C_STATUS_EVDET_SHIFT                   (20U)
/*! EVDET - Current details of last (EVENT=1) or pending event
 *  0b00..None
 *  0b01..Request not sent yet. Either no START yet, or waiting for Bus-Available or Bus-Idle (HJ).
 *  0b10..Request sent and NACKed - will try again
 *  0b11..Request sent and ACKed, so Done (unless time control data being sent still).
 */
#define I3C_STATUS_EVDET(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_EVDET_SHIFT)) & I3C_STATUS_EVDET_MASK)
#define I3C_STATUS_IBIDIS_MASK                   (0x1000000U)
#define I3C_STATUS_IBIDIS_SHIFT                  (24U)
#define I3C_STATUS_IBIDIS(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_IBIDIS_SHIFT)) & I3C_STATUS_IBIDIS_MASK)
#define I3C_STATUS_MRDIS_MASK                    (0x2000000U)
#define I3C_STATUS_MRDIS_SHIFT                   (25U)
#define I3C_STATUS_MRDIS(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_MRDIS_SHIFT)) & I3C_STATUS_MRDIS_MASK)
#define I3C_STATUS_HJDIS_MASK                    (0x8000000U)
#define I3C_STATUS_HJDIS_SHIFT                   (27U)
#define I3C_STATUS_HJDIS(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_HJDIS_SHIFT)) & I3C_STATUS_HJDIS_MASK)
#define I3C_STATUS_ACTSTATE_MASK                 (0x30000000U)
#define I3C_STATUS_ACTSTATE_SHIFT                (28U)
/*! ACTSTATE - Activity state from CCC
 *  0b00..No Latency - normal bus operations
 *  0b01..1ms of latency
 *  0b10..100ms of latency
 *  0b11..10s of latency
 */
#define I3C_STATUS_ACTSTATE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_ACTSTATE_SHIFT)) & I3C_STATUS_ACTSTATE_MASK)
#define I3C_STATUS_TIMECTRL_MASK                 (0xC0000000U)
#define I3C_STATUS_TIMECTRL_SHIFT                (30U)
/*! TIMECTRL - Indicates if time control is currently enabled
 *  0b00..No time control is enabled
 *  0b01..Synchronous is enabled â if supported
 *  0b10..Asynchronous standard mode (0 or 1) is enabled â if supported
 *  0b11..reserved
 */
#define I3C_STATUS_TIMECTRL(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_STATUS_TIMECTRL_SHIFT)) & I3C_STATUS_TIMECTRL_MASK)
/*! @} */

/*! @name CTRL - Control for active use - in particular event generation (e.g. interrupts to the Master) */
/*! @{ */
#define I3C_CTRL_EVENT_MASK                      (0x3U)
#define I3C_CTRL_EVENT_SHIFT                     (0U)
/*! EVENT - If set to non-0, will request an event. Once requested, STATUS.EVENT and EVDET will show
 *    the status as it progresses. Once completed, the field will automatically return to 0. Once
 *    non-0, only 0 can be written (to cancel) until done.
 *  0b00..Normal mode. If set to 0 after was a non-0 value, will cancel if not already in flight.
 *  0b01..Start an IBI. This will try to push through an IBI on the bus. If data associated with the IBI, it will
 *        be drawn from the IBIDATA field. Note that if Time control is enabled, this will include any time control
 *        related bytes; further, the IBIDATA byte will have bit 7 set to 1 automatically (as is required for time
 *        control). The interrupt will occur after the 1st (Mandatory) IBIDATA, if any.
 *  0b10..Start Master-Request or Peer-to-Peer request: the meaning depending on BCR register configured in the block.
 *  0b11..Start Hot-Join request. This should only be used when device is powered on after bus is already up, or
 *        is connected by hot insertion. Will wait for Bus Idle. This must be set before the Enable in the CONFIG.
 */
#define I3C_CTRL_EVENT(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_EVENT_SHIFT)) & I3C_CTRL_EVENT_MASK)
#define I3C_CTRL_IBIDATA_MASK                    (0xFF00U)
#define I3C_CTRL_IBIDATA_SHIFT                   (8U)
#define I3C_CTRL_IBIDATA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_IBIDATA_SHIFT)) & I3C_CTRL_IBIDATA_MASK)
#define I3C_CTRL_PENDINT_MASK                    (0xF0000U)
#define I3C_CTRL_PENDINT_SHIFT                   (16U)
#define I3C_CTRL_PENDINT(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_PENDINT_SHIFT)) & I3C_CTRL_PENDINT_MASK)
#define I3C_CTRL_ACTSTATE_MASK                   (0x300000U)
#define I3C_CTRL_ACTSTATE_SHIFT                  (20U)
#define I3C_CTRL_ACTSTATE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_ACTSTATE_SHIFT)) & I3C_CTRL_ACTSTATE_MASK)
#define I3C_CTRL_VENDINFO_MASK                   (0xFF000000U)
#define I3C_CTRL_VENDINFO_SHIFT                  (24U)
#define I3C_CTRL_VENDINFO(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_CTRL_VENDINFO_SHIFT)) & I3C_CTRL_VENDINFO_MASK)
/*! @} */

/*! @name INTSET - Interrupt enable */
/*! @{ */
#define I3C_INTSET_START_MASK                    (0x100U)
#define I3C_INTSET_START_SHIFT                   (8U)
#define I3C_INTSET_START(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_START_SHIFT)) & I3C_INTSET_START_MASK)
#define I3C_INTSET_MATCHED_MASK                  (0x200U)
#define I3C_INTSET_MATCHED_SHIFT                 (9U)
#define I3C_INTSET_MATCHED(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_MATCHED_SHIFT)) & I3C_INTSET_MATCHED_MASK)
#define I3C_INTSET_STOP_MASK                     (0x400U)
#define I3C_INTSET_STOP_SHIFT                    (10U)
#define I3C_INTSET_STOP(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_STOP_SHIFT)) & I3C_INTSET_STOP_MASK)
#define I3C_INTSET_RXPEND_MASK                   (0x800U)
#define I3C_INTSET_RXPEND_SHIFT                  (11U)
#define I3C_INTSET_RXPEND(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_RXPEND_SHIFT)) & I3C_INTSET_RXPEND_MASK)
#define I3C_INTSET_TXSEND_MASK                   (0x1000U)
#define I3C_INTSET_TXSEND_SHIFT                  (12U)
#define I3C_INTSET_TXSEND(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_TXSEND_SHIFT)) & I3C_INTSET_TXSEND_MASK)
#define I3C_INTSET_DACHG_MASK                    (0x2000U)
#define I3C_INTSET_DACHG_SHIFT                   (13U)
#define I3C_INTSET_DACHG(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_DACHG_SHIFT)) & I3C_INTSET_DACHG_MASK)
#define I3C_INTSET_CCC_MASK                      (0x4000U)
#define I3C_INTSET_CCC_SHIFT                     (14U)
#define I3C_INTSET_CCC(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_CCC_SHIFT)) & I3C_INTSET_CCC_MASK)
#define I3C_INTSET_ERRWARN_MASK                  (0x8000U)
#define I3C_INTSET_ERRWARN_SHIFT                 (15U)
#define I3C_INTSET_ERRWARN(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_ERRWARN_SHIFT)) & I3C_INTSET_ERRWARN_MASK)
#define I3C_INTSET_DDRMATCHED_MASK               (0x10000U)
#define I3C_INTSET_DDRMATCHED_SHIFT              (16U)
#define I3C_INTSET_DDRMATCHED(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_DDRMATCHED_SHIFT)) & I3C_INTSET_DDRMATCHED_MASK)
#define I3C_INTSET_CHANDLED_MASK                 (0x20000U)
#define I3C_INTSET_CHANDLED_SHIFT                (17U)
#define I3C_INTSET_CHANDLED(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_CHANDLED_SHIFT)) & I3C_INTSET_CHANDLED_MASK)
#define I3C_INTSET_EVENT_MASK                    (0x40000U)
#define I3C_INTSET_EVENT_SHIFT                   (18U)
#define I3C_INTSET_EVENT(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTSET_EVENT_SHIFT)) & I3C_INTSET_EVENT_MASK)
/*! @} */

/*! @name INTCLR - Interrupt disable */
/*! @{ */
#define I3C_INTCLR_START_MASK                    (0x100U)
#define I3C_INTCLR_START_SHIFT                   (8U)
#define I3C_INTCLR_START(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_START_SHIFT)) & I3C_INTCLR_START_MASK)
#define I3C_INTCLR_MATCHED_MASK                  (0x200U)
#define I3C_INTCLR_MATCHED_SHIFT                 (9U)
#define I3C_INTCLR_MATCHED(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_MATCHED_SHIFT)) & I3C_INTCLR_MATCHED_MASK)
#define I3C_INTCLR_STOP_MASK                     (0x400U)
#define I3C_INTCLR_STOP_SHIFT                    (10U)
#define I3C_INTCLR_STOP(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_STOP_SHIFT)) & I3C_INTCLR_STOP_MASK)
#define I3C_INTCLR_RXPEND_MASK                   (0x800U)
#define I3C_INTCLR_RXPEND_SHIFT                  (11U)
#define I3C_INTCLR_RXPEND(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_RXPEND_SHIFT)) & I3C_INTCLR_RXPEND_MASK)
#define I3C_INTCLR_TXSEND_MASK                   (0x1000U)
#define I3C_INTCLR_TXSEND_SHIFT                  (12U)
#define I3C_INTCLR_TXSEND(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_TXSEND_SHIFT)) & I3C_INTCLR_TXSEND_MASK)
#define I3C_INTCLR_DACHG_MASK                    (0x2000U)
#define I3C_INTCLR_DACHG_SHIFT                   (13U)
#define I3C_INTCLR_DACHG(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_DACHG_SHIFT)) & I3C_INTCLR_DACHG_MASK)
#define I3C_INTCLR_CCC_MASK                      (0x4000U)
#define I3C_INTCLR_CCC_SHIFT                     (14U)
#define I3C_INTCLR_CCC(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_CCC_SHIFT)) & I3C_INTCLR_CCC_MASK)
#define I3C_INTCLR_ERRWARN_MASK                  (0x8000U)
#define I3C_INTCLR_ERRWARN_SHIFT                 (15U)
#define I3C_INTCLR_ERRWARN(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_ERRWARN_SHIFT)) & I3C_INTCLR_ERRWARN_MASK)
#define I3C_INTCLR_DDRMATCHED_MASK               (0x10000U)
#define I3C_INTCLR_DDRMATCHED_SHIFT              (16U)
#define I3C_INTCLR_DDRMATCHED(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_DDRMATCHED_SHIFT)) & I3C_INTCLR_DDRMATCHED_MASK)
#define I3C_INTCLR_CHANDLED_MASK                 (0x20000U)
#define I3C_INTCLR_CHANDLED_SHIFT                (17U)
#define I3C_INTCLR_CHANDLED(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_CHANDLED_SHIFT)) & I3C_INTCLR_CHANDLED_MASK)
#define I3C_INTCLR_EVENT_MASK                    (0x40000U)
#define I3C_INTCLR_EVENT_SHIFT                   (18U)
#define I3C_INTCLR_EVENT(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_INTCLR_EVENT_SHIFT)) & I3C_INTCLR_EVENT_MASK)
/*! @} */

