JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name INTMASKED - Mask of sourced interrupts (STATUS and INTSET) */
/*! @{ */
#define I3C_INTMASKED_START_MASK                 (0x100U)
#define I3C_INTMASKED_START_SHIFT                (8U)
#define I3C_INTMASKED_START(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_START_SHIFT)) & I3C_INTMASKED_START_MASK)
#define I3C_INTMASKED_MATCHED_MASK               (0x200U)
#define I3C_INTMASKED_MATCHED_SHIFT              (9U)
#define I3C_INTMASKED_MATCHED(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_MATCHED_SHIFT)) & I3C_INTMASKED_MATCHED_MASK)
#define I3C_INTMASKED_STOP_MASK                  (0x400U)
#define I3C_INTMASKED_STOP_SHIFT                 (10U)
#define I3C_INTMASKED_STOP(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_STOP_SHIFT)) & I3C_INTMASKED_STOP_MASK)
#define I3C_INTMASKED_RXPEND_MASK                (0x800U)
#define I3C_INTMASKED_RXPEND_SHIFT               (11U)
#define I3C_INTMASKED_RXPEND(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_RXPEND_SHIFT)) & I3C_INTMASKED_RXPEND_MASK)
#define I3C_INTMASKED_TXSEND_MASK                (0x1000U)
#define I3C_INTMASKED_TXSEND_SHIFT               (12U)
#define I3C_INTMASKED_TXSEND(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_TXSEND_SHIFT)) & I3C_INTMASKED_TXSEND_MASK)
#define I3C_INTMASKED_DACHG_MASK                 (0x2000U)
#define I3C_INTMASKED_DACHG_SHIFT                (13U)
#define I3C_INTMASKED_DACHG(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_DACHG_SHIFT)) & I3C_INTMASKED_DACHG_MASK)
#define I3C_INTMASKED_CCC_MASK                   (0x4000U)
#define I3C_INTMASKED_CCC_SHIFT                  (14U)
#define I3C_INTMASKED_CCC(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_CCC_SHIFT)) & I3C_INTMASKED_CCC_MASK)
#define I3C_INTMASKED_ERRWARN_MASK               (0x8000U)
#define I3C_INTMASKED_ERRWARN_SHIFT              (15U)
#define I3C_INTMASKED_ERRWARN(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_ERRWARN_SHIFT)) & I3C_INTMASKED_ERRWARN_MASK)
#define I3C_INTMASKED_DDRMATCHED_MASK            (0x10000U)
#define I3C_INTMASKED_DDRMATCHED_SHIFT           (16U)
#define I3C_INTMASKED_DDRMATCHED(x)              (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_DDRMATCHED_SHIFT)) & I3C_INTMASKED_DDRMATCHED_MASK)
#define I3C_INTMASKED_CHANDLED_MASK              (0x20000U)
#define I3C_INTMASKED_CHANDLED_SHIFT             (17U)
#define I3C_INTMASKED_CHANDLED(x)                (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_CHANDLED_SHIFT)) & I3C_INTMASKED_CHANDLED_MASK)
#define I3C_INTMASKED_EVENT_MASK                 (0x40000U)
#define I3C_INTMASKED_EVENT_SHIFT                (18U)
#define I3C_INTMASKED_EVENT(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_INTMASKED_EVENT_SHIFT)) & I3C_INTMASKED_EVENT_MASK)
/*! @} */

/*! @name ERRWARN - Error and Warning state from protocol errors and issues. Related to ERRWARN status and interrupt. */
/*! @{ */
#define I3C_ERRWARN_ORUN_MASK                    (0x1U)
#define I3C_ERRWARN_ORUN_SHIFT                   (0U)
#define I3C_ERRWARN_ORUN(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_ORUN_SHIFT)) & I3C_ERRWARN_ORUN_MASK)
#define I3C_ERRWARN_URUN_MASK                    (0x2U)
#define I3C_ERRWARN_URUN_SHIFT                   (1U)
#define I3C_ERRWARN_URUN(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_URUN_SHIFT)) & I3C_ERRWARN_URUN_MASK)
#define I3C_ERRWARN_URUNNACK_MASK                (0x4U)
#define I3C_ERRWARN_URUNNACK_SHIFT               (2U)
#define I3C_ERRWARN_URUNNACK(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_URUNNACK_SHIFT)) & I3C_ERRWARN_URUNNACK_MASK)
#define I3C_ERRWARN_TERM_MASK                    (0x8U)
#define I3C_ERRWARN_TERM_SHIFT                   (3U)
#define I3C_ERRWARN_TERM(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_TERM_SHIFT)) & I3C_ERRWARN_TERM_MASK)
#define I3C_ERRWARN_INVSTART_MASK                (0x10U)
#define I3C_ERRWARN_INVSTART_SHIFT               (4U)
#define I3C_ERRWARN_INVSTART(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_INVSTART_SHIFT)) & I3C_ERRWARN_INVSTART_MASK)
#define I3C_ERRWARN_SPAR_MASK                    (0x100U)
#define I3C_ERRWARN_SPAR_SHIFT                   (8U)
#define I3C_ERRWARN_SPAR(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_SPAR_SHIFT)) & I3C_ERRWARN_SPAR_MASK)
#define I3C_ERRWARN_HPAR_MASK                    (0x200U)
#define I3C_ERRWARN_HPAR_SHIFT                   (9U)
#define I3C_ERRWARN_HPAR(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_HPAR_SHIFT)) & I3C_ERRWARN_HPAR_MASK)
#define I3C_ERRWARN_HCRC_MASK                    (0x400U)
#define I3C_ERRWARN_HCRC_SHIFT                   (10U)
#define I3C_ERRWARN_HCRC(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_HCRC_SHIFT)) & I3C_ERRWARN_HCRC_MASK)
#define I3C_ERRWARN_S0S1_MASK                    (0x800U)
#define I3C_ERRWARN_S0S1_SHIFT                   (11U)
#define I3C_ERRWARN_S0S1(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_S0S1_SHIFT)) & I3C_ERRWARN_S0S1_MASK)
#define I3C_ERRWARN_OREAD_MASK                   (0x10000U)
#define I3C_ERRWARN_OREAD_SHIFT                  (16U)
#define I3C_ERRWARN_OREAD(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_OREAD_SHIFT)) & I3C_ERRWARN_OREAD_MASK)
#define I3C_ERRWARN_OWRITE_MASK                  (0x20000U)
#define I3C_ERRWARN_OWRITE_SHIFT                 (17U)
#define I3C_ERRWARN_OWRITE(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_ERRWARN_OWRITE_SHIFT)) & I3C_ERRWARN_OWRITE_MASK)
/*! @} */

/*! @name DMACTRL - DMA control register, if DMA is enabled in the block. */
/*! @{ */
#define I3C_DMACTRL_DMAFB_MASK                   (0x3U)
#define I3C_DMACTRL_DMAFB_SHIFT                  (0U)
/*! DMAFB - DMA Read (From-bus) trigger. If enabled with 1 or 2, will request DMA on RX trigger (see
 *    DATACTL). It will request until empty unless DMA setup as trigger. Note: will cancel on
 *    ERRORWARN (since cannot be as planned).
 *  0b00..DMA not used
 *  0b01..DMA enabled for 1 Frame - auto clears on STOP or repeated START (see MATCHSS in CONFIG).
 *  0b10..DMA enabled until turned off.
 */
#define I3C_DMACTRL_DMAFB(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMAFB_SHIFT)) & I3C_DMACTRL_DMAFB_MASK)
#define I3C_DMACTRL_DMATB_MASK                   (0xCU)
#define I3C_DMACTRL_DMATB_SHIFT                  (2U)
/*! DMATB - DMA Write (To-bus) trigger. If enabled with 1 or 2, will start request DMA on TX trigger
 *    (see DATACTL). It will request until full unless DMA setup as trigger. Note: will cancel on
 *    ERRORWARN (since cannot be as planned).
 *  0b00..DMA not used
 *  0b01..DMA enabled for 1 Frame (ended by DMA or Terminated) - then auto-clears on STOP or START (see MATCHSS in CONFIG).
 *  0b10..DMA enabled until turned off. Normally should only be used with Master Message mode.
 */
#define I3C_DMACTRL_DMATB(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMATB_SHIFT)) & I3C_DMACTRL_DMATB_MASK)
#define I3C_DMACTRL_DMAWIDTH_MASK                (0x30U)
#define I3C_DMACTRL_DMAWIDTH_SHIFT               (4U)
/*! DMAWIDTH - Width of DMA operations, if configured to allow half-word data access.
 *  0b00..byte
 *  0b01..byte
 *  0b10..Half word (16b). If supported by HW. This will make sure 2 bytes free/available in FIFO.
 *  0b11..reserved
 */
#define I3C_DMACTRL_DMAWIDTH(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DMACTRL_DMAWIDTH_SHIFT)) & I3C_DMACTRL_DMAWIDTH_MASK)
/*! @} */

/*! @name DATACTRL - Allows control of data buffering and indicates current buffer state.If FIFO enabled, this is also the FIFO control. */
/*! @{ */
#define I3C_DATACTRL_FLUSHTB_MASK                (0x1U)
#define I3C_DATACTRL_FLUSHTB_SHIFT               (0U)
#define I3C_DATACTRL_FLUSHTB(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_FLUSHTB_SHIFT)) & I3C_DATACTRL_FLUSHTB_MASK)
#define I3C_DATACTRL_FLUSHFB_MASK                (0x2U)
#define I3C_DATACTRL_FLUSHFB_SHIFT               (1U)
#define I3C_DATACTRL_FLUSHFB(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_FLUSHFB_SHIFT)) & I3C_DATACTRL_FLUSHFB_MASK)
#define I3C_DATACTRL_UNLOCK_MASK                 (0x4U)
#define I3C_DATACTRL_UNLOCK_SHIFT                (2U)
#define I3C_DATACTRL_UNLOCK(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_UNLOCK_SHIFT)) & I3C_DATACTRL_UNLOCK_MASK)
#define I3C_DATACTRL_TXTRIG_MASK                 (0x30U)
#define I3C_DATACTRL_TXTRIG_SHIFT                (4U)
#define I3C_DATACTRL_TXTRIG(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXTRIG_SHIFT)) & I3C_DATACTRL_TXTRIG_MASK)
#define I3C_DATACTRL_RXTRIG_MASK                 (0xC0U)
#define I3C_DATACTRL_RXTRIG_SHIFT                (6U)
#define I3C_DATACTRL_RXTRIG(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXTRIG_SHIFT)) & I3C_DATACTRL_RXTRIG_MASK)
#define I3C_DATACTRL_TXCOUNT_MASK                (0x1F0000U)
#define I3C_DATACTRL_TXCOUNT_SHIFT               (16U)
#define I3C_DATACTRL_TXCOUNT(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXCOUNT_SHIFT)) & I3C_DATACTRL_TXCOUNT_MASK)
#define I3C_DATACTRL_RXCOUNT_MASK                (0x1F000000U)
#define I3C_DATACTRL_RXCOUNT_SHIFT               (24U)
#define I3C_DATACTRL_RXCOUNT(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXCOUNT_SHIFT)) & I3C_DATACTRL_RXCOUNT_MASK)
#define I3C_DATACTRL_TXFULL_MASK                 (0x40000000U)
#define I3C_DATACTRL_TXFULL_SHIFT                (30U)
#define I3C_DATACTRL_TXFULL(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_TXFULL_SHIFT)) & I3C_DATACTRL_TXFULL_MASK)
#define I3C_DATACTRL_RXEMPTY_MASK                (0x80000000U)
#define I3C_DATACTRL_RXEMPTY_SHIFT               (31U)
#define I3C_DATACTRL_RXEMPTY(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_DATACTRL_RXEMPTY_SHIFT)) & I3C_DATACTRL_RXEMPTY_MASK)
/*! @} */

/*! @name WDATAB - Write a byte of data, including use of a 9th bit to mark as end (last byte) */
/*! @{ */
#define I3C_WDATAB_DATA_MASK                     (0xFFU)
#define I3C_WDATAB_DATA_SHIFT                    (0U)
#define I3C_WDATAB_DATA(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_DATA_SHIFT)) & I3C_WDATAB_DATA_MASK)
#define I3C_WDATAB_END_MASK                      (0x100U)
#define I3C_WDATAB_END_SHIFT                     (8U)
#define I3C_WDATAB_END(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_END_SHIFT)) & I3C_WDATAB_END_MASK)
#define I3C_WDATAB_END_ALSO_MASK                 (0x10000U)
#define I3C_WDATAB_END_ALSO_SHIFT                (16U)
#define I3C_WDATAB_END_ALSO(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_WDATAB_END_ALSO_SHIFT)) & I3C_WDATAB_END_ALSO_MASK)
/*! @} */

/*! @name WDATABE - Write a byte of data, which is end (last byte). */
/*! @{ */
#define I3C_WDATABE_DATA_MASK                    (0xFFU)
#define I3C_WDATABE_DATA_SHIFT                   (0U)
#define I3C_WDATABE_DATA(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_WDATABE_DATA_SHIFT)) & I3C_WDATABE_DATA_MASK)
/*! @} */

