JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name WDATAH - Write a half-word of data, including use of a 16th bit to mark as end (last byte of half-word is end). */
/*! @{ */
#define I3C_WDATAH_DATA0_MASK                    (0xFFU)
#define I3C_WDATAH_DATA0_SHIFT                   (0U)
#define I3C_WDATAH_DATA0(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_DATA0_SHIFT)) & I3C_WDATAH_DATA0_MASK)
#define I3C_WDATAH_DATA1_MASK                    (0xFF00U)
#define I3C_WDATAH_DATA1_SHIFT                   (8U)
#define I3C_WDATAH_DATA1(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_DATA1_SHIFT)) & I3C_WDATAH_DATA1_MASK)
#define I3C_WDATAH_END_MASK                      (0x10000U)
#define I3C_WDATAH_END_SHIFT                     (16U)
#define I3C_WDATAH_END(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_WDATAH_END_SHIFT)) & I3C_WDATAH_END_MASK)
/*! @} */

/*! @name WDATAHE - Write a half-word of data, which is end (last byte of half-word is end). */
/*! @{ */
#define I3C_WDATAHE_DATA0_MASK                   (0xFFU)
#define I3C_WDATAHE_DATA0_SHIFT                  (0U)
#define I3C_WDATAHE_DATA0(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATAHE_DATA0_SHIFT)) & I3C_WDATAHE_DATA0_MASK)
#define I3C_WDATAHE_DATA1_MASK                   (0xFF00U)
#define I3C_WDATAHE_DATA1_SHIFT                  (8U)
#define I3C_WDATAHE_DATA1(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_WDATAHE_DATA1_SHIFT)) & I3C_WDATAHE_DATA1_MASK)
/*! @} */

/*! @name RDATAB - Read a byte of data */
/*! @{ */
#define I3C_RDATAB_DATA0_MASK                    (0xFFU)
#define I3C_RDATAB_DATA0_SHIFT                   (0U)
#define I3C_RDATAB_DATA0(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_RDATAB_DATA0_SHIFT)) & I3C_RDATAB_DATA0_MASK)
/*! @} */

/*! @name RDATAH - Read a half-word of data */
/*! @{ */
#define I3C_RDATAH_LSB_MASK                      (0xFFU)
#define I3C_RDATAH_LSB_SHIFT                     (0U)
#define I3C_RDATAH_LSB(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_RDATAH_LSB_SHIFT)) & I3C_RDATAH_LSB_MASK)
#define I3C_RDATAH_MSB_MASK                      (0xFF00U)
#define I3C_RDATAH_MSB_SHIFT                     (8U)
#define I3C_RDATAH_MSB(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_RDATAH_MSB_SHIFT)) & I3C_RDATAH_MSB_MASK)
/*! @} */

/*! @name CAPABILITIES - Indicates what is available/supported in this block, including Master and/or Slave, HDR modes, etc. */
/*! @{ */
#define I3C_CAPABILITIES_IDENA_MASK              (0x3U)
#define I3C_CAPABILITIES_IDENA_SHIFT             (0U)
/*! IDENA - Indicates how the ID 48b value is to be handled.
 *  0b00..application
 *  0b01..HW
 *  0b10..HW but instance provided
 *  0b11..PARTNO register used
 */
#define I3C_CAPABILITIES_IDENA(x)                (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IDENA_SHIFT)) & I3C_CAPABILITIES_IDENA_MASK)
#define I3C_CAPABILITIES_IDREG_MASK              (0x3CU)
#define I3C_CAPABILITIES_IDREG_SHIFT             (2U)
/*! IDREG - Bits indicate what is in Regs vs. in HW
 *  0b0000..ID Instance is a register. Only if no PARTNO reg
 *  0b0001..IDRAND field is available
 *  0b0010..DCR register is available
 *  0b0011..BCR register is available
 */
#define I3C_CAPABILITIES_IDREG(x)                (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IDREG_SHIFT)) & I3C_CAPABILITIES_IDREG_MASK)
#define I3C_CAPABILITIES_HDRSUPP_MASK            (0x1C0U)
#define I3C_CAPABILITIES_HDRSUPP_SHIFT           (6U)
/*! HDRSUPP - Indicates which HDR is supported
 *  0b000..DDR
 *  0b001..TSP
 *  0b010..TSL
 */
#define I3C_CAPABILITIES_HDRSUPP(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_HDRSUPP_SHIFT)) & I3C_CAPABILITIES_HDRSUPP_MASK)
#define I3C_CAPABILITIES_MASTER_MASK             (0x200U)
#define I3C_CAPABILITIES_MASTER_SHIFT            (9U)
#define I3C_CAPABILITIES_MASTER(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_MASTER_SHIFT)) & I3C_CAPABILITIES_MASTER_MASK)
#define I3C_CAPABILITIES_SADDR_MASK              (0xC00U)
#define I3C_CAPABILITIES_SADDR_SHIFT             (10U)
/*! SADDR - Indicates how static address is handled:
 *  0b00..no static address
 *  0b01..static address fixed in HW
 *  0b10..HW controls dynamically (e.g. from pin strap)
 *  0b11..CONFIG register supplies the static address
 */
#define I3C_CAPABILITIES_SADDR(x)                (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_SADDR_SHIFT)) & I3C_CAPABILITIES_SADDR_MASK)
#define I3C_CAPABILITIES_CCCHANDLE_MASK          (0xF000U)
#define I3C_CAPABILITIES_CCCHANDLE_SHIFT         (12U)
/*! CCCHANDLE - Indicates who handles CCCs between block and app
 *  0b0000..Block handles events, activities, status, HDR, and if enabled for it, ID and static address related
 *  0b0001..Block handles max read and write length as well as max data speed.
 *  0b0010..GETSTATUS CCC will return the CTRL register's PENDINT and ACTSTATE fields.
 *  0b0011..GETSTATUS CCC will return the CTRL register's VENDINFO (vendor info) bits.
 */
#define I3C_CAPABILITIES_CCCHANDLE(x)            (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_CCCHANDLE_SHIFT)) & I3C_CAPABILITIES_CCCHANDLE_MASK)
#define I3C_CAPABILITIES_IBI_MR_HJ_MASK          (0x1F0000U)
#define I3C_CAPABILITIES_IBI_MR_HJ_SHIFT         (16U)
/*! IBI_MR_HJ - Indicates which events are to be allowed
 *  0b00000..Supports application generating an IBI
 *  0b00001..when Bit 0=1, means IBI has data from register
 *  0b00010..Supports application generating Master request for 2ndary master or Peer to Peer.
 *  0b00011..Supports application generating Hot Join
 *  0b00100..Use BAMATCH register for Bus Available timing.
 */
#define I3C_CAPABILITIES_IBI_MR_HJ(x)            (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_IBI_MR_HJ_SHIFT)) & I3C_CAPABILITIES_IBI_MR_HJ_MASK)
#define I3C_CAPABILITIES_TIMECTRL_MASK           (0x200000U)
#define I3C_CAPABILITIES_TIMECTRL_SHIFT          (21U)
#define I3C_CAPABILITIES_TIMECTRL(x)             (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_TIMECTRL_SHIFT)) & I3C_CAPABILITIES_TIMECTRL_MASK)
#define I3C_CAPABILITIES_EXTFIFO_MASK            (0x3800000U)
#define I3C_CAPABILITIES_EXTFIFO_SHIFT           (23U)
/*! EXTFIFO - Indicates External FIFOs is enabled. If not, check FIFOTX and FIFORX for internal FIFO.
 *  0b000..no external FIFO.
 *  0b001..standard available/free external FIFO
 *  0b010..request track external FIFO
 *  0b011..reserved
 */
#define I3C_CAPABILITIES_EXTFIFO(x)              (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_EXTFIFO_SHIFT)) & I3C_CAPABILITIES_EXTFIFO_MASK)
#define I3C_CAPABILITIES_FIFOTX_MASK             (0xC000000U)
#define I3C_CAPABILITIES_FIFOTX_SHIFT            (26U)
/*! FIFOTX - Indicates if TX (to-bus) is enabled and what size it is
 *  0b00..default 2 byte TX FIFO.
 *  0b01..4 byte TX FIFO
 *  0b10..8 byte TX FIFO
 *  0b11..16 byte TX FIFO
 */
#define I3C_CAPABILITIES_FIFOTX(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_FIFOTX_SHIFT)) & I3C_CAPABILITIES_FIFOTX_MASK)
#define I3C_CAPABILITIES_FIFORX_MASK             (0x30000000U)
#define I3C_CAPABILITIES_FIFORX_SHIFT            (28U)
/*! FIFORX - Indicates if RX (from-bus) is enabled and what size it is
 *  0b00..default 2 (or 3) byte RX FIFO.
 *  0b01..4 byte RX FIFO
 *  0b10..8 byte RX FIFO
 *  0b11..16 byte RX FIFO
 */
#define I3C_CAPABILITIES_FIFORX(x)               (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_FIFORX_SHIFT)) & I3C_CAPABILITIES_FIFORX_MASK)
#define I3C_CAPABILITIES_INT_MASK                (0x40000000U)
#define I3C_CAPABILITIES_INT_SHIFT               (30U)
#define I3C_CAPABILITIES_INT(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_INT_SHIFT)) & I3C_CAPABILITIES_INT_MASK)
#define I3C_CAPABILITIES_DMA_MASK                (0x80000000U)
#define I3C_CAPABILITIES_DMA_SHIFT               (31U)
#define I3C_CAPABILITIES_DMA(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_CAPABILITIES_DMA_SHIFT)) & I3C_CAPABILITIES_DMA_MASK)
/*! @} */

/*! @name DYNADDR - Dynamic address once assigned, else 0. */
/*! @{ */
#define I3C_DYNADDR_DAVALID_MASK                 (0x1U)
#define I3C_DYNADDR_DAVALID_SHIFT                (0U)
#define I3C_DYNADDR_DAVALID(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_DAVALID_SHIFT)) & I3C_DYNADDR_DAVALID_MASK)
#define I3C_DYNADDR_DADDR_MASK                   (0xFEU)
#define I3C_DYNADDR_DADDR_SHIFT                  (1U)
#define I3C_DYNADDR_DADDR(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_DADDR_SHIFT)) & I3C_DYNADDR_DADDR_MASK)
#define I3C_DYNADDR_KEY_MASK                     (0xFFFF0000U)
#define I3C_DYNADDR_KEY_SHIFT                    (16U)
#define I3C_DYNADDR_KEY(x)                       (((uint32_t)(((uint32_t)(x)) << I3C_DYNADDR_KEY_SHIFT)) & I3C_DYNADDR_KEY_MASK)
/*! @} */

/*! @name MAXLIMITS - Indicates the limits set by the Master (or the original requested limits). */
/*! @{ */
#define I3C_MAXLIMITS_MAXRD_MASK                 (0xFFFU)
#define I3C_MAXLIMITS_MAXRD_SHIFT                (0U)
#define I3C_MAXLIMITS_MAXRD(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MAXLIMITS_MAXRD_SHIFT)) & I3C_MAXLIMITS_MAXRD_MASK)
#define I3C_MAXLIMITS_MAXWR_MASK                 (0xFFF0000U)
#define I3C_MAXLIMITS_MAXWR_SHIFT                (16U)
#define I3C_MAXLIMITS_MAXWR(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MAXLIMITS_MAXWR_SHIFT)) & I3C_MAXLIMITS_MAXWR_MASK)
/*! @} */

/*! @name IDPARTNO - Allows application to write the ID part-number if configured to provide by register */
/*! @{ */
#define I3C_IDPARTNO_PARTNO_MASK                 (0xFFFFFFFFU)
#define I3C_IDPARTNO_PARTNO_SHIFT                (0U)
#define I3C_IDPARTNO_PARTNO(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_IDPARTNO_PARTNO_SHIFT)) & I3C_IDPARTNO_PARTNO_MASK)
/*! @} */

/*! @name IDEXT - Allows application to write the ID extension of DCR and/or BCR and/or instance if so configured */
/*! @{ */
#define I3C_IDEXT_INSTANCE_MASK                  (0xFU)
#define I3C_IDEXT_INSTANCE_SHIFT                 (0U)
#define I3C_IDEXT_INSTANCE(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IDEXT_INSTANCE_SHIFT)) & I3C_IDEXT_INSTANCE_MASK)
#define I3C_IDEXT_DCR_MASK                       (0xFF00U)
#define I3C_IDEXT_DCR_SHIFT                      (8U)
#define I3C_IDEXT_DCR(x)                         (((uint32_t)(((uint32_t)(x)) << I3C_IDEXT_DCR_SHIFT)) & I3C_IDEXT_DCR_MASK)
#define I3C_IDEXT_BCR_MASK                       (0xFF0000U)
#define I3C_IDEXT_BCR_SHIFT                      (16U)
#define I3C_IDEXT_BCR(x)                         (((uint32_t)(((uint32_t)(x)) << I3C_IDEXT_BCR_SHIFT)) & I3C_IDEXT_BCR_MASK)
/*! @} */

/*! @name VENDORID - Allows application to write the Vendor ID if so configured. */
/*! @{ */
#define I3C_VENDORID_VID_MASK                    (0x7FFFU)
#define I3C_VENDORID_VID_SHIFT                   (0U)
#define I3C_VENDORID_VID(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_VENDORID_VID_SHIFT)) & I3C_VENDORID_VID_MASK)
/*! @} */

