JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name TCCLOCK - Allows application to set Time control clock and accuracy info dynamically. */
/*! @{ */
#define I3C_TCCLOCK_ACCURACY_MASK                (0xFFU)
#define I3C_TCCLOCK_ACCURACY_SHIFT               (0U)
#define I3C_TCCLOCK_ACCURACY(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_TCCLOCK_ACCURACY_SHIFT)) & I3C_TCCLOCK_ACCURACY_MASK)
#define I3C_TCCLOCK_FREQ_MASK                    (0xFF00U)
#define I3C_TCCLOCK_FREQ_SHIFT                   (8U)
#define I3C_TCCLOCK_FREQ(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_TCCLOCK_FREQ_SHIFT)) & I3C_TCCLOCK_FREQ_MASK)
/*! @} */

/*! @name MCTRL - Master main control. Starts actions on bus */
/*! @{ */
#define I3C_MCTRL_REQUEST_MASK                   (0x7U)
#define I3C_MCTRL_REQUEST_SHIFT                  (0U)
/*! REQUEST - Emits the requested operation when doing in pieces vs. by message. The MSTAT register
 *    should be consulted to be sure appropriate at this time
 *  0b000..Returns to this when done with any request. MSTAT indicates what state the Master is in. See also
 *         AutoIBI This is only written as 0 when setting RDTERM to 1 (to stop a read in progress) or setting IBIRESP
 *         for MSG use.
 *  0b001..Emit START with Address and direction from stopped state or in middle of SDR message. If from stopped
 *         (IDLE), may be prevented by an event such as IBI, MR, HJ, in which case the appropriate interrupt is
 *         signaled, and this can be resubmitted.
 *  0b010..Emit a STOP on bus. Must be in SDR mode. If in DAA mode, this will exit that mode.
 *  0b011..Manual IBI ACK or NACK. When IBIRESP has indicated hold on IBI to allow manual decision, this request
 *         completes. Uses IBIRESP to provide info.
 *  0b100..If not in DAA mode now, will issue START, 7E, ENTDAA, and then will emit 7E/R to process each Slave.
 *         Will stop just before the new DA is to be emitted. The next Process DAA request will use the Addr field as
 *         the new DA to assign. If NACKed on the 7E/R, the interrupt will indicate so and this will emit a STOP.
 *  0b101..reserved
 *  0b110..Emit Exit Pattern from any state, but end DDR (including MSGDDR) if in that mode now. Includes STOP after
 *  0b111..Hold in stopped state, but Auto-emit START,7E when Slave is holding down SDA to get IBI. Actual IBI handling defined by IBIRESP
 */
#define I3C_MCTRL_REQUEST(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_REQUEST_SHIFT)) & I3C_MCTRL_REQUEST_MASK)
#define I3C_MCTRL_TYPE_MASK                      (0x30U)
#define I3C_MCTRL_TYPE_SHIFT                     (4U)
/*! TYPE - Bus type with START
 *  0b00..I3C
 *  0b00..I2C
 *  0b00..Enter DDR (7E and then ENTHDR0) if not already there. Note that 1st byte written to TX FIFO will be command.
 */
#define I3C_MCTRL_TYPE(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_TYPE_SHIFT)) & I3C_MCTRL_TYPE_MASK)
#define I3C_MCTRL_IBIRESP_MASK                   (0xC0U)
#define I3C_MCTRL_IBIRESP_SHIFT                  (6U)
/*! IBIRESP - Response to use if IBI from START and to force use when completing a manual IBI with
 *    IbiAckNack request. Completion of manual means that the Slave DA is known and so the mandatory
 *    byte or not is specified by the application when ACKing. Note this is also used when a message
 *    is emitted by MWMSG_SDR and _DDR.
 *  0b00..ACK. Mandatory byte (or not) is decided by IBIRULES. Note that RDTERM can be set to limit max IBI byte.
 *  0b01..NACK
 *  0b10..ACK with mandatory byte (ignores IBIRULES); this should not be used unless only Slaves with a mandatory byte can cause an IBI.
 *  0b11..Manual: stop and wait for a decision using the IBIAckNack request
 */
#define I3C_MCTRL_IBIRESP(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_IBIRESP_SHIFT)) & I3C_MCTRL_IBIRESP_MASK)
#define I3C_MCTRL_DIR_MASK                       (0x100U)
#define I3C_MCTRL_DIR_SHIFT                      (8U)
#define I3C_MCTRL_DIR(x)                         (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_DIR_SHIFT)) & I3C_MCTRL_DIR_MASK)
#define I3C_MCTRL_ADDR_MASK                      (0xFE00U)
#define I3C_MCTRL_ADDR_SHIFT                     (9U)
#define I3C_MCTRL_ADDR(x)                        (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_ADDR_SHIFT)) & I3C_MCTRL_ADDR_MASK)
#define I3C_MCTRL_RDTERM_MASK                    (0xFF0000U)
#define I3C_MCTRL_RDTERM_SHIFT                   (16U)
#define I3C_MCTRL_RDTERM(x)                      (((uint32_t)(((uint32_t)(x)) << I3C_MCTRL_RDTERM_SHIFT)) & I3C_MCTRL_RDTERM_MASK)
/*! @} */

/*! @name MSTATUS - Status for Master, including interrupt causes. Parallel to Slave STATUS. */
/*! @{ */
#define I3C_MSTATUS_STATE_MASK                   (0x7U)
#define I3C_MSTATUS_STATE_SHIFT                  (0U)
/*! STATE - Indicates working Master state.
 *  0b000..IDLE - bus STOPped
 *  0b001..SLVREQ - bus STOPped but Slave is holding SDA Low. If AutoIBI, will not stay in this state
 *  0b010..MSGSDR - in SDR Message mode from using MWMSG_SDR
 *  0b011..NORMACT - Normal active SDR from using MCTRL and MWDATAn and MRDATAn. Will stay in this state until STOP issued.
 *  0b100..DDR - in DDR Message mode from using MWMSG_DDR or normal method with DDR. Will stay in this state until exited via EXIT.
 *  0b101..DAA - in ENTDAA mode
 *  0b110..IBIACK - waiting on IBI ACK/NACK decision
 *  0b111..IBIRCV - receiving IBI; this is used once IBI/MR/HJ has won the arbitration. It is also used for IBI
 *         mandatory byte (if any) and any bytes that follow.
 */
#define I3C_MSTATUS_STATE(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_STATE_SHIFT)) & I3C_MSTATUS_STATE_MASK)
#define I3C_MSTATUS_BETWEEN_MASK                 (0x10U)
#define I3C_MSTATUS_BETWEEN_SHIFT                (4U)
#define I3C_MSTATUS_BETWEEN(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_BETWEEN_SHIFT)) & I3C_MSTATUS_BETWEEN_MASK)
#define I3C_MSTATUS_NACKED_MASK                  (0x20U)
#define I3C_MSTATUS_NACKED_SHIFT                 (5U)
#define I3C_MSTATUS_NACKED(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_NACKED_SHIFT)) & I3C_MSTATUS_NACKED_MASK)
#define I3C_MSTATUS_IBITYPE_MASK                 (0xC0U)
#define I3C_MSTATUS_IBITYPE_SHIFT                (6U)
/*! IBITYPE - Indicates the event type of the last event that won (whether ACKed or NACKed or pending)
 *  0b00..None (cleared when IBIWON cleared)
 *  0b01..IBI
 *  0b10..MR
 *  0b11..HJ
 */
#define I3C_MSTATUS_IBITYPE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_IBITYPE_SHIFT)) & I3C_MSTATUS_IBITYPE_MASK)
#define I3C_MSTATUS_SLVSTART_MASK                (0x100U)
#define I3C_MSTATUS_SLVSTART_SHIFT               (8U)
#define I3C_MSTATUS_SLVSTART(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_SLVSTART_SHIFT)) & I3C_MSTATUS_SLVSTART_MASK)
#define I3C_MSTATUS_MCTRLDONE_MASK               (0x200U)
#define I3C_MSTATUS_MCTRLDONE_SHIFT              (9U)
#define I3C_MSTATUS_MCTRLDONE(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_MCTRLDONE_SHIFT)) & I3C_MSTATUS_MCTRLDONE_MASK)
#define I3C_MSTATUS_COMPLETE_MASK                (0x400U)
#define I3C_MSTATUS_COMPLETE_SHIFT               (10U)
#define I3C_MSTATUS_COMPLETE(x)                  (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_COMPLETE_SHIFT)) & I3C_MSTATUS_COMPLETE_MASK)
#define I3C_MSTATUS_RXPEND_MASK                  (0x800U)
#define I3C_MSTATUS_RXPEND_SHIFT                 (11U)
#define I3C_MSTATUS_RXPEND(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_RXPEND_SHIFT)) & I3C_MSTATUS_RXPEND_MASK)
#define I3C_MSTATUS_TXNOTFULL_MASK               (0x1000U)
#define I3C_MSTATUS_TXNOTFULL_SHIFT              (12U)
#define I3C_MSTATUS_TXNOTFULL(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_TXNOTFULL_SHIFT)) & I3C_MSTATUS_TXNOTFULL_MASK)
#define I3C_MSTATUS_IBIWON_MASK                  (0x2000U)
#define I3C_MSTATUS_IBIWON_SHIFT                 (13U)
#define I3C_MSTATUS_IBIWON(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_IBIWON_SHIFT)) & I3C_MSTATUS_IBIWON_MASK)
#define I3C_MSTATUS_ERRWARN_MASK                 (0x8000U)
#define I3C_MSTATUS_ERRWARN_SHIFT                (15U)
#define I3C_MSTATUS_ERRWARN(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_ERRWARN_SHIFT)) & I3C_MSTATUS_ERRWARN_MASK)
#define I3C_MSTATUS_NOWMASTER_MASK               (0x80000U)
#define I3C_MSTATUS_NOWMASTER_SHIFT              (19U)
#define I3C_MSTATUS_NOWMASTER(x)                 (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_NOWMASTER_SHIFT)) & I3C_MSTATUS_NOWMASTER_MASK)
#define I3C_MSTATUS_IBIADDR_MASK                 (0xFF000000U)
#define I3C_MSTATUS_IBIADDR_SHIFT                (24U)
#define I3C_MSTATUS_IBIADDR(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_MSTATUS_IBIADDR_SHIFT)) & I3C_MSTATUS_IBIADDR_MASK)
/*! @} */

/*! @name IBIRULES - Rules for IBI use, and registry of Slaves which use IBI byte. */
/*! @{ */
#define I3C_IBIRULES_ADDR0_MASK                  (0x3FU)
#define I3C_IBIRULES_ADDR0_SHIFT                 (0U)
#define I3C_IBIRULES_ADDR0(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_ADDR0_SHIFT)) & I3C_IBIRULES_ADDR0_MASK)
#define I3C_IBIRULES_ADDR1_MASK                  (0xFC0U)
#define I3C_IBIRULES_ADDR1_SHIFT                 (6U)
#define I3C_IBIRULES_ADDR1(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_ADDR1_SHIFT)) & I3C_IBIRULES_ADDR1_MASK)
#define I3C_IBIRULES_ADDR2_MASK                  (0x3F000U)
#define I3C_IBIRULES_ADDR2_SHIFT                 (12U)
#define I3C_IBIRULES_ADDR2(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_ADDR2_SHIFT)) & I3C_IBIRULES_ADDR2_MASK)
#define I3C_IBIRULES_ADDR3_MASK                  (0xFC0000U)
#define I3C_IBIRULES_ADDR3_SHIFT                 (18U)
#define I3C_IBIRULES_ADDR3(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_ADDR3_SHIFT)) & I3C_IBIRULES_ADDR3_MASK)
#define I3C_IBIRULES_ADDR4_MASK                  (0x3F000000U)
#define I3C_IBIRULES_ADDR4_SHIFT                 (24U)
#define I3C_IBIRULES_ADDR4(x)                    (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_ADDR4_SHIFT)) & I3C_IBIRULES_ADDR4_MASK)
#define I3C_IBIRULES_MSB0_MASK                   (0x40000000U)
#define I3C_IBIRULES_MSB0_SHIFT                  (30U)
#define I3C_IBIRULES_MSB0(x)                     (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_MSB0_SHIFT)) & I3C_IBIRULES_MSB0_MASK)
#define I3C_IBIRULES_NOBYTE_MASK                 (0x80000000U)
#define I3C_IBIRULES_NOBYTE_SHIFT                (31U)
#define I3C_IBIRULES_NOBYTE(x)                   (((uint32_t)(((uint32_t)(x)) << I3C_IBIRULES_NOBYTE_SHIFT)) & I3C_IBIRULES_NOBYTE_MASK)
/*! @} */

