JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name CAPTUREN_L - Local Capture Low Register for CPUn */
/*! @{ */
#define OSTIMER_CAPTUREN_L_CAPTUREn_VALUE_MASK   (0xFFFFFFFFU)
#define OSTIMER_CAPTUREN_L_CAPTUREn_VALUE_SHIFT  (0U)
#define OSTIMER_CAPTUREN_L_CAPTUREn_VALUE(x)     (((uint32_t)(((uint32_t)(x)) << OSTIMER_CAPTUREN_L_CAPTUREn_VALUE_SHIFT)) & OSTIMER_CAPTUREN_L_CAPTUREn_VALUE_MASK)
/*! @} */

/*! @name CAPTUREN_H - Local Capture High Register for CPUn */
/*! @{ */
#define OSTIMER_CAPTUREN_H_CAPTUREn_VALUE_MASK   (0xFFFFFFFFU)
#define OSTIMER_CAPTUREN_H_CAPTUREn_VALUE_SHIFT  (0U)
#define OSTIMER_CAPTUREN_H_CAPTUREn_VALUE(x)     (((uint32_t)(((uint32_t)(x)) << OSTIMER_CAPTUREN_H_CAPTUREn_VALUE_SHIFT)) & OSTIMER_CAPTUREN_H_CAPTUREn_VALUE_MASK)
/*! @} */

/*! @name MATCHN_L - Local Match Low Register for CPUn */
/*! @{ */
#define OSTIMER_MATCHN_L_MATCHn_VALUE_MASK       (0xFFFFFFFFU)
#define OSTIMER_MATCHN_L_MATCHn_VALUE_SHIFT      (0U)
#define OSTIMER_MATCHN_L_MATCHn_VALUE(x)         (((uint32_t)(((uint32_t)(x)) << OSTIMER_MATCHN_L_MATCHn_VALUE_SHIFT)) & OSTIMER_MATCHN_L_MATCHn_VALUE_MASK)
/*! @} */

/*! @name MATCHN_H - Match High Register for CPUn */
/*! @{ */
#define OSTIMER_MATCHN_H_MATCHn_VALUE_MASK       (0xFFFFFFFFU)
#define OSTIMER_MATCHN_H_MATCHn_VALUE_SHIFT      (0U)
#define OSTIMER_MATCHN_H_MATCHn_VALUE(x)         (((uint32_t)(((uint32_t)(x)) << OSTIMER_MATCHN_H_MATCHn_VALUE_SHIFT)) & OSTIMER_MATCHN_H_MATCHn_VALUE_MASK)
/*! @} */

/*! @name OSEVENT_CTRL - OS_EVENT TIMER Control Register for CPUn */
/*! @{ */
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTRFLAG_MASK (0x1U)
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTRFLAG_SHIFT (0U)
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTRFLAG(x) (((uint32_t)(((uint32_t)(x)) << OSTIMER_OSEVENT_CTRL_OSTIMER_INTRFLAG_SHIFT)) & OSTIMER_OSEVENT_CTRL_OSTIMER_INTRFLAG_MASK)
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTENA_MASK (0x2U)
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTENA_SHIFT (1U)
#define OSTIMER_OSEVENT_CTRL_OSTIMER_INTENA(x)   (((uint32_t)(((uint32_t)(x)) << OSTIMER_OSEVENT_CTRL_OSTIMER_INTENA_SHIFT)) & OSTIMER_OSEVENT_CTRL_OSTIMER_INTENA_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OSTIMER_Register_Masks */


/* OSTIMER - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral OSTIMER base address */
  #define OSTIMER_BASE                             (0x50113000u)
  /** Peripheral OSTIMER base address */
  #define OSTIMER_BASE_NS                          (0x40113000u)
  /** Peripheral OSTIMER base pointer */
  #define OSTIMER                                  ((OSTIMER_Type *)OSTIMER_BASE)
  /** Peripheral OSTIMER base pointer */
  #define OSTIMER_NS                               ((OSTIMER_Type *)OSTIMER_BASE_NS)
  /** Array initializer of OSTIMER peripheral base addresses */
  #define OSTIMER_BASE_ADDRS                       { OSTIMER_BASE }
  /** Array initializer of OSTIMER peripheral base pointers */
  #define OSTIMER_BASE_PTRS                        { OSTIMER }
  /** Array initializer of OSTIMER peripheral base addresses */
  #define OSTIMER_BASE_ADDRS_NS                    { OSTIMER_BASE_NS }
  /** Array initializer of OSTIMER peripheral base pointers */
  #define OSTIMER_BASE_PTRS_NS                     { OSTIMER_NS }
#else
  /** Peripheral OSTIMER base address */
  #define OSTIMER_BASE                             (0x40113000u)
  /** Peripheral OSTIMER base pointer */
  #define OSTIMER                                  ((OSTIMER_Type *)OSTIMER_BASE)
  /** Array initializer of OSTIMER peripheral base addresses */
  #define OSTIMER_BASE_ADDRS                       { OSTIMER_BASE }
  /** Array initializer of OSTIMER peripheral base pointers */
  #define OSTIMER_BASE_PTRS                        { OSTIMER }
#endif
/** Interrupt vectors for the OSTIMER peripheral type */
#define OSTIMER_IRQS                             { OS_EVENT_IRQn }

/*!
 * @}
 */ /* end of group OSTIMER_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OTFAD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OTFAD_Peripheral_Access_Layer OTFAD Peripheral Access Layer
 * @{
 */

/** OTFAD - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[3072];
  __IO uint32_t CR;                                /**< Control Register, offset: 0xC00 */
  __IO uint32_t SR;                                /**< Status Register, offset: 0xC04 */
  __IO uint32_t CRC;                               /**< Cyclic Redundancy Check Register, offset: 0xC08 */
       uint8_t RESERVED_1[244];
  struct {                                         /* offset: 0xD00, array step: 0x40 */
    __IO uint32_t KEY[4];                            /**< AES Key Word, array offset: 0xD00, array step: index*0x40, index2*0x4 */
    __IO uint32_t CTR[2];                            /**< AES Counter Word, array offset: 0xD10, array step: index*0x40, index2*0x4 */
    __IO uint32_t RGD_W0;                            /**< AES Region Descriptor Word0, array offset: 0xD18, array step: 0x40 */
    __IO uint32_t RGD_W1;                            /**< AES Region Descriptor Word1, array offset: 0xD1C, array step: 0x40 */
         uint8_t RESERVED_0[32];
  } CTX[4];
} OTFAD_Type;

/* ----------------------------------------------------------------------------
   -- OTFAD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OTFAD_Register_Masks OTFAD Register Masks
 * @{
 */

/*! @name CR - Control Register */
/*! @{ */
#define OTFAD_CR_IRQE_MASK                       (0x1U)
#define OTFAD_CR_IRQE_SHIFT                      (0U)
/*! IRQE - IRQE
 *  0b0..SR[KBERR] = 1 does not generate an interrupt request.
 *  0b1..SR[KBERR] = 1 generates an interrupt request.
 */
#define OTFAD_CR_IRQE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_IRQE_SHIFT)) & OTFAD_CR_IRQE_MASK)
#define OTFAD_CR_FERR_MASK                       (0x2U)
#define OTFAD_CR_FERR_SHIFT                      (1U)
/*! FERR - Force Error
 *  0b0..No effect on the SR[KBERE] indicator.
 *  0b1..SR[KBERR] is immediately set after a write with this data bit set.
 */
#define OTFAD_CR_FERR(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_FERR_SHIFT)) & OTFAD_CR_FERR_MASK)
#define OTFAD_CR_FLDM_MASK                       (0x8U)
#define OTFAD_CR_FLDM_SHIFT                      (3U)
/*! FLDM - Force Logically Disabled Mode
 *  0b0..No effect on the operating mode.
 *  0b1..Force entry into LDM after a write with this data bit set. SR[MODE] signals the operating mode.
 */
#define OTFAD_CR_FLDM(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_FLDM_SHIFT)) & OTFAD_CR_FLDM_MASK)
#define OTFAD_CR_KBSE_MASK                       (0x10U)
#define OTFAD_CR_KBSE_SHIFT                      (4U)
/*! KBSE - Key Blob Scramble Enable
 *  0b0..Key blob KEK scrambling is disabled.
 *  0b1..Key blob KEK scrambling is enabled.
 */
#define OTFAD_CR_KBSE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_KBSE_SHIFT)) & OTFAD_CR_KBSE_MASK)
#define OTFAD_CR_KBPE_MASK                       (0x20U)
#define OTFAD_CR_KBPE_SHIFT                      (5U)
/*! KBPE - Key Blob Processing Enable
 *  0b0..Key blob processing is disabled.
 *  0b1..Key blob processing is enabled.
 */
#define OTFAD_CR_KBPE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_KBPE_SHIFT)) & OTFAD_CR_KBPE_MASK)
#define OTFAD_CR_KBCE_MASK                       (0x40U)
#define OTFAD_CR_KBCE_SHIFT                      (6U)
/*! KBCE - Key Blob CRC Enable
 *  0b0..CRC-32 during key blob processing is disabled.
 *  0b1..CRC-32 during key blob processing is enabled.
 */
#define OTFAD_CR_KBCE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_KBCE_SHIFT)) & OTFAD_CR_KBCE_MASK)
#define OTFAD_CR_RRAE_MASK                       (0x80U)
#define OTFAD_CR_RRAE_SHIFT                      (7U)
/*! RRAE - Restricted Register Access Enable
 *  0b0..Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".
 *  0b1..Register access is restricted and only the CR, SR, CRC and optional MDPC registers can be accessed; others are treated as RAZ/WI.
 */
#define OTFAD_CR_RRAE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_RRAE_SHIFT)) & OTFAD_CR_RRAE_MASK)
#define OTFAD_CR_CCTX_MASK                       (0x30000U)
#define OTFAD_CR_CCTX_SHIFT                      (16U)
/*! CCTX - CRC Context
 *  0b00..Enable CTX0 CRC check.
 *  0b01..Enable CTX1 CRC check.
 *  0b10..Enable CTX2 CRC check.
 *  0b11..Enable CTX3 CRC check.
 */
#define OTFAD_CR_CCTX(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CCTX_SHIFT)) & OTFAD_CR_CCTX_MASK)
#define OTFAD_CR_CRCE_MASK                       (0x100000U)
#define OTFAD_CR_CRCE_SHIFT                      (20U)
/*! CRCE - CRC Enable
 *  0b0..CRC-32 is disabled.
 *  0b1..CRC-32 for the context defined by CR[CCTRX] is enabled.
 */
#define OTFAD_CR_CRCE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CRCE_SHIFT)) & OTFAD_CR_CRCE_MASK)
#define OTFAD_CR_CRCI_MASK                       (0x200000U)
#define OTFAD_CR_CRCI_SHIFT                      (21U)
/*! CRCI - CRC Initialization
 *  0b0..CRC data register is unaffected.
 *  0b1..CRC data register is immediately initialized after a write with this data bit set.
 */
#define OTFAD_CR_CRCI(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_CRCI_SHIFT)) & OTFAD_CR_CRCI_MASK)
#define OTFAD_CR_SKBP_MASK                       (0x40000000U)
#define OTFAD_CR_SKBP_SHIFT                      (30U)
/*! SKBP - Start key blob processing
 *  0b0..Key blob processing is not initiated.
 *  0b1..Properly-enabled key blob processing is initiated.
 */
#define OTFAD_CR_SKBP(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_SKBP_SHIFT)) & OTFAD_CR_SKBP_MASK)
#define OTFAD_CR_GE_MASK                         (0x80000000U)
#define OTFAD_CR_GE_SHIFT                        (31U)
/*! GE - Global OTFAD Enable
 *  0b0..OTFAD has decryption disabled, and bypasses all data fetched by the QuadSPI.
 *  0b1..OTFAD has decryption enabled, and processes fetched data as defined by the hardware configuration.
 */
#define OTFAD_CR_GE(x)                           (((uint32_t)(((uint32_t)(x)) << OTFAD_CR_GE_SHIFT)) & OTFAD_CR_GE_MASK)
/*! @} */

/*! @name SR - Status Register */
/*! @{ */
#define OTFAD_SR_KBERR_MASK                      (0x1U)
#define OTFAD_SR_KBERR_SHIFT                     (0U)
/*! KBERR - Key Blob Error
 *  0b0..No key blob error detected.
 *  0b1..One or more key blob errors has been detected.
 */
#define OTFAD_SR_KBERR(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_KBERR_SHIFT)) & OTFAD_SR_KBERR_MASK)
#define OTFAD_SR_MDPCP_MASK                      (0x2U)
#define OTFAD_SR_MDPCP_SHIFT                     (1U)
#define OTFAD_SR_MDPCP(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_MDPCP_SHIFT)) & OTFAD_SR_MDPCP_MASK)
#define OTFAD_SR_MODE_MASK                       (0xCU)
#define OTFAD_SR_MODE_SHIFT                      (2U)
/*! MODE - Operating Mode
 *  0b00..Operating in Normal mode (NRM)
 *  0b01..Unused (reserved)
 *  0b10..Unused (reserved)
 *  0b11..Operating in Logically Disabled Mode (LDM)
 */
#define OTFAD_SR_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_MODE_SHIFT)) & OTFAD_SR_MODE_MASK)
#define OTFAD_SR_NCTX_MASK                       (0xF0U)
#define OTFAD_SR_NCTX_SHIFT                      (4U)
#define OTFAD_SR_NCTX(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_NCTX_SHIFT)) & OTFAD_SR_NCTX_MASK)
#define OTFAD_SR_CTXER_MASK                      (0xF00U)
#define OTFAD_SR_CTXER_SHIFT                     (8U)
/*! CTXER - Context Error
 *  0b0000..No key blob error was detected for context "n".
 *  0b0001..Either a key blob integrity error or a key blob CRC error was detected in context "n".
 */
#define OTFAD_SR_CTXER(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_CTXER_SHIFT)) & OTFAD_SR_CTXER_MASK)
#define OTFAD_SR_CTXIE_MASK                      (0xF0000U)
#define OTFAD_SR_CTXIE_SHIFT                     (16U)
/*! CTXIE - Context Integrity Error
 *  0b0000..No key blob integrity error was detected for context "n".
 *  0b0001..A key blob integrity error was detected in context "n".
 */
#define OTFAD_SR_CTXIE(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_CTXIE_SHIFT)) & OTFAD_SR_CTXIE_MASK)
#define OTFAD_SR_HRL_MASK                        (0xF000000U)
#define OTFAD_SR_HRL_SHIFT                       (24U)
#define OTFAD_SR_HRL(x)                          (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_HRL_SHIFT)) & OTFAD_SR_HRL_MASK)
#define OTFAD_SR_RRAM_MASK                       (0x10000000U)
#define OTFAD_SR_RRAM_SHIFT                      (28U)
/*! RRAM - Restricted Register Access Mode
 *  0b0..Register access is fully enabled. The OTFAD programming model registers can be accessed "normally".
 *  0b1..Register access is restricted and only the CR, SR, CRC and optional MDPC registers can be accessed; others are treated as RAZ/WI.
 */
#define OTFAD_SR_RRAM(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_RRAM_SHIFT)) & OTFAD_SR_RRAM_MASK)
#define OTFAD_SR_GEM_MASK                        (0x20000000U)
#define OTFAD_SR_GEM_SHIFT                       (29U)
/*! GEM - Global Enable Mode
 *  0b0..OTFAD is disabled, and bypasses all data fetched by the QuadSPI.
 *  0b1..OTFAD is enabled, and processes data fetched by the QuadSPI as defined by the hardware configuration.
 */
#define OTFAD_SR_GEM(x)                          (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_GEM_SHIFT)) & OTFAD_SR_GEM_MASK)
#define OTFAD_SR_KBPE_MASK                       (0x40000000U)
#define OTFAD_SR_KBPE_SHIFT                      (30U)
/*! KBPE - Key Blob Processing Enable
 *  0b0..Key blob processing is not enabled.
 *  0b1..Key blob processing is enabled.
 */
#define OTFAD_SR_KBPE(x)                         (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_KBPE_SHIFT)) & OTFAD_SR_KBPE_MASK)
#define OTFAD_SR_KBD_MASK                        (0x80000000U)
#define OTFAD_SR_KBD_SHIFT                       (31U)
/*! KBD - Key Blob Processing Done
 *  0b0..Key blob processing was not enabled, or is not complete.
 *  0b1..Key blob processing was enabled and is complete.
 */
#define OTFAD_SR_KBD(x)                          (((uint32_t)(((uint32_t)(x)) << OTFAD_SR_KBD_SHIFT)) & OTFAD_SR_KBD_MASK)
/*! @} */

/*! @name CRC - Cyclic Redundancy Check Register */
/*! @{ */
#define OTFAD_CRC_CRCD_MASK                      (0xFFFFFFFFU)
#define OTFAD_CRC_CRCD_SHIFT                     (0U)
#define OTFAD_CRC_CRCD(x)                        (((uint32_t)(((uint32_t)(x)) << OTFAD_CRC_CRCD_SHIFT)) & OTFAD_CRC_CRCD_MASK)
/*! @} */

/*! @name CTX_CTXN_KEYM_KEY - AES Key Word */
/*! @{ */
#define OTFAD_CTX_CTXN_KEYM_KEY_KEY_MASK         (0xFFFFFFFFU)
#define OTFAD_CTX_CTXN_KEYM_KEY_KEY_SHIFT        (0U)
#define OTFAD_CTX_CTXN_KEYM_KEY_KEY(x)           (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_CTXN_KEYM_KEY_KEY_SHIFT)) & OTFAD_CTX_CTXN_KEYM_KEY_KEY_MASK)
/*! @} */

/* The count of OTFAD_CTX_CTXN_KEYM_KEY */
#define OTFAD_CTX_CTXN_KEYM_KEY_COUNT            (4U)

/* The count of OTFAD_CTX_CTXN_KEYM_KEY */
#define OTFAD_CTX_CTXN_KEYM_KEY_COUNT2           (4U)

/*! @name CTX_CTXN_CTRM_CTR - AES Counter Word */
/*! @{ */
#define OTFAD_CTX_CTXN_CTRM_CTR_CTR_MASK         (0xFFFFFFFFU)
#define OTFAD_CTX_CTXN_CTRM_CTR_CTR_SHIFT        (0U)
#define OTFAD_CTX_CTXN_CTRM_CTR_CTR(x)           (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_CTXN_CTRM_CTR_CTR_SHIFT)) & OTFAD_CTX_CTXN_CTRM_CTR_CTR_MASK)
/*! @} */

/* The count of OTFAD_CTX_CTXN_CTRM_CTR */
#define OTFAD_CTX_CTXN_CTRM_CTR_COUNT            (4U)

/* The count of OTFAD_CTX_CTXN_CTRM_CTR */
#define OTFAD_CTX_CTXN_CTRM_CTR_COUNT2           (2U)

/*! @name CTX_RGD_W0 - AES Region Descriptor Word0 */
/*! @{ */
#define OTFAD_CTX_RGD_W0_SRTADDR_MASK            (0xFFFFFC00U)
#define OTFAD_CTX_RGD_W0_SRTADDR_SHIFT           (10U)
#define OTFAD_CTX_RGD_W0_SRTADDR(x)              (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_W0_SRTADDR_SHIFT)) & OTFAD_CTX_RGD_W0_SRTADDR_MASK)
/*! @} */

/* The count of OTFAD_CTX_RGD_W0 */
#define OTFAD_CTX_RGD_W0_COUNT                   (4U)

/*! @name CTX_RGD_W1 - AES Region Descriptor Word1 */
/*! @{ */
#define OTFAD_CTX_RGD_W1_VLD_MASK                (0x1U)
#define OTFAD_CTX_RGD_W1_VLD_SHIFT               (0U)
/*! VLD - Valid
 *  0b0..Context is invalid.
 *  0b1..Context is valid.
 */
#define OTFAD_CTX_RGD_W1_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_W1_VLD_SHIFT)) & OTFAD_CTX_RGD_W1_VLD_MASK)
#define OTFAD_CTX_RGD_W1_ADE_MASK                (0x2U)
#define OTFAD_CTX_RGD_W1_ADE_SHIFT               (1U)
/*! ADE - AES Decryption Enable.
 *  0b0..Bypass the fetched data.
 *  0b1..Perform the CTR-AES128 mode decryption on the fetched data.
 */
#define OTFAD_CTX_RGD_W1_ADE(x)                  (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_W1_ADE_SHIFT)) & OTFAD_CTX_RGD_W1_ADE_MASK)
#define OTFAD_CTX_RGD_W1_RO_MASK                 (0x4U)
#define OTFAD_CTX_RGD_W1_RO_SHIFT                (2U)
/*! RO - Read-Only
 *  0b0..The context registers can be accessed normally (as defined by SR[RRAM]).
 *  0b1..The context registers are read-only and accesses may be further restricted based on SR[RRAM].
 */
#define OTFAD_CTX_RGD_W1_RO(x)                   (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_W1_RO_SHIFT)) & OTFAD_CTX_RGD_W1_RO_MASK)
#define OTFAD_CTX_RGD_W1_ENDADDR_MASK            (0xFFFFFC00U)
#define OTFAD_CTX_RGD_W1_ENDADDR_SHIFT           (10U)
#define OTFAD_CTX_RGD_W1_ENDADDR(x)              (((uint32_t)(((uint32_t)(x)) << OTFAD_CTX_RGD_W1_ENDADDR_SHIFT)) & OTFAD_CTX_RGD_W1_ENDADDR_MASK)
/*! @} */

/* The count of OTFAD_CTX_RGD_W1 */
#define OTFAD_CTX_RGD_W1_COUNT                   (4U)


/*!
 * @}
 */ /* end of group OTFAD_Register_Masks */


/* OTFAD - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral OTFAD base address */
  #define OTFAD_BASE                               (0x50134000u)
  /** Peripheral OTFAD base address */
  #define OTFAD_BASE_NS                            (0x40134000u)
  /** Peripheral OTFAD base pointer */
  #define OTFAD                                    ((OTFAD_Type *)OTFAD_BASE)
  /** Peripheral OTFAD base pointer */
  #define OTFAD_NS                                 ((OTFAD_Type *)OTFAD_BASE_NS)
  /** Array initializer of OTFAD peripheral base addresses */
  #define OTFAD_BASE_ADDRS                         { OTFAD_BASE }
  /** Array initializer of OTFAD peripheral base pointers */
  #define OTFAD_BASE_PTRS                          { OTFAD }
  /** Array initializer of OTFAD peripheral base addresses */
  #define OTFAD_BASE_ADDRS_NS                      { OTFAD_BASE_NS }
  /** Array initializer of OTFAD peripheral base pointers */
  #define OTFAD_BASE_PTRS_NS                       { OTFAD_NS }
#else
  /** Peripheral OTFAD base address */
  #define OTFAD_BASE                               (0x40134000u)
  /** Peripheral OTFAD base pointer */
  #define OTFAD                                    ((OTFAD_Type *)OTFAD_BASE)
  /** Array initializer of OTFAD peripheral base addresses */
  #define OTFAD_BASE_ADDRS                         { OTFAD_BASE }
  /** Array initializer of OTFAD peripheral base pointers */
  #define OTFAD_BASE_PTRS                          { OTFAD }
#endif

/*!
 * @}
 */ /* end of group OTFAD_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PINT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PINT_Peripheral_Access_Layer PINT Peripheral Access Layer
 * @{
 */

/** PINT - Register Layout Typedef */
typedef struct {
  __IO uint32_t ISEL;                              /**< Pin Interrupt Mode register, offset: 0x0 */
  __IO uint32_t IENR;                              /**< Pin interrupt level or rising edge interrupt enable register, offset: 0x4 */
  __O  uint32_t SIENR;                             /**< Pin interrupt level or rising edge interrupt set register, offset: 0x8 */
  __O  uint32_t CIENR;                             /**< Pin interrupt level (rising edge interrupt) clear register, offset: 0xC */
  __IO uint32_t IENF;                              /**< Pin interrupt active level or falling edge interrupt enable register, offset: 0x10 */
  __O  uint32_t SIENF;                             /**< Pin interrupt active level or falling edge interrupt set register, offset: 0x14 */
  __O  uint32_t CIENF;                             /**< Pin interrupt active level or falling edge interrupt clear register, offset: 0x18 */
  __IO uint32_t RISE;                              /**< Pin interrupt rising edge register, offset: 0x1C */
  __IO uint32_t FALL;                              /**< Pin interrupt falling edge register, offset: 0x20 */
  __IO uint32_t IST;                               /**< Pin interrupt status register, offset: 0x24 */
  __IO uint32_t PMCTRL;                            /**< Pattern match interrupt control register, offset: 0x28 */
  __IO uint32_t PMSRC;                             /**< Pattern match interrupt bit-slice source register, offset: 0x2C */
  __IO uint32_t PMCFG;                             /**< Pattern match interrupt bit slice configuration register, offset: 0x30 */
} PINT_Type;

/* ----------------------------------------------------------------------------
   -- PINT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PINT_Register_Masks PINT Register Masks
 * @{
 */

