JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name VERID - PMC Version and feature I.D. */
/*! @{ */
#define PMC_VERID_FEATURE_MASK                   (0xFFFFU)
#define PMC_VERID_FEATURE_SHIFT                  (0U)
#define PMC_VERID_FEATURE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_VERID_FEATURE_SHIFT)) & PMC_VERID_FEATURE_MASK)
#define PMC_VERID_MINOR_MASK                     (0xFF0000U)
#define PMC_VERID_MINOR_SHIFT                    (16U)
#define PMC_VERID_MINOR(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_VERID_MINOR_SHIFT)) & PMC_VERID_MINOR_MASK)
#define PMC_VERID_MAJOR_MASK                     (0xFF000000U)
#define PMC_VERID_MAJOR_SHIFT                    (24U)
#define PMC_VERID_MAJOR(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_VERID_MAJOR_SHIFT)) & PMC_VERID_MAJOR_MASK)
/*! @} */

/*! @name STATUS - PMC status */
/*! @{ */
#define PMC_STATUS_ACTIVEFSM_MASK                (0x1U)
#define PMC_STATUS_ACTIVEFSM_SHIFT               (0U)
/*! ACTIVEFSM - General sequencer and finite state machine status
 *  0b0..All PMC finite state machines are idle. OK to set APPLYCFG to trigger the PMC state machines.
 *  0b1..One or more PMC finite state machines are active, do not set APPLYCFG or write to any PDRUNCFG or CTRL
 *       register values that are used by the PMC state machines.
 */
#define PMC_STATUS_ACTIVEFSM(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_ACTIVEFSM_SHIFT)) & PMC_STATUS_ACTIVEFSM_MASK)
#define PMC_STATUS_SRAMFSM_MASK                  (0x2U)
#define PMC_STATUS_SRAMFSM_SHIFT                 (1U)
/*! SRAMFSM - SRAM FSM is active status bit When active no new SRAM power switch changes are allowed
 *    and software should not access the RAMs that are being turned on or off.
 *  0b0..SRAM power switch state machine idle
 *  0b1..SRAM power switch state machine active
 */
#define PMC_STATUS_SRAMFSM(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_SRAMFSM_SHIFT)) & PMC_STATUS_SRAMFSM_MASK)
#define PMC_STATUS_COREVLFSM_MASK                (0x4U)
#define PMC_STATUS_COREVLFSM_SHIFT               (2U)
/*! COREVLFSM
 *  0b0..Core regulator voltage level state machine idle, vddcore stable
 *  0b1..Core regulator voltage level in transition
 */
#define PMC_STATUS_COREVLFSM(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_COREVLFSM_SHIFT)) & PMC_STATUS_COREVLFSM_MASK)
#define PMC_STATUS_COREPMFSM_MASK                (0x8U)
#define PMC_STATUS_COREPMFSM_SHIFT               (3U)
/*! COREPMFSM
 *  0b0..Core power mode state machine is idle
 *  0b1..Core power mode state machine is active
 */
#define PMC_STATUS_COREPMFSM(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_COREPMFSM_SHIFT)) & PMC_STATUS_COREPMFSM_MASK)
#define PMC_STATUS_FBBFSM_MASK                   (0x10U)
#define PMC_STATUS_FBBFSM_SHIFT                  (4U)
/*! FBBFSM
 *  0b0..FBB state machine is idle
 *  0b1..FBB state machine is active, well voltages are changing.
 */
#define PMC_STATUS_FBBFSM(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FBBFSM_SHIFT)) & PMC_STATUS_FBBFSM_MASK)
#define PMC_STATUS_RBBFSM_MASK                   (0x20U)
#define PMC_STATUS_RBBFSM_SHIFT                  (5U)
/*! RBBFSM
 *  0b0..RBB state machine is idle
 *  0b1..RBB state machine is active, well voltages are changing.
 */
#define PMC_STATUS_RBBFSM(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_RBBFSM_SHIFT)) & PMC_STATUS_RBBFSM_MASK)
#define PMC_STATUS_LVDCORE_MASK                  (0x100000U)
#define PMC_STATUS_LVDCORE_SHIFT                 (20U)
/*! LVDCORE
 *  0b0..vddcore bigger than LVD trip point
 *  0b1..vddcore smaller than LVD trip point
 */
#define PMC_STATUS_LVDCORE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_LVDCORE_SHIFT)) & PMC_STATUS_LVDCORE_MASK)
#define PMC_STATUS_HVDCORE_MASK                  (0x400000U)
#define PMC_STATUS_HVDCORE_SHIFT                 (22U)
/*! HVDCORE
 *  0b0..vddcore smaller than HVD trip point
 *  0b1..vddcore bigger than HVD trip point
 */
#define PMC_STATUS_HVDCORE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVDCORE_SHIFT)) & PMC_STATUS_HVDCORE_MASK)
#define PMC_STATUS_HVD1V8_MASK                   (0x1000000U)
#define PMC_STATUS_HVD1V8_SHIFT                  (24U)
/*! HVD1V8
 *  0b0..vdd1v8 smaller than HVD trip point
 *  0b1..vdd1v8 bigger than HVD trip point
 */
#define PMC_STATUS_HVD1V8(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVD1V8_SHIFT)) & PMC_STATUS_HVD1V8_MASK)
#define PMC_STATUS_RTCWKUP_MASK                  (0x8000000U)
#define PMC_STATUS_RTCWKUP_SHIFT                 (27U)
/*! RTCWKUP
 *  0b0..RTC wakeup output is inactive
 *  0b1..RTC wakeup output is active
 */
#define PMC_STATUS_RTCWKUP(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_RTCWKUP_SHIFT)) & PMC_STATUS_RTCWKUP_MASK)
#define PMC_STATUS_INTNPAD_MASK                  (0x20000000U)
#define PMC_STATUS_INTNPAD_SHIFT                 (29U)
/*! INTNPAD
 *  0b0..INTN pad = 0
 *  0b1..INTN pad = 1
 */
#define PMC_STATUS_INTNPAD(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_INTNPAD_SHIFT)) & PMC_STATUS_INTNPAD_MASK)
/*! @} */

/*! @name FLAGS - Wakeup, interrupt, and reset flags */
/*! @{ */
#define PMC_FLAGS_PORCOREF_MASK                  (0x10000U)
#define PMC_FLAGS_PORCOREF_SHIFT                 (16U)
/*! PORCOREF
 *  0b0..vddcore POR was not tripped since the last cleared.
 *  0b1..POR triggered by the vddcore POR monitor. Write 1 to clear
 */
#define PMC_FLAGS_PORCOREF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORCOREF_SHIFT)) & PMC_FLAGS_PORCOREF_MASK)
#define PMC_FLAGS_POR1V8F_MASK                   (0x20000U)
#define PMC_FLAGS_POR1V8F_SHIFT                  (17U)
/*! POR1V8F
 *  0b0..No vdd1v8 power on event detected since last cleared.
 *  0b1..vdd1v8 power on detect caused a reset or deep pd wakeup. Write 1 to clear.
 */
#define PMC_FLAGS_POR1V8F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_POR1V8F_SHIFT)) & PMC_FLAGS_POR1V8F_MASK)
#define PMC_FLAGS_PORAO18F_MASK                  (0x40000U)
#define PMC_FLAGS_PORAO18F_SHIFT                 (18U)
/*! PORAO18F
 *  0b0..No vdd_ao18 power on event detected since last cleared.
 *  0b1..vdd_ao18 power on detect caused a reset. Write 1 to clear.
 */
#define PMC_FLAGS_PORAO18F(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_PORAO18F_SHIFT)) & PMC_FLAGS_PORAO18F_MASK)
#define PMC_FLAGS_LVDCOREF_MASK                  (0x100000U)
#define PMC_FLAGS_LVDCOREF_SHIFT                 (20U)
/*! LVDCOREF
 *  0b0..vddcore LVD has not triggered an interrupt or reset since last clear
 *  0b1..vddcore LVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear
 */
#define PMC_FLAGS_LVDCOREF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_LVDCOREF_SHIFT)) & PMC_FLAGS_LVDCOREF_MASK)
#define PMC_FLAGS_HVDCOREF_MASK                  (0x400000U)
#define PMC_FLAGS_HVDCOREF_SHIFT                 (22U)
/*! HVDCOREF
 *  0b0..vddcore HVD has not triggered an interrupt or reset since last clear
 *  0b1..vddcore HVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear
 */
#define PMC_FLAGS_HVDCOREF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVDCOREF_SHIFT)) & PMC_FLAGS_HVDCOREF_MASK)
#define PMC_FLAGS_HVD1V8F_MASK                   (0x1000000U)
#define PMC_FLAGS_HVD1V8F_SHIFT                  (24U)
/*! HVD1V8F
 *  0b0..vdd1v8 HVD has not triggered an interrupt or reset since last clear
 *  0b1..vdd1v8 HVD triggered an interrupt or reset since last time this bit was cleared. Write 1 to clear
 */
#define PMC_FLAGS_HVD1V8F(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_HVD1V8F_SHIFT)) & PMC_FLAGS_HVD1V8F_MASK)
#define PMC_FLAGS_RTCF_MASK                      (0x8000000U)
#define PMC_FLAGS_RTCF_SHIFT                     (27U)
/*! RTCF
 *  0b0..No RTC wakeup detected since last time flag was cleared.
 *  0b1..RTC wakeup caused a deep powerdown wakeup. Write 1 to clear.
 */
#define PMC_FLAGS_RTCF(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_RTCF_SHIFT)) & PMC_FLAGS_RTCF_MASK)
#define PMC_FLAGS_AUTOWKF_MASK                   (0x10000000U)
#define PMC_FLAGS_AUTOWKF_SHIFT                  (28U)
/*! AUTOWKF
 *  0b0..No PMC Auto Wakeup Interrupt detected since last time cleared.
 *  0b1..PMC Auto wakeup caused a deep sleep wakeup and interrupt. Write 1 to clear.
 */
#define PMC_FLAGS_AUTOWKF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_AUTOWKF_SHIFT)) & PMC_FLAGS_AUTOWKF_MASK)
#define PMC_FLAGS_INTNPADF_MASK                  (0x20000000U)
#define PMC_FLAGS_INTNPADF_SHIFT                 (29U)
/*! INTNPADF
 *  0b0..No interrupt detected since flag last cleared.
 *  0b1..Pad interrupt caused a wakeup or interrupt event since the last time this flag was cleared. Write 1 to clear.
 */
#define PMC_FLAGS_INTNPADF(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_INTNPADF_SHIFT)) & PMC_FLAGS_INTNPADF_MASK)
#define PMC_FLAGS_RESETNPADF_MASK                (0x40000000U)
#define PMC_FLAGS_RESETNPADF_SHIFT               (30U)
/*! RESETNPADF
 *  0b0..No reset detected since last time this flag was cleared.
 *  0b1..Reset pad wakeup caused a wakeup or reset event since the last time this bit was cleared. Write 1 to clear.
 */
#define PMC_FLAGS_RESETNPADF(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_RESETNPADF_SHIFT)) & PMC_FLAGS_RESETNPADF_MASK)
#define PMC_FLAGS_DEEPPDF_MASK                   (0x80000000U)
#define PMC_FLAGS_DEEPPDF_SHIFT                  (31U)
/*! DEEPPDF
 *  0b0..No deep powerdown wakeup since last time flag was cleared.
 *  0b1..Deep powerdown was entered since the last time this flag was cleared. Write 1 to clear
 */
#define PMC_FLAGS_DEEPPDF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DEEPPDF_SHIFT)) & PMC_FLAGS_DEEPPDF_MASK)
/*! @} */

/*! @name CTRL - PMC control register */
/*! @{ */
#define PMC_CTRL_APPLYCFG_MASK                   (0x1U)
#define PMC_CTRL_APPLYCFG_SHIFT                  (0U)
/*! APPLYCFG
 *  0b0..Always reads 0. Write 0 has no effect
 *  0b1..Write 1 = initiate update sequencing of PMC state machines
 */
#define PMC_CTRL_APPLYCFG(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_APPLYCFG_SHIFT)) & PMC_CTRL_APPLYCFG_MASK)
#define PMC_CTRL_BUFEN_MASK                      (0x10U)
#define PMC_CTRL_BUFEN_SHIFT                     (4U)
/*! BUFEN
 *  0b0..disabled
 *  0b1..enabled
 */
#define PMC_CTRL_BUFEN(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_BUFEN_SHIFT)) & PMC_CTRL_BUFEN_MASK)
#define PMC_CTRL_BUFFLIP_MASK                    (0x20U)
#define PMC_CTRL_BUFFLIP_SHIFT                   (5U)
/*! BUFFLIP
 *  0b0..normal buffer inputs
 *  0b1..flipped buffer inputs
 */
#define PMC_CTRL_BUFFLIP(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_BUFFLIP_SHIFT)) & PMC_CTRL_BUFFLIP_MASK)
#define PMC_CTRL_BUFSEL_MASK                     (0xC0U)
#define PMC_CTRL_BUFSEL_SHIFT                    (6U)
/*! BUFSEL
 *  0b00..1.3V pmc_core reference
 *  0b01..1.2V pmc_core reference
 *  0b10..PMC ATX ANA 0 <ph active="1'd1">[(only selectable when testmodes are enabled)]</ph>
 *  0b11..PMC ATX ANA 1 <ph active="1'd1">[(only selectable when testmodes are enabled)]</ph>
 */
#define PMC_CTRL_BUFSEL(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_BUFSEL_SHIFT)) & PMC_CTRL_BUFSEL_MASK)
#define PMC_CTRL_LVDCOREIE_MASK                  (0x100000U)
#define PMC_CTRL_LVDCOREIE_SHIFT                 (20U)
/*! LVDCOREIE
 *  0b0..vddcore LVD interrupt disabled
 *  0b1..vddcore LVD causes interrupt and wakeup from deep sleep.
 */
#define PMC_CTRL_LVDCOREIE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LVDCOREIE_SHIFT)) & PMC_CTRL_LVDCOREIE_MASK)
#define PMC_CTRL_LVDCORERE_MASK                  (0x200000U)
#define PMC_CTRL_LVDCORERE_SHIFT                 (21U)
/*! LVDCORERE
 *  0b0..vddcore LVD reset disabled
 *  0b1..vddcore LVD causes reset
 */
#define PMC_CTRL_LVDCORERE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LVDCORERE_SHIFT)) & PMC_CTRL_LVDCORERE_MASK)
#define PMC_CTRL_HVDCOREIE_MASK                  (0x400000U)
#define PMC_CTRL_HVDCOREIE_SHIFT                 (22U)
/*! HVDCOREIE
 *  0b0..vddcore HVD interrupt disabled
 *  0b1..vddcore HVD causes interrupt and wakeup from deep sleep.
 */
#define PMC_CTRL_HVDCOREIE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVDCOREIE_SHIFT)) & PMC_CTRL_HVDCOREIE_MASK)
#define PMC_CTRL_HVDCORERE_MASK                  (0x800000U)
#define PMC_CTRL_HVDCORERE_SHIFT                 (23U)
/*! HVDCORERE
 *  0b0..vddcore HVD reset disabled
 *  0b1..vddcore HVD causes reset
 */
#define PMC_CTRL_HVDCORERE(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVDCORERE_SHIFT)) & PMC_CTRL_HVDCORERE_MASK)
#define PMC_CTRL_HVD1V8IE_MASK                   (0x1000000U)
#define PMC_CTRL_HVD1V8IE_SHIFT                  (24U)
/*! HVD1V8IE
 *  0b0..vdd1v8 HVD interrupt disabled
 *  0b1..vdd1v8 HVD causes interrupt and wakeup from deep sleep or deep power down mode
 */
#define PMC_CTRL_HVD1V8IE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVD1V8IE_SHIFT)) & PMC_CTRL_HVD1V8IE_MASK)
#define PMC_CTRL_HVD1V8RE_MASK                   (0x2000000U)
#define PMC_CTRL_HVD1V8RE_SHIFT                  (25U)
/*! HVD1V8RE
 *  0b0..vdd1v8 HVD reset disabled
 *  0b1..vdd1v8 HVD causes reset
 */
#define PMC_CTRL_HVD1V8RE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVD1V8RE_SHIFT)) & PMC_CTRL_HVD1V8RE_MASK)
#define PMC_CTRL_AUTOWKEN_MASK                   (0x10000000U)
#define PMC_CTRL_AUTOWKEN_SHIFT                  (28U)
/*! AUTOWKEN
 *  0b0..Auto wakeup interrupt and counter disabled
 *  0b1..Auto wakeup interrupt generated when PMC sequencer finishes and AUTOWAKE counter = 0 after entering deep
 *       sleep mode (but not deep powerdown mode). Interrupt will wake up the M33.
 */
#define PMC_CTRL_AUTOWKEN(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_AUTOWKEN_SHIFT)) & PMC_CTRL_AUTOWKEN_MASK)
#define PMC_CTRL_INTRPADEN_MASK                  (0x20000000U)
#define PMC_CTRL_INTRPADEN_SHIFT                 (29U)
/*! INTRPADEN
 *  0b0..Interrupt pad low has no effect
 *  0b1..Interrupt pad low triggers an interrupt and deep sleep wakeup or deep powerdown wakeup event.
 */
#define PMC_CTRL_INTRPADEN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_INTRPADEN_SHIFT)) & PMC_CTRL_INTRPADEN_MASK)
/*! @} */

/*! @name RUNCTRL - PMC controls used during run mode */
/*! @{ */
#define PMC_RUNCTRL_CORELVL_MASK                 (0x3FU)
#define PMC_RUNCTRL_CORELVL_SHIFT                (0U)
#define PMC_RUNCTRL_CORELVL(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_RUNCTRL_CORELVL_SHIFT)) & PMC_RUNCTRL_CORELVL_MASK)
/*! @} */

