JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name SLEEPCTRL - PMC controls used during deep sleep mode */
/*! @{ */
#define PMC_SLEEPCTRL_CORELVL_MASK               (0x3FU)
#define PMC_SLEEPCTRL_CORELVL_SHIFT              (0U)
#define PMC_SLEEPCTRL_CORELVL(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_SLEEPCTRL_CORELVL_SHIFT)) & PMC_SLEEPCTRL_CORELVL_MASK)
/*! @} */

/*! @name LVDCORECTRL - Active vddcore LVD monitor trip adjust */
/*! @{ */
#define PMC_LVDCORECTRL_LVDCORELVL_MASK          (0xFU)
#define PMC_LVDCORECTRL_LVDCORELVL_SHIFT         (0U)
#define PMC_LVDCORECTRL_LVDCORELVL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_LVDCORECTRL_LVDCORELVL_SHIFT)) & PMC_LVDCORECTRL_LVDCORELVL_MASK)
/*! @} */

/*! @name PORCORECTRL - Retain vddcore LVD monitor trip adjust */
/*! @{ */
#define PMC_PORCORECTRL_PORCORELVL_MASK          (0xFU)
#define PMC_PORCORECTRL_PORCORELVL_SHIFT         (0U)
#define PMC_PORCORECTRL_PORCORELVL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PORCORECTRL_PORCORELVL_SHIFT)) & PMC_PORCORECTRL_PORCORELVL_MASK)
/*! @} */

/*! @name BBCTRL - Body Bias Voltage control */
/*! @{ */
#define PMC_BBCTRL_RBBNLEVEL_MASK                (0xFU)
#define PMC_BBCTRL_RBBNLEVEL_SHIFT               (0U)
/*! RBBNLEVEL
 *  0b0000..vddcore+0.5V
 *  0b0001..vddcore+0.6V
 *  0b0010..vddcore+0.7V
 *  0b0011..vddcore+0.8V
 *  0b0100..vddcore+0.9V
 *  0b0101..vddcore+1.0V
 *  0b0110..vddcore+1.1V
 *  0b0111..vddcore+1.2V
 *  0b1000..vddcore+1.3V
 */
#define PMC_BBCTRL_RBBNLEVEL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBBNLEVEL_SHIFT)) & PMC_BBCTRL_RBBNLEVEL_MASK)
#define PMC_BBCTRL_RBBPLEVEL_MASK                (0xF00U)
#define PMC_BBCTRL_RBBPLEVEL_SHIFT               (8U)
/*! RBBPLEVEL
 *  0b0000..-0.5V
 *  0b0001..-0.6V
 *  0b0010..-0.7V
 *  0b0011..-0.8V
 *  0b0100..-0.9V
 *  0b0101..-1.0V
 *  0b0110..-1.1V
 *  0b0111..-1.2V
 *  0b1000..-1.3V
 */
#define PMC_BBCTRL_RBBPLEVEL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBBPLEVEL_SHIFT)) & PMC_BBCTRL_RBBPLEVEL_MASK)
#define PMC_BBCTRL_RBBPDEN_MASK                  (0x8000U)
#define PMC_BBCTRL_RBBPDEN_SHIFT                 (15U)
/*! RBBPDEN
 *  0b0..RBB pulldown disabled
 *  0b1..RBB pulldown enabled
 */
#define PMC_BBCTRL_RBBPDEN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_RBBPDEN_SHIFT)) & PMC_BBCTRL_RBBPDEN_MASK)
#define PMC_BBCTRL_FBBNLEVEL_MASK                (0xF0000U)
#define PMC_BBCTRL_FBBNLEVEL_SHIFT               (16U)
/*! FBBNLEVEL
 *  0b0000..No body bias
 *  0b0001..vddcore - 50mV
 *  0b0011..vddcore - 100mV
 *  0b0010..vddcore - 150mV
 *  0b0110..vddcore - 200mV
 *  0b0111..vddcore - 250mV
 *  0b0101..vddcore - 300mV
 *  0b0100..vddcore - 350mV
 */
#define PMC_BBCTRL_FBBNLEVEL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_FBBNLEVEL_SHIFT)) & PMC_BBCTRL_FBBNLEVEL_MASK)
#define PMC_BBCTRL_FBBPLEVEL_MASK                (0xF000000U)
#define PMC_BBCTRL_FBBPLEVEL_SHIFT               (24U)
/*! FBBPLEVEL
 *  0b0000..No body bias
 *  0b0001..50mV
 *  0b0011..100mV
 *  0b0010..150mV
 *  0b0110..200mV
 *  0b0111..250mV
 *  0b0101..300mV
 *  0b0100..350mV
 */
#define PMC_BBCTRL_FBBPLEVEL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_BBCTRL_FBBPLEVEL_SHIFT)) & PMC_BBCTRL_FBBPLEVEL_MASK)
/*! @} */

/*! @name AUTOWKUP - Automatic wakeup from deepsleep / deep powerdown modes */
/*! @{ */
#define PMC_AUTOWKUP_AUTOWKTIME_MASK             (0xFFFFU)
#define PMC_AUTOWKUP_AUTOWKTIME_SHIFT            (0U)
#define PMC_AUTOWKUP_AUTOWKTIME(x)               (((uint32_t)(((uint32_t)(x)) << PMC_AUTOWKUP_AUTOWKTIME_SHIFT)) & PMC_AUTOWKUP_AUTOWKTIME_MASK)
/*! @} */

/*! @name PMICCFG - PMIC power mode select control configuration to let PMC know when vddcore or vdd1v8 will power off/on */
/*! @{ */
#define PMC_PMICCFG_VDDCOREM0_MASK               (0x1U)
#define PMC_PMICCFG_VDDCOREM0_SHIFT              (0U)
/*! VDDCOREM0 - vddcore state in PMIC mode 0
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDDCOREM0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDDCOREM0_SHIFT)) & PMC_PMICCFG_VDDCOREM0_MASK)
#define PMC_PMICCFG_VDDCOREM1_MASK               (0x2U)
#define PMC_PMICCFG_VDDCOREM1_SHIFT              (1U)
/*! VDDCOREM1 - vddcore state in PMIC mode 1
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDDCOREM1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDDCOREM1_SHIFT)) & PMC_PMICCFG_VDDCOREM1_MASK)
#define PMC_PMICCFG_VDDCOREM2_MASK               (0x4U)
#define PMC_PMICCFG_VDDCOREM2_SHIFT              (2U)
/*! VDDCOREM2 - vddcore state in PMIC mode 2
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDDCOREM2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDDCOREM2_SHIFT)) & PMC_PMICCFG_VDDCOREM2_MASK)
#define PMC_PMICCFG_VDDCOREM3_MASK               (0x8U)
#define PMC_PMICCFG_VDDCOREM3_SHIFT              (3U)
/*! VDDCOREM3 - vddcore state in PMIC mode 3
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDDCOREM3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDDCOREM3_SHIFT)) & PMC_PMICCFG_VDDCOREM3_MASK)
#define PMC_PMICCFG_VDD1V8M0_MASK                (0x10U)
#define PMC_PMICCFG_VDD1V8M0_SHIFT               (4U)
/*! VDD1V8M0 - vdd1v8 state in PMIC mode 0
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDD1V8M0(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDD1V8M0_SHIFT)) & PMC_PMICCFG_VDD1V8M0_MASK)
#define PMC_PMICCFG_VDD1V8M1_MASK                (0x20U)
#define PMC_PMICCFG_VDD1V8M1_SHIFT               (5U)
/*! VDD1V8M1 - vdd1v8 state in PMIC mode 1
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDD1V8M1(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDD1V8M1_SHIFT)) & PMC_PMICCFG_VDD1V8M1_MASK)
#define PMC_PMICCFG_VDD1V8M2_MASK                (0x40U)
#define PMC_PMICCFG_VDD1V8M2_SHIFT               (6U)
/*! VDD1V8M2 - vdd1v8 state in PMIC mode 2
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDD1V8M2(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDD1V8M2_SHIFT)) & PMC_PMICCFG_VDD1V8M2_MASK)
#define PMC_PMICCFG_VDD1V8M3_MASK                (0x80U)
#define PMC_PMICCFG_VDD1V8M3_SHIFT               (7U)
/*! VDD1V8M3 - vdd1v8 state in PMIC mode 3
 *  0b0..off
 *  0b1..powered
 */
#define PMC_PMICCFG_VDD1V8M3(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PMICCFG_VDD1V8M3_SHIFT)) & PMC_PMICCFG_VDD1V8M3_MASK)
/*! @} */

/*! @name PADVRANGE - GPIO vdde range selection control */
/*! @{ */
#define PMC_PADVRANGE_VDDE0RANGE_MASK            (0x3U)
#define PMC_PADVRANGE_VDDE0RANGE_SHIFT           (0U)
/*! VDDE0RANGE
 *  0b00..1.71 - 3.6V. Consumes static current to detect VDDE0 level
 *  0b01..1.71 - 1.98V, vdde detector off
 *  0b10..3.00 - 3.6V, vdde detector off
 *  0b11..Not allowed (hardware should translate to 00)
 */
#define PMC_PADVRANGE_VDDE0RANGE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDE0RANGE_SHIFT)) & PMC_PADVRANGE_VDDE0RANGE_MASK)
#define PMC_PADVRANGE_VDDE1RANGE_MASK            (0xCU)
#define PMC_PADVRANGE_VDDE1RANGE_SHIFT           (2U)
/*! VDDE1RANGE
 *  0b00..1.71 â 3.6V. Consumes static current to detect VDDE0 level
 *  0b01..1.71 â 1.98V, vdde detector off
 *  0b10..3.00 â 3.6V, vdde detector off
 *  0b11..Not allowed (hardware should translate to 00)
 */
#define PMC_PADVRANGE_VDDE1RANGE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDE1RANGE_SHIFT)) & PMC_PADVRANGE_VDDE1RANGE_MASK)
#define PMC_PADVRANGE_VDDE2RANGE_MASK            (0x30U)
#define PMC_PADVRANGE_VDDE2RANGE_SHIFT           (4U)
/*! VDDE2RANGE
 *  0b00..1.71 â 3.6V. Consumes static current to detect VDDE0 level
 *  0b01..1.71 â 1.98V, vdde detector off
 *  0b10..3.00 â 3.6V, vdde detector off
 *  0b11..Not allowed (hardware should translate to 00)
 */
#define PMC_PADVRANGE_VDDE2RANGE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PADVRANGE_VDDE2RANGE_SHIFT)) & PMC_PADVRANGE_VDDE2RANGE_MASK)
/*! @} */

/*! @name MEMSEQCTRL - Memory Sequencer Control Register */
/*! @{ */
#define PMC_MEMSEQCTRL_MEMSEQNUM_MASK            (0x3FU)
#define PMC_MEMSEQCTRL_MEMSEQNUM_SHIFT           (0U)
#define PMC_MEMSEQCTRL_MEMSEQNUM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_MEMSEQCTRL_MEMSEQNUM_SHIFT)) & PMC_MEMSEQCTRL_MEMSEQNUM_MASK)
/*! @} */

