JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name TSENSOR - Temperature Sensor Control */
/*! @{ */
#define PMC_TSENSOR_TSENSM_MASK                  (0xFU)
#define PMC_TSENSOR_TSENSM_SHIFT                 (0U)
#define PMC_TSENSOR_TSENSM(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_TSENSOR_TSENSM_SHIFT)) & PMC_TSENSOR_TSENSM_MASK)
/*! @} */

/*! @name TESTSTATUS - Test Status Registers */
/*! @{ */
#define PMC_TESTSTATUS_COREOKF_MASK              (0x1U)
#define PMC_TESTSTATUS_COREOKF_SHIFT             (0U)
/*! COREOKF - Vddcore regulator ok flag
 *  0b0..Vddcore regulator FSM in transition
 *  0b1..Vddcore regulator FSM done
 */
#define PMC_TESTSTATUS_COREOKF(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTSTATUS_COREOKF_SHIFT)) & PMC_TESTSTATUS_COREOKF_MASK)
#define PMC_TESTSTATUS_FUSESOKF_MASK             (0x2U)
#define PMC_TESTSTATUS_FUSESOKF_SHIFT            (1U)
/*! FUSESOKF - OTP fuse trim data valid flag. This is an OTP bit that is programmed by production
 *    test after the PMC trim values have been programmed into the OTP. If this bit isn't set then the
 *    fuse data was ignored during boot up.
 *  0b0..OTP fuse data has not been programmed and was not used to modify PMC trim registers
 *  0b1..OTP fuse data was programmed in test and was loaded into PMC trim registers.
 */
#define PMC_TESTSTATUS_FUSESOKF(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTSTATUS_FUSESOKF_SHIFT)) & PMC_TESTSTATUS_FUSESOKF_MASK)
/*! @} */

/*! @name TESTACTRL - PMC core analog settings */
/*! @{ */
#define PMC_TESTACTRL_OSC1KHZSEL_MASK            (0x700000U)
#define PMC_TESTACTRL_OSC1KHZSEL_SHIFT           (20U)
#define PMC_TESTACTRL_OSC1KHZSEL(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_OSC1KHZSEL_SHIFT)) & PMC_TESTACTRL_OSC1KHZSEL_MASK)
#define PMC_TESTACTRL_PMCCFG0_MASK               (0x1000000U)
#define PMC_TESTACTRL_PMCCFG0_SHIFT              (24U)
/*! PMCCFG0
 *  0b0..
 *  0b1..
 */
#define PMC_TESTACTRL_PMCCFG0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG0_SHIFT)) & PMC_TESTACTRL_PMCCFG0_MASK)
#define PMC_TESTACTRL_PMCCFG1_MASK               (0x2000000U)
#define PMC_TESTACTRL_PMCCFG1_SHIFT              (25U)
/*! PMCCFG1
 *  0b0..Glitch filter enabled
 *  0b1..Glitch filter disabled
 */
#define PMC_TESTACTRL_PMCCFG1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG1_SHIFT)) & PMC_TESTACTRL_PMCCFG1_MASK)
#define PMC_TESTACTRL_PMCCFG2_MASK               (0x4000000U)
#define PMC_TESTACTRL_PMCCFG2_SHIFT              (26U)
/*! PMCCFG2
 *  0b0..normal bias
 *  0b1..increase bias by 350nA
 */
#define PMC_TESTACTRL_PMCCFG2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG2_SHIFT)) & PMC_TESTACTRL_PMCCFG2_MASK)
#define PMC_TESTACTRL_PMCCFG3_MASK               (0x8000000U)
#define PMC_TESTACTRL_PMCCFG3_SHIFT              (27U)
/*! PMCCFG3
 *  0b0..normal bias
 *  0b1..reduce bias by 150nA
 */
#define PMC_TESTACTRL_PMCCFG3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG3_SHIFT)) & PMC_TESTACTRL_PMCCFG3_MASK)
#define PMC_TESTACTRL_PMCCFG4_MASK               (0x10000000U)
#define PMC_TESTACTRL_PMCCFG4_SHIFT              (28U)
/*! PMCCFG4
 *  0b0..Normal pulldown current
 *  0b1..2X pulldown current
 */
#define PMC_TESTACTRL_PMCCFG4(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG4_SHIFT)) & PMC_TESTACTRL_PMCCFG4_MASK)
#define PMC_TESTACTRL_PMCCFG5_MASK               (0x20000000U)
#define PMC_TESTACTRL_PMCCFG5_SHIFT              (29U)
/*! PMCCFG5
 *  0b0..diode not activated
 *  0b1..diode activated
 */
#define PMC_TESTACTRL_PMCCFG5(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG5_SHIFT)) & PMC_TESTACTRL_PMCCFG5_MASK)
#define PMC_TESTACTRL_PMCCFG6_MASK               (0x40000000U)
#define PMC_TESTACTRL_PMCCFG6_SHIFT              (30U)
/*! PMCCFG6
 *  0b0..diode not activated
 *  0b1..diode activated
 */
#define PMC_TESTACTRL_PMCCFG6(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG6_SHIFT)) & PMC_TESTACTRL_PMCCFG6_MASK)
#define PMC_TESTACTRL_PMCCFG7_MASK               (0x80000000U)
#define PMC_TESTACTRL_PMCCFG7_SHIFT              (31U)
#define PMC_TESTACTRL_PMCCFG7(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTACTRL_PMCCFG7_SHIFT)) & PMC_TESTACTRL_PMCCFG7_MASK)
/*! @} */

/*! @name TESTTRIM0 - Bandgap, vddcore regulator, and 16MHz osc trim */
/*! @{ */
#define PMC_TESTTRIM0_BGTRIM_MASK                (0x1FU)
#define PMC_TESTTRIM0_BGTRIM_SHIFT               (0U)
#define PMC_TESTTRIM0_BGTRIM(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTTRIM0_BGTRIM_SHIFT)) & PMC_TESTTRIM0_BGTRIM_MASK)
#define PMC_TESTTRIM0_COREREGTRIM_MASK           (0x1F00U)
#define PMC_TESTTRIM0_COREREGTRIM_SHIFT          (8U)
#define PMC_TESTTRIM0_COREREGTRIM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_TESTTRIM0_COREREGTRIM_SHIFT)) & PMC_TESTTRIM0_COREREGTRIM_MASK)
#define PMC_TESTTRIM0_OSC16MHZTRIM_MASK          (0x7000000U)
#define PMC_TESTTRIM0_OSC16MHZTRIM_SHIFT         (24U)
#define PMC_TESTTRIM0_OSC16MHZTRIM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_TESTTRIM0_OSC16MHZTRIM_SHIFT)) & PMC_TESTTRIM0_OSC16MHZTRIM_MASK)
/*! @} */

/*! @name TESTTRIM1 - PMC core IREF trim */
/*! @{ */
#define PMC_TESTTRIM1_IREFFPTRIM_MASK            (0x700U)
#define PMC_TESTTRIM1_IREFFPTRIM_SHIFT           (8U)
#define PMC_TESTTRIM1_IREFFPTRIM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTTRIM1_IREFFPTRIM_SHIFT)) & PMC_TESTTRIM1_IREFFPTRIM_MASK)
/*! @} */

/*! @name TESTCORE0 - PMC core test mode controls */
/*! @{ */
#define PMC_TESTCORE0_BGOFF_MASK                 (0x1U)
#define PMC_TESTCORE0_BGOFF_SHIFT                (0U)
/*! BGOFF
 *  0b0..enable controlled by FSMs
 *  0b1..disabled
 */
#define PMC_TESTCORE0_BGOFF(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_BGOFF_SHIFT)) & PMC_TESTCORE0_BGOFF_MASK)
#define PMC_TESTCORE0_FPMCOREREG_MASK            (0xC000U)
#define PMC_TESTCORE0_FPMCOREREG_SHIFT           (14U)
/*! FPMCOREREG
 *  0b00..enable controlled by FSMs
 *  0b01..enable controlled by FSMs
 *  0b10..force into LP mode
 *  0b11..force into HP mode
 */
#define PMC_TESTCORE0_FPMCOREREG(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FPMCOREREG_SHIFT)) & PMC_TESTCORE0_FPMCOREREG_MASK)
#define PMC_TESTCORE0_FRCCOREPOR_MASK            (0x20000U)
#define PMC_TESTCORE0_FRCCOREPOR_SHIFT           (17U)
/*! FRCCOREPOR
 *  0b0..No effect
 *  0b1..Trigger POR
 */
#define PMC_TESTCORE0_FRCCOREPOR(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FRCCOREPOR_SHIFT)) & PMC_TESTCORE0_FRCCOREPOR_MASK)
#define PMC_TESTCORE0_FPMCOREPOR_MASK            (0xC0000U)
#define PMC_TESTCORE0_FPMCOREPOR_SHIFT           (18U)
/*! FPMCOREPOR
 *  0b00..enable controlled by FSMs
 *  0b01..enable controlled by FSMs
 *  0b10..force into LP mode
 *  0b11..force into HP mode
 */
#define PMC_TESTCORE0_FPMCOREPOR(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FPMCOREPOR_SHIFT)) & PMC_TESTCORE0_FPMCOREPOR_MASK)
#define PMC_TESTCORE0_FPMCORELVD_MASK            (0x300000U)
#define PMC_TESTCORE0_FPMCORELVD_SHIFT           (20U)
/*! FPMCORELVD
 *  0b00..enable controlled by FSMs
 *  0b01..enable controlled by FSMs
 *  0b10..force into LP mode
 *  0b11..force into HP mode
 */
#define PMC_TESTCORE0_FPMCORELVD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FPMCORELVD_SHIFT)) & PMC_TESTCORE0_FPMCORELVD_MASK)
#define PMC_TESTCORE0_FPMCOREHVD_MASK            (0x3000000U)
#define PMC_TESTCORE0_FPMCOREHVD_SHIFT           (24U)
/*! FPMCOREHVD
 *  0b00..enable controlled by FSMs
 *  0b01..enable controlled by FSMs
 *  0b10..HVD monitor is disabled
 *  0b11..HVD monitor is enabled
 */
#define PMC_TESTCORE0_FPMCOREHVD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FPMCOREHVD_SHIFT)) & PMC_TESTCORE0_FPMCOREHVD_MASK)
#define PMC_TESTCORE0_FPM1V8HVD_MASK             (0x30000000U)
#define PMC_TESTCORE0_FPM1V8HVD_SHIFT            (28U)
/*! FPM1V8HVD
 *  0b00..enable controlled by FSMs
 *  0b01..enable controlled by FSMs
 *  0b10..HVD monitor is disabled
 *  0b11..HVD monitor is enabled
 */
#define PMC_TESTCORE0_FPM1V8HVD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FPM1V8HVD_SHIFT)) & PMC_TESTCORE0_FPM1V8HVD_MASK)
#define PMC_TESTCORE0_FRC1V8POR_MASK             (0x40000000U)
#define PMC_TESTCORE0_FRC1V8POR_SHIFT            (30U)
/*! FRC1V8POR
 *  0b0..No effect
 *  0b1..Trigger POR
 */
#define PMC_TESTCORE0_FRC1V8POR(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FRC1V8POR_SHIFT)) & PMC_TESTCORE0_FRC1V8POR_MASK)
#define PMC_TESTCORE0_FRCVAOPOR_MASK             (0x80000000U)
#define PMC_TESTCORE0_FRCVAOPOR_SHIFT            (31U)
/*! FRCVAOPOR
 *  0b0..No effect
 *  0b1..Trigger POR
 */
#define PMC_TESTCORE0_FRCVAOPOR(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE0_FRCVAOPOR_SHIFT)) & PMC_TESTCORE0_FRCVAOPOR_MASK)
/*! @} */

/*! @name TESTCORE1 - PMC core test mode controls and outputs */
/*! @{ */
#define PMC_TESTCORE1_CORETESTM_MASK             (0x3FU)
#define PMC_TESTCORE1_CORETESTM_SHIFT            (0U)
#define PMC_TESTCORE1_CORETESTM(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE1_CORETESTM_SHIFT)) & PMC_TESTCORE1_CORETESTM_MASK)
#define PMC_TESTCORE1_COREOUTSP_MASK             (0x1F00U)
#define PMC_TESTCORE1_COREOUTSP_SHIFT            (8U)
#define PMC_TESTCORE1_COREOUTSP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE1_COREOUTSP_SHIFT)) & PMC_TESTCORE1_COREOUTSP_MASK)
#define PMC_TESTCORE1_INSPARE_MASK               (0x1F0000U)
#define PMC_TESTCORE1_INSPARE_SHIFT              (16U)
#define PMC_TESTCORE1_INSPARE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE1_INSPARE_SHIFT)) & PMC_TESTCORE1_INSPARE_MASK)
#define PMC_TESTCORE1_CORETESTDO_MASK            (0x80000000U)
#define PMC_TESTCORE1_CORETESTDO_SHIFT           (31U)
#define PMC_TESTCORE1_CORETESTDO(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTCORE1_CORETESTDO_SHIFT)) & PMC_TESTCORE1_CORETESTDO_MASK)
/*! @} */

