JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name TESTBIAS0 - Body Bias block trims and configurations */
/*! @{ */
#define PMC_TESTBIAS0_FRBBPD_MASK                (0x3U)
#define PMC_TESTBIAS0_FRBBPD_SHIFT               (0U)
/*! FRBBPD
 *  0b00..RBB pulldown is controlled by FSM
 *  0b01..RBB pulldown is controlled by FSM
 *  0b10..RBB pulldown is disabled
 *  0b11..RBB pulldown is enabled
 */
#define PMC_TESTBIAS0_FRBBPD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS0_FRBBPD_SHIFT)) & PMC_TESTBIAS0_FRBBPD_MASK)
#define PMC_TESTBIAS0_RBBCFG_MASK                (0xFFF0000U)
#define PMC_TESTBIAS0_RBBCFG_SHIFT               (16U)
#define PMC_TESTBIAS0_RBBCFG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS0_RBBCFG_SHIFT)) & PMC_TESTBIAS0_RBBCFG_MASK)
#define PMC_TESTBIAS0_FBBCFG_MASK                (0x30000000U)
#define PMC_TESTBIAS0_FBBCFG_SHIFT               (28U)
#define PMC_TESTBIAS0_FBBCFG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS0_FBBCFG_SHIFT)) & PMC_TESTBIAS0_FBBCFG_MASK)
/*! @} */

/*! @name TESTBIAS1 - Body Bias switch test mode controls, RBB osc config and trim, and external FBB enable */
/*! @{ */
#define PMC_TESTBIAS1_BIASSP_MASK                (0x1U)
#define PMC_TESTBIAS1_BIASSP_SHIFT               (0U)
#define PMC_TESTBIAS1_BIASSP(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BIASSP_SHIFT)) & PMC_TESTBIAS1_BIASSP_MASK)
#define PMC_TESTBIAS1_EXTFBB_MASK                (0x6U)
#define PMC_TESTBIAS1_EXTFBB_SHIFT               (1U)
#define PMC_TESTBIAS1_EXTFBB(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_EXTFBB_SHIFT)) & PMC_TESTBIAS1_EXTFBB_MASK)
#define PMC_TESTBIAS1_RBBSEQ_MASK                (0x18U)
#define PMC_TESTBIAS1_RBBSEQ_SHIFT               (3U)
#define PMC_TESTBIAS1_RBBSEQ(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RBBSEQ_SHIFT)) & PMC_TESTBIAS1_RBBSEQ_MASK)
#define PMC_TESTBIAS1_FREQ_MASK                  (0x700U)
#define PMC_TESTBIAS1_FREQ_SHIFT                 (8U)
#define PMC_TESTBIAS1_FREQ(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_FREQ_SHIFT)) & PMC_TESTBIAS1_FREQ_MASK)
#define PMC_TESTBIAS1_RADPEN_MASK                (0x800U)
#define PMC_TESTBIAS1_RADPEN_SHIFT               (11U)
/*! RADPEN
 *  0b0..Frequency change after each half cycle Minimum frequency determined by rbb_osc_freq_1p8[2:0]
 *  0b1..Adaptive frequency disabled. Frequency determined by rbb_osc_freq_1p8[2:0]
 */
#define PMC_TESTBIAS1_RADPEN(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RADPEN_SHIFT)) & PMC_TESTBIAS1_RADPEN_MASK)
#define PMC_TESTBIAS1_RBBPWDIS_MASK              (0x1000U)
#define PMC_TESTBIAS1_RBBPWDIS_SHIFT             (12U)
/*! RBBPWDIS
 *  0b0..Normal RBB Pwell regulator function
 *  0b1..Disable RBB Pwell regulator when RBB mode is active
 */
#define PMC_TESTBIAS1_RBBPWDIS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RBBPWDIS_SHIFT)) & PMC_TESTBIAS1_RBBPWDIS_MASK)
#define PMC_TESTBIAS1_RBBNWDIS_MASK              (0x2000U)
#define PMC_TESTBIAS1_RBBNWDIS_SHIFT             (13U)
/*! RBBNWDIS
 *  0b0..Normal RBB Nwell regulator function
 *  0b1..Disable RBB Nwell regulator when RBB mode is active
 */
#define PMC_TESTBIAS1_RBBNWDIS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RBBNWDIS_SHIFT)) & PMC_TESTBIAS1_RBBNWDIS_MASK)
#define PMC_TESTBIAS1_FBBPWDIS_MASK              (0x4000U)
#define PMC_TESTBIAS1_FBBPWDIS_SHIFT             (14U)
/*! FBBPWDIS
 *  0b0..Normal FBB Pwell regulator function
 *  0b1..Disable FBB Pwell regulator when FBB mode is active
 */
#define PMC_TESTBIAS1_FBBPWDIS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_FBBPWDIS_SHIFT)) & PMC_TESTBIAS1_FBBPWDIS_MASK)
#define PMC_TESTBIAS1_FBBNWDIS_MASK              (0x8000U)
#define PMC_TESTBIAS1_FBBNWDIS_SHIFT             (15U)
/*! FBBNWDIS
 *  0b0..Normal FBB Nwell regulator function
 *  0b1..Disable FBB Nwell regulator when FBB mode is active
 */
#define PMC_TESTBIAS1_FBBNWDIS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_FBBNWDIS_SHIFT)) & PMC_TESTBIAS1_FBBNWDIS_MASK)
#define PMC_TESTBIAS1_RBPSW_MASK                 (0x10000U)
#define PMC_TESTBIAS1_RBPSW_SHIFT                (16U)
#define PMC_TESTBIAS1_RBPSW(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RBPSW_SHIFT)) & PMC_TESTBIAS1_RBPSW_MASK)
#define PMC_TESTBIAS1_RBNSW_MASK                 (0x20000U)
#define PMC_TESTBIAS1_RBNSW_SHIFT                (17U)
#define PMC_TESTBIAS1_RBNSW(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_RBNSW_SHIFT)) & PMC_TESTBIAS1_RBNSW_MASK)
#define PMC_TESTBIAS1_FBPSW_MASK                 (0x40000U)
#define PMC_TESTBIAS1_FBPSW_SHIFT                (18U)
#define PMC_TESTBIAS1_FBPSW(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_FBPSW_SHIFT)) & PMC_TESTBIAS1_FBPSW_MASK)
#define PMC_TESTBIAS1_FBNSW_MASK                 (0x80000U)
#define PMC_TESTBIAS1_FBNSW_SHIFT                (19U)
#define PMC_TESTBIAS1_FBNSW(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_FBNSW_SHIFT)) & PMC_TESTBIAS1_FBNSW_MASK)
#define PMC_TESTBIAS1_BFFBND_MASK                (0x100000U)
#define PMC_TESTBIAS1_BFFBND_SHIFT               (20U)
#define PMC_TESTBIAS1_BFFBND(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBND_SHIFT)) & PMC_TESTBIAS1_BFFBND_MASK)
#define PMC_TESTBIAS1_BFFBPD_MASK                (0x200000U)
#define PMC_TESTBIAS1_BFFBPD_SHIFT               (21U)
#define PMC_TESTBIAS1_BFFBPD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBPD_SHIFT)) & PMC_TESTBIAS1_BFFBPD_MASK)
#define PMC_TESTBIAS1_BFFBNR_MASK                (0x400000U)
#define PMC_TESTBIAS1_BFFBNR_SHIFT               (22U)
#define PMC_TESTBIAS1_BFFBNR(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBNR_SHIFT)) & PMC_TESTBIAS1_BFFBNR_MASK)
#define PMC_TESTBIAS1_BFFBPR_MASK                (0x800000U)
#define PMC_TESTBIAS1_BFFBPR_SHIFT               (23U)
#define PMC_TESTBIAS1_BFFBPR(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBPR_SHIFT)) & PMC_TESTBIAS1_BFFBPR_MASK)
#define PMC_TESTBIAS1_BFEN_MASK                  (0x1000000U)
#define PMC_TESTBIAS1_BFEN_SHIFT                 (24U)
/*! BFEN
 *  0b0..Body bias block under normal control
 *  0b1..Body bias block control bits are forced by the 8 bits in this register
 */
#define PMC_TESTBIAS1_BFEN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFEN_SHIFT)) & PMC_TESTBIAS1_BFEN_MASK)
#define PMC_TESTBIAS1_BFRBN_MASK                 (0x2000000U)
#define PMC_TESTBIAS1_BFRBN_SHIFT                (25U)
#define PMC_TESTBIAS1_BFRBN(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFRBN_SHIFT)) & PMC_TESTBIAS1_BFRBN_MASK)
#define PMC_TESTBIAS1_BFRBP_MASK                 (0x4000000U)
#define PMC_TESTBIAS1_BFRBP_SHIFT                (26U)
#define PMC_TESTBIAS1_BFRBP(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFRBP_SHIFT)) & PMC_TESTBIAS1_BFRBP_MASK)
#define PMC_TESTBIAS1_BFFBN_MASK                 (0x8000000U)
#define PMC_TESTBIAS1_BFFBN_SHIFT                (27U)
#define PMC_TESTBIAS1_BFFBN(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBN_SHIFT)) & PMC_TESTBIAS1_BFFBN_MASK)
#define PMC_TESTBIAS1_BFFBP_MASK                 (0x10000000U)
#define PMC_TESTBIAS1_BFFBP_SHIFT                (28U)
#define PMC_TESTBIAS1_BFFBP(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_BFFBP_SHIFT)) & PMC_TESTBIAS1_BFFBP_MASK)
#define PMC_TESTBIAS1_SWCTRL_MASK                (0x80000000U)
#define PMC_TESTBIAS1_SWCTRL_SHIFT               (31U)
/*! SWCTRL
 *  0b0..IP internal switching control
 *  0b1..Test Register bits independent control
 */
#define PMC_TESTBIAS1_SWCTRL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS1_SWCTRL_SHIFT)) & PMC_TESTBIAS1_SWCTRL_MASK)
/*! @} */

/*! @name TESTBIAS2 - Body Bias Test Mode control */
/*! @{ */
#define PMC_TESTBIAS2_BIASTESTM_MASK             (0xFFU)
#define PMC_TESTBIAS2_BIASTESTM_SHIFT            (0U)
#define PMC_TESTBIAS2_BIASTESTM(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS2_BIASTESTM_SHIFT)) & PMC_TESTBIAS2_BIASTESTM_MASK)
#define PMC_TESTBIAS2_BUFFERFLIP_MASK            (0x100U)
#define PMC_TESTBIAS2_BUFFERFLIP_SHIFT           (8U)
/*! BUFFERFLIP - Flip the RBB well monitors (p and n) buffers' inputs to eliminate offset errors. Drives bb_tst_md_1p8[8]
 *  0b0..Normal buffer inputs
 *  0b1..Swapped buffer inputs to get opposite offset
 */
#define PMC_TESTBIAS2_BUFFERFLIP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS2_BUFFERFLIP_SHIFT)) & PMC_TESTBIAS2_BUFFERFLIP_MASK)
#define PMC_TESTBIAS2_BIASTSTEN_MASK             (0x4000U)
#define PMC_TESTBIAS2_BIASTSTEN_SHIFT            (14U)
/*! BIASTSTEN - Body Bias Test Enable Connected to bb_tst_en_1p8
 *  0b0..test mode disabled
 *  0b1..test mode enabled
 */
#define PMC_TESTBIAS2_BIASTSTEN(x)               (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS2_BIASTSTEN_SHIFT)) & PMC_TESTBIAS2_BIASTSTEN_MASK)
#define PMC_TESTBIAS2_BIASTESTDO_MASK            (0x8000U)
#define PMC_TESTBIAS2_BIASTESTDO_SHIFT           (15U)
#define PMC_TESTBIAS2_BIASTESTDO(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTBIAS2_BIASTESTDO_SHIFT)) & PMC_TESTBIAS2_BIASTESTDO_MASK)
/*! @} */

/*! @name TESTSEQCFG - Sequencer configuration fuses */
/*! @{ */
#define PMC_TESTSEQCFG_VDECDLY_MASK              (0x3U)
#define PMC_TESTSEQCFG_VDECDLY_SHIFT             (0U)
#define PMC_TESTSEQCFG_VDECDLY(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTSEQCFG_VDECDLY_SHIFT)) & PMC_TESTSEQCFG_VDECDLY_MASK)
#define PMC_TESTSEQCFG_VINCDLY_MASK              (0xCU)
#define PMC_TESTSEQCFG_VINCDLY_SHIFT             (2U)
#define PMC_TESTSEQCFG_VINCDLY(x)                (((uint32_t)(((uint32_t)(x)) << PMC_TESTSEQCFG_VINCDLY_SHIFT)) & PMC_TESTSEQCFG_VINCDLY_MASK)
#define PMC_TESTSEQCFG_SRAMSMDLY_MASK            (0x300U)
#define PMC_TESTSEQCFG_SRAMSMDLY_SHIFT           (8U)
#define PMC_TESTSEQCFG_SRAMSMDLY(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTSEQCFG_SRAMSMDLY_SHIFT)) & PMC_TESTSEQCFG_SRAMSMDLY_MASK)
#define PMC_TESTSEQCFG_SRAMLGDLY_MASK            (0xC00U)
#define PMC_TESTSEQCFG_SRAMLGDLY_SHIFT           (10U)
#define PMC_TESTSEQCFG_SRAMLGDLY(x)              (((uint32_t)(((uint32_t)(x)) << PMC_TESTSEQCFG_SRAMLGDLY_SHIFT)) & PMC_TESTSEQCFG_SRAMLGDLY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PMC_Register_Masks */


/* PMC - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral PMC base address */
  #define PMC_BASE                                 (0x50135000u)
  /** Peripheral PMC base address */
  #define PMC_BASE_NS                              (0x40135000u)
  /** Peripheral PMC base pointer */
  #define PMC                                      ((PMC_Type *)PMC_BASE)
  /** Peripheral PMC base pointer */
  #define PMC_NS                                   ((PMC_Type *)PMC_BASE_NS)
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS                           { PMC_BASE }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS                            { PMC }
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS_NS                        { PMC_BASE_NS }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS_NS                         { PMC_NS }
#else
  /** Peripheral PMC base address */
  #define PMC_BASE                                 (0x40135000u)
  /** Peripheral PMC base pointer */
  #define PMC                                      ((PMC_Type *)PMC_BASE)
  /** Array initializer of PMC peripheral base addresses */
  #define PMC_BASE_ADDRS                           { PMC_BASE }
  /** Array initializer of PMC peripheral base pointers */
  #define PMC_BASE_PTRS                            { PMC }
#endif
/** Interrupt vectors for the PMC peripheral type */
#define PMC_IRQS                                 { PMC_IRQn }

/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- POWERQUAD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup POWERQUAD_Peripheral_Access_Layer POWERQUAD Peripheral Access Layer
 * @{
 */

/** POWERQUAD - Register Layout Typedef */
typedef struct {
  __IO uint32_t OUTBASE;                           /**< Base address register for output region, offset: 0x0 */
  __IO uint32_t OUTFORMAT;                         /**< Output format, offset: 0x4 */
  __IO uint32_t TMPBASE;                           /**< Base address register for temp region, offset: 0x8 */
  __IO uint32_t TMPFORMAT;                         /**< Temp format, offset: 0xC */
  __IO uint32_t INABASE;                           /**< Base address register for input A region, offset: 0x10 */
  __IO uint32_t INAFORMAT;                         /**< Input A format, offset: 0x14 */
  __IO uint32_t INBBASE;                           /**< Base address register for input B region, offset: 0x18 */
  __IO uint32_t INBFORMAT;                         /**< Input B format, offset: 0x1C */
       uint8_t RESERVED_0[224];
  __IO uint32_t CONTROL;                           /**< PowerQuad Control register, offset: 0x100 */
  __IO uint32_t LENGTH;                            /**< Length register, offset: 0x104 */
  __IO uint32_t CPPRE;                             /**< Pre-scale register, offset: 0x108 */
  __IO uint32_t MISC;                              /**< Misc register, offset: 0x10C */
  __IO uint32_t CURSORY;                           /**< Cursory register, offset: 0x110 */
       uint8_t RESERVED_1[108];
  __IO uint32_t CORDIC_X;                          /**< Cordic input X register, offset: 0x180 */
  __IO uint32_t CORDIC_Y;                          /**< Cordic input Y register, offset: 0x184 */
  __IO uint32_t CORDIC_Z;                          /**< Cordic input Z register, offset: 0x188 */
  __IO uint32_t ERRSTAT;                           /**< Read/Write register where error statuses are captured (sticky), offset: 0x18C */
  __IO uint32_t INTREN;                            /**< INTERRUPT enable register, offset: 0x190 */
  __IO uint32_t EVENTEN;                           /**< Event Enable register, offset: 0x194 */
  __IO uint32_t INTRSTAT;                          /**< INTERRUPT STATUS register, offset: 0x198 */
       uint8_t RESERVED_2[100];
  __IO uint32_t GPREG[16];                         /**< General purpose register bank N., array offset: 0x200, array step: 0x4 */
  __IO uint32_t COMPREG[8];                        /**< Compute register bank, array offset: 0x240, array step: 0x4 */
} POWERQUAD_Type;

/* ----------------------------------------------------------------------------
   -- POWERQUAD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup POWERQUAD_Register_Masks POWERQUAD Register Masks
 * @{
 */

/*! @name OUTBASE - Base address register for output region */
/*! @{ */
#define POWERQUAD_OUTBASE_OUTBASE_MASK           (0xFFFFFFFFU)
#define POWERQUAD_OUTBASE_OUTBASE_SHIFT          (0U)
#define POWERQUAD_OUTBASE_OUTBASE(x)             (((uint32_t)(((uint32_t)(x)) << POWERQUAD_OUTBASE_OUTBASE_SHIFT)) & POWERQUAD_OUTBASE_OUTBASE_MASK)
/*! @} */

