JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name SFA1AD - Serial Flash A1 Top Address */
/*! @{ */
#define QuadSPI_SFA1AD_TPADA1_MASK               (0xFFFFFC00U)
#define QuadSPI_SFA1AD_TPADA1_SHIFT              (10U)
#define QuadSPI_SFA1AD_TPADA1(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA1AD_TPADA1_SHIFT)) & QuadSPI_SFA1AD_TPADA1_MASK)
/*! @} */

/*! @name SFA2AD - Serial Flash A2 Top Address */
/*! @{ */
#define QuadSPI_SFA2AD_TPADA2_MASK               (0xFFFFFC00U)
#define QuadSPI_SFA2AD_TPADA2_SHIFT              (10U)
#define QuadSPI_SFA2AD_TPADA2(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA2AD_TPADA2_SHIFT)) & QuadSPI_SFA2AD_TPADA2_MASK)
/*! @} */

/*! @name SFB1AD - Serial Flash B1Top Address */
/*! @{ */
#define QuadSPI_SFB1AD_TPADB1_MASK               (0xFFFFFC00U)
#define QuadSPI_SFB1AD_TPADB1_SHIFT              (10U)
#define QuadSPI_SFB1AD_TPADB1(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFB1AD_TPADB1_SHIFT)) & QuadSPI_SFB1AD_TPADB1_MASK)
/*! @} */

/*! @name SFB2AD - Serial Flash B2Top Address */
/*! @{ */
#define QuadSPI_SFB2AD_TPADB2_MASK               (0xFFFFFC00U)
#define QuadSPI_SFB2AD_TPADB2_SHIFT              (10U)
#define QuadSPI_SFB2AD_TPADB2(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFB2AD_TPADB2_SHIFT)) & QuadSPI_SFB2AD_TPADB2_MASK)
/*! @} */

/*! @name DLPR - Data Learn Pattern Register */
/*! @{ */
#define QuadSPI_DLPR_DLPV_MASK                   (0xFFFFFFFFU)
#define QuadSPI_DLPR_DLPV_SHIFT                  (0U)
#define QuadSPI_DLPR_DLPV(x)                     (((uint32_t)(((uint32_t)(x)) << QuadSPI_DLPR_DLPV_SHIFT)) & QuadSPI_DLPR_DLPV_MASK)
/*! @} */

/*! @name RBDR - RX Buffer Data Register N */
/*! @{ */
#define QuadSPI_RBDR_RXDATA_MASK                 (0xFFFFFFFFU)
#define QuadSPI_RBDR_RXDATA_SHIFT                (0U)
#define QuadSPI_RBDR_RXDATA(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBDR_RXDATA_SHIFT)) & QuadSPI_RBDR_RXDATA_MASK)
/*! @} */

/* The count of QuadSPI_RBDR */
#define QuadSPI_RBDR_COUNT                       (32U)

/*! @name LUTKEY - LUT Key Register */
/*! @{ */
#define QuadSPI_LUTKEY_KEY_MASK                  (0xFFFFFFFFU)
#define QuadSPI_LUTKEY_KEY_SHIFT                 (0U)
#define QuadSPI_LUTKEY_KEY(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUTKEY_KEY_SHIFT)) & QuadSPI_LUTKEY_KEY_MASK)
/*! @} */

/*! @name LCKCR - LUT Lock Configuration Register */
/*! @{ */
#define QuadSPI_LCKCR_LOCK_MASK                  (0x1U)
#define QuadSPI_LCKCR_LOCK_SHIFT                 (0U)
#define QuadSPI_LCKCR_LOCK(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_LOCK_SHIFT)) & QuadSPI_LCKCR_LOCK_MASK)
#define QuadSPI_LCKCR_UNLOCK_MASK                (0x2U)
#define QuadSPI_LCKCR_UNLOCK_SHIFT               (1U)
#define QuadSPI_LCKCR_UNLOCK(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_UNLOCK_SHIFT)) & QuadSPI_LCKCR_UNLOCK_MASK)
/*! @} */

/*! @name LUT - Look-up Table register N */
/*! @{ */
#define QuadSPI_LUT_OPRND0_MASK                  (0xFFU)
#define QuadSPI_LUT_OPRND0_SHIFT                 (0U)
#define QuadSPI_LUT_OPRND0(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND0_SHIFT)) & QuadSPI_LUT_OPRND0_MASK)
#define QuadSPI_LUT_PAD0_MASK                    (0x300U)
#define QuadSPI_LUT_PAD0_SHIFT                   (8U)
/*! PAD0 - Pad information for INSTR0.
 *  0b00..
 *  0b00..1 Pad
 *  0b01..2 Pads
 *  0b10..4 Pads
 *  0b11..8 Pads
 */
#define QuadSPI_LUT_PAD0(x)                      (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD0_SHIFT)) & QuadSPI_LUT_PAD0_MASK)
#define QuadSPI_LUT_INSTR0_MASK                  (0xFC00U)
#define QuadSPI_LUT_INSTR0_SHIFT                 (10U)
#define QuadSPI_LUT_INSTR0(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR0_SHIFT)) & QuadSPI_LUT_INSTR0_MASK)
#define QuadSPI_LUT_OPRND1_MASK                  (0xFF0000U)
#define QuadSPI_LUT_OPRND1_SHIFT                 (16U)
#define QuadSPI_LUT_OPRND1(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND1_SHIFT)) & QuadSPI_LUT_OPRND1_MASK)
#define QuadSPI_LUT_PAD1_MASK                    (0x3000000U)
#define QuadSPI_LUT_PAD1_SHIFT                   (24U)
/*! PAD1 - Pad information for INSTR1.
 *  0b00..
 *  0b00..1 Pad
 *  0b01..2 Pads
 *  0b10..4 Pads
 *  0b11..8 Pads
 */
#define QuadSPI_LUT_PAD1(x)                      (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD1_SHIFT)) & QuadSPI_LUT_PAD1_MASK)
#define QuadSPI_LUT_INSTR1_MASK                  (0xFC000000U)
#define QuadSPI_LUT_INSTR1_SHIFT                 (26U)
#define QuadSPI_LUT_INSTR1(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR1_SHIFT)) & QuadSPI_LUT_INSTR1_MASK)
/*! @} */

/* The count of QuadSPI_LUT */
#define QuadSPI_LUT_COUNT                        (64U)


/*!
 * @}
 */ /* end of group QuadSPI_Register_Masks */


/* QuadSPI - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral QUADSPI base address */
  #define QUADSPI_BASE                             (0x50134000u)
  /** Peripheral QUADSPI base address */
  #define QUADSPI_BASE_NS                          (0x40134000u)
  /** Peripheral QUADSPI base pointer */
  #define QUADSPI                                  ((QuadSPI_Type *)QUADSPI_BASE)
  /** Peripheral QUADSPI base pointer */
  #define QUADSPI_NS                               ((QuadSPI_Type *)QUADSPI_BASE_NS)
  /** Array initializer of QuadSPI peripheral base addresses */
  #define QuadSPI_BASE_ADDRS                       { QUADSPI_BASE }
  /** Array initializer of QuadSPI peripheral base pointers */
  #define QuadSPI_BASE_PTRS                        { QUADSPI }
  /** Array initializer of QuadSPI peripheral base addresses */
  #define QuadSPI_BASE_ADDRS_NS                    { QUADSPI_BASE_NS }
  /** Array initializer of QuadSPI peripheral base pointers */
  #define QuadSPI_BASE_PTRS_NS                     { QUADSPI_NS }
#else
  /** Peripheral QUADSPI base address */
  #define QUADSPI_BASE                             (0x40134000u)
  /** Peripheral QUADSPI base pointer */
  #define QUADSPI                                  ((QuadSPI_Type *)QUADSPI_BASE)
  /** Array initializer of QuadSPI peripheral base addresses */
  #define QuadSPI_BASE_ADDRS                       { QUADSPI_BASE }
  /** Array initializer of QuadSPI peripheral base pointers */
  #define QuadSPI_BASE_PTRS                        { QUADSPI }
#endif
/** Interrupt vectors for the QuadSPI peripheral type */
#define QuadSPI_IRQS                             { QSPI_IRQn }

/*!
 * @}
 */ /* end of group QuadSPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RSTCTRL0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTRL0_Peripheral_Access_Layer RSTCTRL0 Peripheral Access Layer
 * @{
 */

/** RSTCTRL0 - Register Layout Typedef */
typedef struct {
  __IO uint32_t SYSRSTSTAT;                        /**< system reset status register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  __IO uint32_t PRSTCTL0;                          /**< peripheral reset control register 0, offset: 0x10 */
  __IO uint32_t PRSTCTL1;                          /**< peripheral reset control register 1, offset: 0x14 */
  __IO uint32_t PRSTCTL2;                          /**< peripheral reset control register 2, offset: 0x18 */
       uint8_t RESERVED_1[36];
  __O  uint32_t PRSTCTL0_SET;                      /**< peripheral reset set register 0, offset: 0x40 */
  __O  uint32_t PRSTCTL1_SET;                      /**< peripheral reset set register 1, offset: 0x44 */
  __O  uint32_t PRSTCTL2_SET;                      /**< peripheral reset set register 2, offset: 0x48 */
       uint8_t RESERVED_2[36];
  __O  uint32_t PRSTCTL0_CLR;                      /**< peripheral reset clear register 0, offset: 0x70 */
  __O  uint32_t PRSTCTL1_CLR;                      /**< peripheral reset clear register 1, offset: 0x74 */
  __O  uint32_t PRSTCTL2_CLR;                      /**< peripheral reset clear register 2, offset: 0x78 */
} RSTCTRL0_Type;

/* ----------------------------------------------------------------------------
   -- RSTCTRL0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTRL0_Register_Masks RSTCTRL0 Register Masks
 * @{
 */

/*! @name SYSRSTSTAT - system reset status register */
/*! @{ */
#define RSTCTRL0_SYSRSTSTAT_VDD_POR_MASK         (0x1U)
#define RSTCTRL0_SYSRSTSTAT_VDD_POR_SHIFT        (0U)
/*! VDD_POR - VDD POR Event Detected:
 *  0b0..No event detected.
 *  0b1..VDD POR event detected. (Writing a '1' to this bit clears this status).
 */
#define RSTCTRL0_SYSRSTSTAT_VDD_POR(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_SYSRSTSTAT_VDD_POR_SHIFT)) & RSTCTRL0_SYSRSTSTAT_VDD_POR_MASK)
#define RSTCTRL0_SYSRSTSTAT_PAD_RESET_MASK       (0x10U)
#define RSTCTRL0_SYSRSTSTAT_PAD_RESET_SHIFT      (4U)
/*! PAD_RESET - PAD RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..RESET Detected. (Write 1 to CLR),
 */
#define RSTCTRL0_SYSRSTSTAT_PAD_RESET(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_SYSRSTSTAT_PAD_RESET_SHIFT)) & RSTCTRL0_SYSRSTSTAT_PAD_RESET_MASK)
#define RSTCTRL0_SYSRSTSTAT_ARM_APD_RESET_MASK   (0x20U)
#define RSTCTRL0_SYSRSTSTAT_ARM_APD_RESET_SHIFT  (5U)
/*! ARM_APD_RESET - ARM RESET Event Detected:
 *  0b0..No event detected.
 *  0b1..ARM reset event detected. (Writing a '1' to this bit clears this status).
 */
#define RSTCTRL0_SYSRSTSTAT_ARM_APD_RESET(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_SYSRSTSTAT_ARM_APD_RESET_SHIFT)) & RSTCTRL0_SYSRSTSTAT_ARM_APD_RESET_MASK)
#define RSTCTRL0_SYSRSTSTAT_WDT0_RESET_MASK      (0x40U)
#define RSTCTRL0_SYSRSTSTAT_WDT0_RESET_SHIFT     (6U)
/*! WDT0_RESET - WDT0 RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..WDT0 reset event detected. (Writing a '1' to this bit clears this status).
 */
#define RSTCTRL0_SYSRSTSTAT_WDT0_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_SYSRSTSTAT_WDT0_RESET_SHIFT)) & RSTCTRL0_SYSRSTSTAT_WDT0_RESET_MASK)
#define RSTCTRL0_SYSRSTSTAT_WDT1_RESET_MASK      (0x80U)
#define RSTCTRL0_SYSRSTSTAT_WDT1_RESET_SHIFT     (7U)
/*! WDT1_RESET - WDT1 RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..WDT1 reset event detected. (Writing a 1 to this bit clears this status).
 */
#define RSTCTRL0_SYSRSTSTAT_WDT1_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_SYSRSTSTAT_WDT1_RESET_SHIFT)) & RSTCTRL0_SYSRSTSTAT_WDT1_RESET_MASK)
/*! @} */

/*! @name PRSTCTL0 - peripheral reset control register 0 */
/*! @{ */
#define RSTCTRL0_PRSTCTL0_HIFI_DSP_MASK          (0x2U)
#define RSTCTRL0_PRSTCTL0_HIFI_DSP_SHIFT         (1U)
/*! HIFI_DSP - HIFI DSP reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_HIFI_DSP(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_HIFI_DSP_SHIFT)) & RSTCTRL0_PRSTCTL0_HIFI_DSP_MASK)
#define RSTCTRL0_PRSTCTL0_POWERQUAD_MASK         (0x100U)
#define RSTCTRL0_PRSTCTL0_POWERQUAD_SHIFT        (8U)
/*! POWERQUAD - powerquad reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_POWERQUAD(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_POWERQUAD_SHIFT)) & RSTCTRL0_PRSTCTL0_POWERQUAD_MASK)
#define RSTCTRL0_PRSTCTL0_CASPER_MASK            (0x200U)
#define RSTCTRL0_PRSTCTL0_CASPER_SHIFT           (9U)
/*! CASPER - CAPSER reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_CASPER(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CASPER_SHIFT)) & RSTCTRL0_PRSTCTL0_CASPER_MASK)
#define RSTCTRL0_PRSTCTL0_HASHCRYPT_MASK         (0x400U)
#define RSTCTRL0_PRSTCTL0_HASHCRYPT_SHIFT        (10U)
/*! HASHCRYPT - HASHCRYPT reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_HASHCRYPT(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_HASHCRYPT_SHIFT)) & RSTCTRL0_PRSTCTL0_HASHCRYPT_MASK)
#define RSTCTRL0_PRSTCTL0_PUF_MASK               (0x800U)
#define RSTCTRL0_PRSTCTL0_PUF_SHIFT              (11U)
/*! PUF - PUF reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_PUF(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_PUF_SHIFT)) & RSTCTRL0_PRSTCTL0_PUF_MASK)
#define RSTCTRL0_PRSTCTL0_RNG_MASK               (0x1000U)
#define RSTCTRL0_PRSTCTL0_RNG_SHIFT              (12U)
/*! RNG - RNG reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_RNG_SHIFT)) & RSTCTRL0_PRSTCTL0_RNG_MASK)
#define RSTCTRL0_PRSTCTL0_OSPI_OTFAD_MASK        (0x10000U)
#define RSTCTRL0_PRSTCTL0_OSPI_OTFAD_SHIFT       (16U)
/*! OSPI_OTFAD - OSPI reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_OSPI_OTFAD(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_OSPI_OTFAD_SHIFT)) & RSTCTRL0_PRSTCTL0_OSPI_OTFAD_MASK)
#define RSTCTRL0_PRSTCTL0_USBHS_PHY_MASK         (0x100000U)
#define RSTCTRL0_PRSTCTL0_USBHS_PHY_SHIFT        (20U)
/*! USBHS_PHY - USB PHY reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_USBHS_PHY(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_USBHS_PHY_SHIFT)) & RSTCTRL0_PRSTCTL0_USBHS_PHY_MASK)
#define RSTCTRL0_PRSTCTL0_USBHS_DEVICE_MASK      (0x200000U)
#define RSTCTRL0_PRSTCTL0_USBHS_DEVICE_SHIFT     (21U)
/*! USBHS_DEVICE - USB DEVICE reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_USBHS_DEVICE(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_USBHS_DEVICE_SHIFT)) & RSTCTRL0_PRSTCTL0_USBHS_DEVICE_MASK)
#define RSTCTRL0_PRSTCTL0_USBHS_HOST_MASK        (0x400000U)
#define RSTCTRL0_PRSTCTL0_USBHS_HOST_SHIFT       (22U)
/*! USBHS_HOST - USB HOST reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_USBHS_HOST(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_USBHS_HOST_SHIFT)) & RSTCTRL0_PRSTCTL0_USBHS_HOST_MASK)
#define RSTCTRL0_PRSTCTL0_USBHS_SRAM_MASK        (0x800000U)
#define RSTCTRL0_PRSTCTL0_USBHS_SRAM_SHIFT       (23U)
/*! USBHS_SRAM - USBHS RAM reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_USBHS_SRAM(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_USBHS_SRAM_SHIFT)) & RSTCTRL0_PRSTCTL0_USBHS_SRAM_MASK)
#define RSTCTRL0_PRSTCTL0_SCT_MASK               (0x1000000U)
#define RSTCTRL0_PRSTCTL0_SCT_SHIFT              (24U)
/*! SCT - SCT reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL0_SCT(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SCT_SHIFT)) & RSTCTRL0_PRSTCTL0_SCT_MASK)
/*! @} */

/*! @name PRSTCTL1 - peripheral reset control register 1 */
/*! @{ */
#define RSTCTRL0_PRSTCTL1_SDIO0_MASK             (0x4U)
#define RSTCTRL0_PRSTCTL1_SDIO0_SHIFT            (2U)
/*! SDIO0 - SDIO0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_SDIO0(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SDIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_SDIO0_MASK)
#define RSTCTRL0_PRSTCTL1_SDIO1_MASK             (0x8U)
#define RSTCTRL0_PRSTCTL1_SDIO1_SHIFT            (3U)
/*! SDIO1 - SDIO1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_SDIO1(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SDIO1_SHIFT)) & RSTCTRL0_PRSTCTL1_SDIO1_MASK)
#define RSTCTRL0_PRSTCTL1_CAPT_MASK              (0x100U)
#define RSTCTRL0_PRSTCTL1_CAPT_SHIFT             (8U)
/*! CAPT - CAPT reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_CAPT(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CAPT_SHIFT)) & RSTCTRL0_PRSTCTL1_CAPT_MASK)
#define RSTCTRL0_PRSTCTL1_ACMP0_MASK             (0x8000U)
#define RSTCTRL0_PRSTCTL1_ACMP0_SHIFT            (15U)
/*! ACMP0 - Analog comparator reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_ACMP0(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_ACMP0_SHIFT)) & RSTCTRL0_PRSTCTL1_ACMP0_MASK)
#define RSTCTRL0_PRSTCTL1_ADC0_MASK              (0x10000U)
#define RSTCTRL0_PRSTCTL1_ADC0_SHIFT             (16U)
/*! ADC0 - ADC reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_ADC0(x)                (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_ADC0_SHIFT)) & RSTCTRL0_PRSTCTL1_ADC0_MASK)
#define RSTCTRL0_PRSTCTL1_SHSGPIO0_MASK          (0x1000000U)
#define RSTCTRL0_PRSTCTL1_SHSGPIO0_SHIFT         (24U)
/*! SHSGPIO0 - SHSGPIO0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL1_SHSGPIO0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SHSGPIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_SHSGPIO0_MASK)
/*! @} */

