JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name PRSTCTL2 - peripheral reset control register 2 */
/*! @{ */
#define RSTCTRL0_PRSTCTL2_UTICK0_MASK            (0x1U)
#define RSTCTRL0_PRSTCTL2_UTICK0_SHIFT           (0U)
/*! UTICK0 - utick reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL2_UTICK0(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_UTICK0_SHIFT)) & RSTCTRL0_PRSTCTL2_UTICK0_MASK)
#define RSTCTRL0_PRSTCTL2_WWDT0_MASK             (0x2U)
#define RSTCTRL0_PRSTCTL2_WWDT0_SHIFT            (1U)
/*! WWDT0 - wdt reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL2_WWDT0(x)               (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_WWDT0_SHIFT)) & RSTCTRL0_PRSTCTL2_WWDT0_MASK)
#define RSTCTRL0_PRSTCTL2_FREEMRT_MASK           (0x4000000U)
#define RSTCTRL0_PRSTCTL2_FREEMRT_SHIFT          (26U)
/*! FREEMRT - FREEMRT(test) reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL2_FREEMRT(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_FREEMRT_SHIFT)) & RSTCTRL0_PRSTCTL2_FREEMRT_MASK)
#define RSTCTRL0_PRSTCTL2_PVTCTL_MASK            (0x8000000U)
#define RSTCTRL0_PRSTCTL2_PVTCTL_SHIFT           (27U)
/*! PVTCTL - PVTCTL(test) reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL2_PVTCTL(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_PVTCTL_SHIFT)) & RSTCTRL0_PRSTCTL2_PVTCTL_MASK)
#define RSTCTRL0_PRSTCTL2_DPM_MASK               (0x10000000U)
#define RSTCTRL0_PRSTCTL2_DPM_SHIFT              (28U)
/*! DPM - DPM(test)(Feature Deprecated) reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL0_PRSTCTL2_DPM(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_DPM_SHIFT)) & RSTCTRL0_PRSTCTL2_DPM_MASK)
/*! @} */

/*! @name PRSTCTL0_SET - peripheral reset set register 0 */
/*! @{ */
#define RSTCTRL0_PRSTCTL0_SET_HIFI_DSP_MASK      (0x2U)
#define RSTCTRL0_PRSTCTL0_SET_HIFI_DSP_SHIFT     (1U)
/*! HIFI_DSP - HIFI DSP reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_HIFI_DSP(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_HIFI_DSP_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_HIFI_DSP_MASK)
#define RSTCTRL0_PRSTCTL0_SET_POWERQUAD_MASK     (0x100U)
#define RSTCTRL0_PRSTCTL0_SET_POWERQUAD_SHIFT    (8U)
/*! POWERQUAD - powerquad reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_POWERQUAD(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_POWERQUAD_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_POWERQUAD_MASK)
#define RSTCTRL0_PRSTCTL0_SET_CASPER_MASK        (0x200U)
#define RSTCTRL0_PRSTCTL0_SET_CASPER_SHIFT       (9U)
/*! CASPER - CAPSER reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_CASPER(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_CASPER_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_CASPER_MASK)
#define RSTCTRL0_PRSTCTL0_SET_HASHCRYPT_MASK     (0x400U)
#define RSTCTRL0_PRSTCTL0_SET_HASHCRYPT_SHIFT    (10U)
/*! HASHCRYPT - HASHCRYPT reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_HASHCRYPT(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_HASHCRYPT_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_HASHCRYPT_MASK)
#define RSTCTRL0_PRSTCTL0_SET_PUF_MASK           (0x800U)
#define RSTCTRL0_PRSTCTL0_SET_PUF_SHIFT          (11U)
/*! PUF - PUF reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_PUF(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_PUF_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_PUF_MASK)
#define RSTCTRL0_PRSTCTL0_SET_RNG_MASK           (0x1000U)
#define RSTCTRL0_PRSTCTL0_SET_RNG_SHIFT          (12U)
/*! RNG - RNG reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_RNG(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_RNG_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_RNG_MASK)
#define RSTCTRL0_PRSTCTL0_SET_OSPI_OTFAD_MASK    (0x10000U)
#define RSTCTRL0_PRSTCTL0_SET_OSPI_OTFAD_SHIFT   (16U)
/*! OSPI_OTFAD - OSPI reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_OSPI_OTFAD(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_OSPI_OTFAD_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_OSPI_OTFAD_MASK)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_PHY_MASK     (0x100000U)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_PHY_SHIFT    (20U)
/*! USBHS_PHY - USB PHY reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_USBHS_PHY(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_USBHS_PHY_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_USBHS_PHY_MASK)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_DEVICE_MASK  (0x200000U)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_DEVICE_SHIFT (21U)
/*! USBHS_DEVICE - USB DEVICE reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_USBHS_DEVICE(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_USBHS_DEVICE_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_USBHS_DEVICE_MASK)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_HOST_MASK    (0x400000U)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_HOST_SHIFT   (22U)
/*! USBHS_HOST - USB HOST reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_USBHS_HOST(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_USBHS_HOST_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_USBHS_HOST_MASK)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_SRAM_MASK    (0x800000U)
#define RSTCTRL0_PRSTCTL0_SET_USBHS_SRAM_SHIFT   (23U)
/*! USBHS_SRAM - USBHS RAM reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_USBHS_SRAM(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_USBHS_SRAM_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_USBHS_SRAM_MASK)
#define RSTCTRL0_PRSTCTL0_SET_SCT_MASK           (0x1000000U)
#define RSTCTRL0_PRSTCTL0_SET_SCT_SHIFT          (24U)
/*! SCT - SCT reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_SET_SCT(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_SET_SCT_SHIFT)) & RSTCTRL0_PRSTCTL0_SET_SCT_MASK)
/*! @} */

/*! @name PRSTCTL1_SET - peripheral reset set register 1 */
/*! @{ */
#define RSTCTRL0_PRSTCTL1_SET_SDIO0_MASK         (0x4U)
#define RSTCTRL0_PRSTCTL1_SET_SDIO0_SHIFT        (2U)
/*! SDIO0 - SDIO0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_SDIO0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_SDIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_SDIO0_MASK)
#define RSTCTRL0_PRSTCTL1_SET_SDIO1_MASK         (0x8U)
#define RSTCTRL0_PRSTCTL1_SET_SDIO1_SHIFT        (3U)
/*! SDIO1 - SDIO1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_SDIO1(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_SDIO1_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_SDIO1_MASK)
#define RSTCTRL0_PRSTCTL1_SET_CAPT_MASK          (0x100U)
#define RSTCTRL0_PRSTCTL1_SET_CAPT_SHIFT         (8U)
/*! CAPT - CAPT reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_CAPT(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_CAPT_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_CAPT_MASK)
#define RSTCTRL0_PRSTCTL1_SET_ACMP0_MASK         (0x8000U)
#define RSTCTRL0_PRSTCTL1_SET_ACMP0_SHIFT        (15U)
/*! ACMP0 - Analog comparator reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_ACMP0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_ACMP0_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_ACMP0_MASK)
#define RSTCTRL0_PRSTCTL1_SET_ADC0_MASK          (0x10000U)
#define RSTCTRL0_PRSTCTL1_SET_ADC0_SHIFT         (16U)
/*! ADC0 - ADC reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_ADC0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_ADC0_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_ADC0_MASK)
#define RSTCTRL0_PRSTCTL1_SET_SHSGPIO0_MASK      (0x1000000U)
#define RSTCTRL0_PRSTCTL1_SET_SHSGPIO0_SHIFT     (24U)
/*! SHSGPIO0 - SHSGPIO0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_SET_SHSGPIO0(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_SET_SHSGPIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_SET_SHSGPIO0_MASK)
/*! @} */

/*! @name PRSTCTL2_SET - peripheral reset set register 2 */
/*! @{ */
#define RSTCTRL0_PRSTCTL2_SET_UTICK0_MASK        (0x1U)
#define RSTCTRL0_PRSTCTL2_SET_UTICK0_SHIFT       (0U)
/*! UTICK0 - utick reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_SET_UTICK0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_SET_UTICK0_SHIFT)) & RSTCTRL0_PRSTCTL2_SET_UTICK0_MASK)
#define RSTCTRL0_PRSTCTL2_SET_WWDT0_MASK         (0x2U)
#define RSTCTRL0_PRSTCTL2_SET_WWDT0_SHIFT        (1U)
/*! WWDT0 - wdt reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_SET_WWDT0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_SET_WWDT0_SHIFT)) & RSTCTRL0_PRSTCTL2_SET_WWDT0_MASK)
#define RSTCTRL0_PRSTCTL2_SET_FREEMRT_MASK       (0x4000000U)
#define RSTCTRL0_PRSTCTL2_SET_FREEMRT_SHIFT      (26U)
/*! FREEMRT - FREEMRT(test) reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_SET_FREEMRT(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_SET_FREEMRT_SHIFT)) & RSTCTRL0_PRSTCTL2_SET_FREEMRT_MASK)
#define RSTCTRL0_PRSTCTL2_SET_PVTCTL_MASK        (0x8000000U)
#define RSTCTRL0_PRSTCTL2_SET_PVTCTL_SHIFT       (27U)
/*! PVTCTL - PVTCTL(test) reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_SET_PVTCTL(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_SET_PVTCTL_SHIFT)) & RSTCTRL0_PRSTCTL2_SET_PVTCTL_MASK)
#define RSTCTRL0_PRSTCTL2_SET_DPM_MASK           (0x10000000U)
#define RSTCTRL0_PRSTCTL2_SET_DPM_SHIFT          (28U)
/*! DPM - DPM(test)(Feature Deprecated) reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_SET_DPM(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_SET_DPM_SHIFT)) & RSTCTRL0_PRSTCTL2_SET_DPM_MASK)
/*! @} */

/*! @name PRSTCTL0_CLR - peripheral reset clear register 0 */
/*! @{ */
#define RSTCTRL0_PRSTCTL0_CLR_HIFI_DSP_MASK      (0x2U)
#define RSTCTRL0_PRSTCTL0_CLR_HIFI_DSP_SHIFT     (1U)
/*! HIFI_DSP - HIFI DSP reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_HIFI_DSP(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_HIFI_DSP_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_HIFI_DSP_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_POWERQUAD_MASK     (0x100U)
#define RSTCTRL0_PRSTCTL0_CLR_POWERQUAD_SHIFT    (8U)
/*! POWERQUAD - powerquad reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_POWERQUAD(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_POWERQUAD_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_POWERQUAD_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_CASPER_MASK        (0x200U)
#define RSTCTRL0_PRSTCTL0_CLR_CASPER_SHIFT       (9U)
/*! CASPER - CAPSER reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_CASPER(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_CASPER_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_CASPER_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_HASHCRYPT_MASK     (0x400U)
#define RSTCTRL0_PRSTCTL0_CLR_HASHCRYPT_SHIFT    (10U)
/*! HASHCRYPT - HASHCRYPT reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_HASHCRYPT(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_HASHCRYPT_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_HASHCRYPT_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_PUF_MASK           (0x800U)
#define RSTCTRL0_PRSTCTL0_CLR_PUF_SHIFT          (11U)
/*! PUF - PUF reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_PUF(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_PUF_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_PUF_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_RNG_MASK           (0x1000U)
#define RSTCTRL0_PRSTCTL0_CLR_RNG_SHIFT          (12U)
/*! RNG - RNG reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_RNG(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_RNG_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_RNG_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_OSPI_OTFAD_MASK    (0x10000U)
#define RSTCTRL0_PRSTCTL0_CLR_OSPI_OTFAD_SHIFT   (16U)
/*! OSPI_OTFAD - OSPI reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_OSPI_OTFAD(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_OSPI_OTFAD_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_OSPI_OTFAD_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_PHY_MASK     (0x100000U)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_PHY_SHIFT    (20U)
/*! USBHS_PHY - USB PHY reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_PHY(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_USBHS_PHY_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_USBHS_PHY_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_DEVICE_MASK  (0x200000U)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_DEVICE_SHIFT (21U)
/*! USBHS_DEVICE - USB DEVICE reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_DEVICE(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_USBHS_DEVICE_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_USBHS_DEVICE_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_HOST_MASK    (0x400000U)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_HOST_SHIFT   (22U)
/*! USBHS_HOST - USB HOST reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_HOST(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_USBHS_HOST_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_USBHS_HOST_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_SRAM_MASK    (0x800000U)
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_SRAM_SHIFT   (23U)
/*! USBHS_SRAM - USBHS RAM reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_USBHS_SRAM(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_USBHS_SRAM_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_USBHS_SRAM_MASK)
#define RSTCTRL0_PRSTCTL0_CLR_SCT_MASK           (0x1000000U)
#define RSTCTRL0_PRSTCTL0_CLR_SCT_SHIFT          (24U)
/*! SCT - SCT reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL0 Bit
 */
#define RSTCTRL0_PRSTCTL0_CLR_SCT(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL0_CLR_SCT_SHIFT)) & RSTCTRL0_PRSTCTL0_CLR_SCT_MASK)
/*! @} */

/*! @name PRSTCTL1_CLR - peripheral reset clear register 1 */
/*! @{ */
#define RSTCTRL0_PRSTCTL1_CLR_SDIO0_MASK         (0x4U)
#define RSTCTRL0_PRSTCTL1_CLR_SDIO0_SHIFT        (2U)
/*! SDIO0 - SDIO0 reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_SDIO0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_SDIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_SDIO0_MASK)
#define RSTCTRL0_PRSTCTL1_CLR_SDIO1_MASK         (0x8U)
#define RSTCTRL0_PRSTCTL1_CLR_SDIO1_SHIFT        (3U)
/*! SDIO1 - SDIO1 reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_SDIO1(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_SDIO1_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_SDIO1_MASK)
#define RSTCTRL0_PRSTCTL1_CLR_CAPT_MASK          (0x100U)
#define RSTCTRL0_PRSTCTL1_CLR_CAPT_SHIFT         (8U)
/*! CAPT - CAPT reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_CAPT(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_CAPT_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_CAPT_MASK)
#define RSTCTRL0_PRSTCTL1_CLR_ACMP0_MASK         (0x8000U)
#define RSTCTRL0_PRSTCTL1_CLR_ACMP0_SHIFT        (15U)
/*! ACMP0 - Analog comparator reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_ACMP0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_ACMP0_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_ACMP0_MASK)
#define RSTCTRL0_PRSTCTL1_CLR_ADC0_MASK          (0x10000U)
#define RSTCTRL0_PRSTCTL1_CLR_ADC0_SHIFT         (16U)
/*! ADC0 - ADC reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_ADC0(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_ADC0_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_ADC0_MASK)
#define RSTCTRL0_PRSTCTL1_CLR_SHSGPIO0_MASK      (0x1000000U)
#define RSTCTRL0_PRSTCTL1_CLR_SHSGPIO0_SHIFT     (24U)
/*! SHSGPIO0 - SHSGPIO0 reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL1 Bit
 */
#define RSTCTRL0_PRSTCTL1_CLR_SHSGPIO0(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL1_CLR_SHSGPIO0_SHIFT)) & RSTCTRL0_PRSTCTL1_CLR_SHSGPIO0_MASK)
/*! @} */

/*! @name PRSTCTL2_CLR - peripheral reset clear register 2 */
/*! @{ */
#define RSTCTRL0_PRSTCTL2_CLR_UTICK0_MASK        (0x1U)
#define RSTCTRL0_PRSTCTL2_CLR_UTICK0_SHIFT       (0U)
/*! UTICK0 - utick reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_CLR_UTICK0(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_CLR_UTICK0_SHIFT)) & RSTCTRL0_PRSTCTL2_CLR_UTICK0_MASK)
#define RSTCTRL0_PRSTCTL2_CLR_WWDT0_MASK         (0x2U)
#define RSTCTRL0_PRSTCTL2_CLR_WWDT0_SHIFT        (1U)
/*! WWDT0 - wdt reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_CLR_WWDT0(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_CLR_WWDT0_SHIFT)) & RSTCTRL0_PRSTCTL2_CLR_WWDT0_MASK)
#define RSTCTRL0_PRSTCTL2_CLR_FREEMRT_MASK       (0x4000000U)
#define RSTCTRL0_PRSTCTL2_CLR_FREEMRT_SHIFT      (26U)
/*! FREEMRT - FREEMRT(test) reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_CLR_FREEMRT(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_CLR_FREEMRT_SHIFT)) & RSTCTRL0_PRSTCTL2_CLR_FREEMRT_MASK)
#define RSTCTRL0_PRSTCTL2_CLR_PVTCTL_MASK        (0x8000000U)
#define RSTCTRL0_PRSTCTL2_CLR_PVTCTL_SHIFT       (27U)
/*! PVTCTL - PVTCTL(test) reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_CLR_PVTCTL(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_CLR_PVTCTL_SHIFT)) & RSTCTRL0_PRSTCTL2_CLR_PVTCTL_MASK)
#define RSTCTRL0_PRSTCTL2_CLR_DPM_MASK           (0x10000000U)
#define RSTCTRL0_PRSTCTL2_CLR_DPM_SHIFT          (28U)
/*! DPM - DPM(test)(Feature Deprecated) reset clear
 *  0b0..No Effect
 *  0b1..Clears the PRSTCTL2 Bit
 */
#define RSTCTRL0_PRSTCTL2_CLR_DPM(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL0_PRSTCTL2_CLR_DPM_SHIFT)) & RSTCTRL0_PRSTCTL2_CLR_DPM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RSTCTRL0_Register_Masks */


