JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/* RSTCTRL0 - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral RSTCTRL0 base address */
  #define RSTCTRL0_BASE                            (0x50000000u)
  /** Peripheral RSTCTRL0 base address */
  #define RSTCTRL0_BASE_NS                         (0x40000000u)
  /** Peripheral RSTCTRL0 base pointer */
  #define RSTCTRL0                                 ((RSTCTRL0_Type *)RSTCTRL0_BASE)
  /** Peripheral RSTCTRL0 base pointer */
  #define RSTCTRL0_NS                              ((RSTCTRL0_Type *)RSTCTRL0_BASE_NS)
  /** Array initializer of RSTCTRL0 peripheral base addresses */
  #define RSTCTRL0_BASE_ADDRS                      { RSTCTRL0_BASE }
  /** Array initializer of RSTCTRL0 peripheral base pointers */
  #define RSTCTRL0_BASE_PTRS                       { RSTCTRL0 }
  /** Array initializer of RSTCTRL0 peripheral base addresses */
  #define RSTCTRL0_BASE_ADDRS_NS                   { RSTCTRL0_BASE_NS }
  /** Array initializer of RSTCTRL0 peripheral base pointers */
  #define RSTCTRL0_BASE_PTRS_NS                    { RSTCTRL0_NS }
#else
  /** Peripheral RSTCTRL0 base address */
  #define RSTCTRL0_BASE                            (0x40000000u)
  /** Peripheral RSTCTRL0 base pointer */
  #define RSTCTRL0                                 ((RSTCTRL0_Type *)RSTCTRL0_BASE)
  /** Array initializer of RSTCTRL0 peripheral base addresses */
  #define RSTCTRL0_BASE_ADDRS                      { RSTCTRL0_BASE }
  /** Array initializer of RSTCTRL0 peripheral base pointers */
  #define RSTCTRL0_BASE_PTRS                       { RSTCTRL0 }
#endif

/*!
 * @}
 */ /* end of group RSTCTRL0_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RSTCTRL1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTRL1_Peripheral_Access_Layer RSTCTRL1 Peripheral Access Layer
 * @{
 */

/** RSTCTRL1 - Register Layout Typedef */
typedef struct {
  __IO uint32_t SYSRSTSTAT;                        /**< system reset status register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  __IO uint32_t PRSTCTL0;                          /**< peripheral reset control register 0, offset: 0x10 */
  __IO uint32_t PRSTCTL1;                          /**< peripheral reset control register 1, offset: 0x14 */
  __IO uint32_t PRSTCTL2;                          /**< peripheral reset control register 2, offset: 0x18 */
       uint8_t RESERVED_1[36];
  __O  uint32_t PRSTCTL0_SET;                      /**< peripheral reset set register 0, offset: 0x40 */
  __O  uint32_t PRSTCTL1_SET;                      /**< peripheral reset set register 1, offset: 0x44 */
  __O  uint32_t PRSTCTL2_SET;                      /**< peripheral reset set register 2, offset: 0x48 */
       uint8_t RESERVED_2[36];
  __O  uint32_t PRSTCTL0_CLR;                      /**< peripheral reset clear register 0, offset: 0x70 */
  __O  uint32_t PRSTCTL1_CLR;                      /**< peripheral reset clear register 1, offset: 0x74 */
  __O  uint32_t PRSTCTL2_CLR;                      /**< peripheral reset clear register 2, offset: 0x78 */
} RSTCTRL1_Type;

/* ----------------------------------------------------------------------------
   -- RSTCTRL1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RSTCTRL1_Register_Masks RSTCTRL1 Register Masks
 * @{
 */

/*! @name SYSRSTSTAT - system reset status register */
/*! @{ */
#define RSTCTRL1_SYSRSTSTAT_VDD_POR_MASK         (0x1U)
#define RSTCTRL1_SYSRSTSTAT_VDD_POR_SHIFT        (0U)
/*! VDD_POR - VDD POR Event Detected:
 *  0b0..No event detected.
 *  0b1..VDD POR event detected. (Writing a â1â to this bit clears this status).
 */
#define RSTCTRL1_SYSRSTSTAT_VDD_POR(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_SYSRSTSTAT_VDD_POR_SHIFT)) & RSTCTRL1_SYSRSTSTAT_VDD_POR_MASK)
#define RSTCTRL1_SYSRSTSTAT_PAD_RESET_MASK       (0x10U)
#define RSTCTRL1_SYSRSTSTAT_PAD_RESET_SHIFT      (4U)
/*! PAD_RESET - PAD RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..RESET Detected. (Write 1 to CLR),
 */
#define RSTCTRL1_SYSRSTSTAT_PAD_RESET(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_SYSRSTSTAT_PAD_RESET_SHIFT)) & RSTCTRL1_SYSRSTSTAT_PAD_RESET_MASK)
#define RSTCTRL1_SYSRSTSTAT_ARM_APD_RESET_MASK   (0x20U)
#define RSTCTRL1_SYSRSTSTAT_ARM_APD_RESET_SHIFT  (5U)
/*! ARM_APD_RESET - ARM RESET Event Detected:
 *  0b0..No event detected.
 *  0b1..ARM reset event detected. (Writing a â1â to this bit clears this status).
 */
#define RSTCTRL1_SYSRSTSTAT_ARM_APD_RESET(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_SYSRSTSTAT_ARM_APD_RESET_SHIFT)) & RSTCTRL1_SYSRSTSTAT_ARM_APD_RESET_MASK)
#define RSTCTRL1_SYSRSTSTAT_WDT0_RESET_MASK      (0x40U)
#define RSTCTRL1_SYSRSTSTAT_WDT0_RESET_SHIFT     (6U)
/*! WDT0_RESET - WDT0 RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..WDT0 reset event detected. (Writing a â1â to this bit clears this status).
 */
#define RSTCTRL1_SYSRSTSTAT_WDT0_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_SYSRSTSTAT_WDT0_RESET_SHIFT)) & RSTCTRL1_SYSRSTSTAT_WDT0_RESET_MASK)
#define RSTCTRL1_SYSRSTSTAT_WDT1_RESET_MASK      (0x80U)
#define RSTCTRL1_SYSRSTSTAT_WDT1_RESET_SHIFT     (7U)
/*! WDT1_RESET - WDT1 RESET Event Detected:
 *  0b0..No EVENT Detected.
 *  0b1..WDT1 reset event detected. (Writing a 1 to this bit clears this status).
 */
#define RSTCTRL1_SYSRSTSTAT_WDT1_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_SYSRSTSTAT_WDT1_RESET_SHIFT)) & RSTCTRL1_SYSRSTSTAT_WDT1_RESET_MASK)
/*! @} */

/*! @name PRSTCTL0 - peripheral reset control register 0 */
/*! @{ */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM0_RST_MASK     (0x100U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM0_RST_SHIFT    (8U)
/*! FLEXCOMM0_RST - FLEXCOMM0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM0_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM0_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM0_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM1_RST_MASK     (0x200U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM1_RST_SHIFT    (9U)
/*! FLEXCOMM1_RST - FLEXCOMM1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM1_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM1_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM1_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM2_RST_MASK     (0x400U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM2_RST_SHIFT    (10U)
/*! FLEXCOMM2_RST - FLEXCOMM2 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM2_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM2_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM2_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM3_RST_MASK     (0x800U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM3_RST_SHIFT    (11U)
/*! FLEXCOMM3_RST - FLEXCOMM3 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM3_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM3_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM3_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM4_RST_MASK     (0x1000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM4_RST_SHIFT    (12U)
/*! FLEXCOMM4_RST - FLEXCOMM4 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM4_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM4_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM4_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM5_RST_MASK     (0x2000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM5_RST_SHIFT    (13U)
/*! FLEXCOMM5_RST - FLEXCOMM5 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM5_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM5_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM5_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM6_RST_MASK     (0x4000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM6_RST_SHIFT    (14U)
/*! FLEXCOMM6_RST - FLEXCOMM6 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM6_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM6_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM6_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM7_RST_MASK     (0x8000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM7_RST_SHIFT    (15U)
/*! FLEXCOMM7_RST - FLEXCOMM7 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM7_RST(x)       (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM7_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM7_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM14_SPI_RST_MASK (0x400000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM14_SPI_RST_SHIFT (22U)
/*! FLEXCOMM14_SPI_RST - FLEXCOMM14 SPI reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM14_SPI_RST(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM14_SPI_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM14_SPI_RST_MASK)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM15_I2C_RST_MASK (0x800000U)
#define RSTCTRL1_PRSTCTL0_FLEXCOMM15_I2C_RST_SHIFT (23U)
/*! FLEXCOMM15_I2C_RST - FLEXCOMM15 I2C reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_FLEXCOMM15_I2C_RST(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_FLEXCOMM15_I2C_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_FLEXCOMM15_I2C_RST_MASK)
#define RSTCTRL1_PRSTCTL0_DMIC0_RST_MASK         (0x1000000U)
#define RSTCTRL1_PRSTCTL0_DMIC0_RST_SHIFT        (24U)
/*! DMIC0_RST - DMIC0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_DMIC0_RST(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_DMIC0_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_DMIC0_RST_MASK)
#define RSTCTRL1_PRSTCTL0_OSEVT_TIMER_RST_MASK   (0x8000000U)
#define RSTCTRL1_PRSTCTL0_OSEVT_TIMER_RST_SHIFT  (27U)
/*! OSEVT_TIMER_RST - osevent timer reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL0_OSEVT_TIMER_RST(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_OSEVT_TIMER_RST_SHIFT)) & RSTCTRL1_PRSTCTL0_OSEVT_TIMER_RST_MASK)
/*! @} */

/*! @name PRSTCTL1 - peripheral reset control register 1 */
/*! @{ */
#define RSTCTRL1_PRSTCTL1_HSGPIO0_RST_MASK       (0x1U)
#define RSTCTRL1_PRSTCTL1_HSGPIO0_RST_SHIFT      (0U)
/*! HSGPIO0_RST - HSGPIO0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO0_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO0_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO0_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO1_RST_MASK       (0x2U)
#define RSTCTRL1_PRSTCTL1_HSGPIO1_RST_SHIFT      (1U)
/*! HSGPIO1_RST - HSGPIO1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO1_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO1_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO1_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO2_RST_MASK       (0x4U)
#define RSTCTRL1_PRSTCTL1_HSGPIO2_RST_SHIFT      (2U)
/*! HSGPIO2_RST - HSGPIO2 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO2_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO2_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO2_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO3_RST_MASK       (0x8U)
#define RSTCTRL1_PRSTCTL1_HSGPIO3_RST_SHIFT      (3U)
/*! HSGPIO3_RST - HSGPIO3 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO3_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO3_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO3_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO4_RST_MASK       (0x10U)
#define RSTCTRL1_PRSTCTL1_HSGPIO4_RST_SHIFT      (4U)
/*! HSGPIO4_RST - HSGPIO4 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO4_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO4_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO4_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO5_RST_MASK       (0x20U)
#define RSTCTRL1_PRSTCTL1_HSGPIO5_RST_SHIFT      (5U)
/*! HSGPIO5_RST - HSGPIO5 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO5_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO5_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO5_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO6_RST_MASK       (0x40U)
#define RSTCTRL1_PRSTCTL1_HSGPIO6_RST_SHIFT      (6U)
/*! HSGPIO6_RST - HSGPIO6 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO6_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO6_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO6_RST_MASK)
#define RSTCTRL1_PRSTCTL1_HSGPIO7_RST_MASK       (0x80U)
#define RSTCTRL1_PRSTCTL1_HSGPIO7_RST_SHIFT      (7U)
/*! HSGPIO7_RST - HSGPIO7 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_HSGPIO7_RST(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_HSGPIO7_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_HSGPIO7_RST_MASK)
#define RSTCTRL1_PRSTCTL1_CRC_RST_MASK           (0x10000U)
#define RSTCTRL1_PRSTCTL1_CRC_RST_SHIFT          (16U)
/*! CRC_RST - CRC reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_CRC_RST(x)             (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CRC_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_CRC_RST_MASK)
#define RSTCTRL1_PRSTCTL1_DMAC0_RST_MASK         (0x800000U)
#define RSTCTRL1_PRSTCTL1_DMAC0_RST_SHIFT        (23U)
/*! DMAC0_RST - DMAC0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_DMAC0_RST(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_DMAC0_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_DMAC0_RST_MASK)
#define RSTCTRL1_PRSTCTL1_DMAC1_RST_MASK         (0x1000000U)
#define RSTCTRL1_PRSTCTL1_DMAC1_RST_SHIFT        (24U)
/*! DMAC1_RST - DMAC1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_DMAC1_RST(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_DMAC1_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_DMAC1_RST_MASK)
#define RSTCTRL1_PRSTCTL1_MU_RST_MASK            (0x10000000U)
#define RSTCTRL1_PRSTCTL1_MU_RST_SHIFT           (28U)
/*! MU_RST - MU reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_MU_RST(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_MU_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_MU_RST_MASK)
#define RSTCTRL1_PRSTCTL1_SEMA_RST_MASK          (0x20000000U)
#define RSTCTRL1_PRSTCTL1_SEMA_RST_SHIFT         (29U)
/*! SEMA_RST - SEMA reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_SEMA_RST(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SEMA_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_SEMA_RST_MASK)
#define RSTCTRL1_PRSTCTL1_FREQME_RST_MASK        (0x80000000U)
#define RSTCTRL1_PRSTCTL1_FREQME_RST_SHIFT       (31U)
/*! FREQME_RST - FREQME reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL1_FREQME_RST(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_FREQME_RST_SHIFT)) & RSTCTRL1_PRSTCTL1_FREQME_RST_MASK)
/*! @} */

