JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name PRSTCTL2 - peripheral reset control register 2 */
/*! @{ */
#define RSTCTRL1_PRSTCTL2_CT32BIT0_RST_MASK      (0x1U)
#define RSTCTRL1_PRSTCTL2_CT32BIT0_RST_SHIFT     (0U)
/*! CT32BIT0_RST - CT32BIT0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_CT32BIT0_RST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CT32BIT0_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_CT32BIT0_RST_MASK)
#define RSTCTRL1_PRSTCTL2_CT32BIT1_RST_MASK      (0x2U)
#define RSTCTRL1_PRSTCTL2_CT32BIT1_RST_SHIFT     (1U)
/*! CT32BIT1_RST - CT32BIT1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_CT32BIT1_RST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CT32BIT1_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_CT32BIT1_RST_MASK)
#define RSTCTRL1_PRSTCTL2_CT32BIT2_RST_MASK      (0x4U)
#define RSTCTRL1_PRSTCTL2_CT32BIT2_RST_SHIFT     (2U)
/*! CT32BIT2_RST - CT32BIT2 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_CT32BIT2_RST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CT32BIT2_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_CT32BIT2_RST_MASK)
#define RSTCTRL1_PRSTCTL2_CT32BIT3_RST_MASK      (0x8U)
#define RSTCTRL1_PRSTCTL2_CT32BIT3_RST_SHIFT     (3U)
/*! CT32BIT3_RST - CT32BIT3 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_CT32BIT3_RST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CT32BIT3_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_CT32BIT3_RST_MASK)
#define RSTCTRL1_PRSTCTL2_CT32BIT4_RST_MASK      (0x10U)
#define RSTCTRL1_PRSTCTL2_CT32BIT4_RST_SHIFT     (4U)
/*! CT32BIT4_RST - CT32BIT4 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_CT32BIT4_RST(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CT32BIT4_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_CT32BIT4_RST_MASK)
#define RSTCTRL1_PRSTCTL2_MRT0_RST_MASK          (0x100U)
#define RSTCTRL1_PRSTCTL2_MRT0_RST_SHIFT         (8U)
/*! MRT0_RST - MRT0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_MRT0_RST(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_MRT0_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_MRT0_RST_MASK)
#define RSTCTRL1_PRSTCTL2_WWDT1_RST_MASK         (0x400U)
#define RSTCTRL1_PRSTCTL2_WWDT1_RST_SHIFT        (10U)
/*! WWDT1_RST - WWDT1 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_WWDT1_RST(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_WWDT1_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_WWDT1_RST_MASK)
#define RSTCTRL1_PRSTCTL2_I3C0_RST_MASK          (0x10000U)
#define RSTCTRL1_PRSTCTL2_I3C0_RST_SHIFT         (16U)
/*! I3C0_RST - I3C0 reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_I3C0_RST(x)            (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_I3C0_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_I3C0_RST_MASK)
#define RSTCTRL1_PRSTCTL2_GPIOINTCTL_RST_MASK    (0x40000000U)
#define RSTCTRL1_PRSTCTL2_GPIOINTCTL_RST_SHIFT   (30U)
/*! GPIOINTCTL_RST - GPIOINTCTL reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_GPIOINTCTL_RST(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_GPIOINTCTL_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_GPIOINTCTL_RST_MASK)
#define RSTCTRL1_PRSTCTL2_PIMCTL_RST_MASK        (0x80000000U)
#define RSTCTRL1_PRSTCTL2_PIMCTL_RST_SHIFT       (31U)
/*! PIMCTL_RST - PMC reset control
 *  0b0..clear reset
 *  0b1..set reset
 */
#define RSTCTRL1_PRSTCTL2_PIMCTL_RST(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_PIMCTL_RST_SHIFT)) & RSTCTRL1_PRSTCTL2_PIMCTL_RST_MASK)
/*! @} */

/*! @name PRSTCTL0_SET - peripheral reset set register 0 */
/*! @{ */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM0_RST_SET_MASK (0x100U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM0_RST_SET_SHIFT (8U)
/*! FLEXCOMM0_RST_SET - FLEXCOMM0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM0_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM1_RST_SET_MASK (0x200U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM1_RST_SET_SHIFT (9U)
/*! FLEXCOMM1_RST_SET - FLEXCOMM1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM1_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM1_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM1_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM2_RST_SET_MASK (0x400U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM2_RST_SET_SHIFT (10U)
/*! FLEXCOMM2_RST_SET - FLEXCOMM2 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM2_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM2_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM2_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM3_RST_SET_MASK (0x800U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM3_RST_SET_SHIFT (11U)
/*! FLEXCOMM3_RST_SET - FLEXCOMM3 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM3_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM3_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM3_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM4_RST_SET_MASK (0x1000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM4_RST_SET_SHIFT (12U)
/*! FLEXCOMM4_RST_SET - FLEXCOMM4 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM4_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM4_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM4_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM5_RST_SET_MASK (0x2000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM5_RST_SET_SHIFT (13U)
/*! FLEXCOMM5_RST_SET - FLEXCOMM5 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM5_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM5_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM5_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM6_RST_SET_MASK (0x4000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM6_RST_SET_SHIFT (14U)
/*! FLEXCOMM6_RST_SET - FLEXCOMM6 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM6_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM6_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM6_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM7_RST_SET_MASK (0x8000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM7_RST_SET_SHIFT (15U)
/*! FLEXCOMM7_RST_SET - FLEXCOMM7 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM7_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM7_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM7_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM14_SPI_RST_SET_MASK (0x400000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM14_SPI_RST_SET_SHIFT (22U)
/*! FLEXCOMM14_SPI_RST_SET - FLEXCOMM14 SPI reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM14_SPI_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM14_SPI_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM14_SPI_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM15_I2C_RST_SET_MASK (0x800000U)
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM15_I2C_RST_SET_SHIFT (23U)
/*! FLEXCOMM15_I2C_RST_SET - FLEXCOMM15 I2C reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_FLEXCOMM15_I2C_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_FLEXCOMM15_I2C_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_FLEXCOMM15_I2C_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_DMIC0_RST_SET_MASK (0x1000000U)
#define RSTCTRL1_PRSTCTL0_SET_DMIC0_RST_SET_SHIFT (24U)
/*! DMIC0_RST_SET - DMIC0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_DMIC0_RST_SET(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_DMIC0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_DMIC0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL0_SET_OSEVT_TIMER_RST_SET_MASK (0x8000000U)
#define RSTCTRL1_PRSTCTL0_SET_OSEVT_TIMER_RST_SET_SHIFT (27U)
/*! OSEVT_TIMER_RST_SET - osevent timer reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_SET_OSEVT_TIMER_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_SET_OSEVT_TIMER_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL0_SET_OSEVT_TIMER_RST_SET_MASK)
/*! @} */

/*! @name PRSTCTL1_SET - peripheral reset set register 1 */
/*! @{ */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO0_RST_SET_MASK (0x1U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO0_RST_SET_SHIFT (0U)
/*! HSGPIO0_RST_SET - HSGPIO0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO0_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO1_RST_SET_MASK (0x2U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO1_RST_SET_SHIFT (1U)
/*! HSGPIO1_RST_SET - HSGPIO1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO1_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO1_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO1_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO2_RST_SET_MASK (0x4U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO2_RST_SET_SHIFT (2U)
/*! HSGPIO2_RST_SET - HSGPIO2 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO2_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO2_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO2_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO3_RST_SET_MASK (0x8U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO3_RST_SET_SHIFT (3U)
/*! HSGPIO3_RST_SET - HSGPIO3 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO3_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO3_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO3_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO4_RST_SET_MASK (0x10U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO4_RST_SET_SHIFT (4U)
/*! HSGPIO4_RST_SET - HSGPIO4 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO4_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO4_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO4_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO5_RST_SET_MASK (0x20U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO5_RST_SET_SHIFT (5U)
/*! HSGPIO5_RST_SET - HSGPIO5 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO5_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO5_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO5_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO6_RST_SET_MASK (0x40U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO6_RST_SET_SHIFT (6U)
/*! HSGPIO6_RST_SET - HSGPIO6 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO6_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO6_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO6_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO7_RST_SET_MASK (0x80U)
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO7_RST_SET_SHIFT (7U)
/*! HSGPIO7_RST_SET - HSGPIO7 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_HSGPIO7_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_HSGPIO7_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_HSGPIO7_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_CRC_RST_SET_MASK   (0x10000U)
#define RSTCTRL1_PRSTCTL1_SET_CRC_RST_SET_SHIFT  (16U)
/*! CRC_RST_SET - CRC reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_CRC_RST_SET(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_CRC_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_CRC_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_DMAC0_RST_SET_MASK (0x800000U)
#define RSTCTRL1_PRSTCTL1_SET_DMAC0_RST_SET_SHIFT (23U)
/*! DMAC0_RST_SET - DMAC0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_DMAC0_RST_SET(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_DMAC0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_DMAC0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_DMAC1_RST_SET_MASK (0x1000000U)
#define RSTCTRL1_PRSTCTL1_SET_DMAC1_RST_SET_SHIFT (24U)
/*! DMAC1_RST_SET - DMAC1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_DMAC1_RST_SET(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_DMAC1_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_DMAC1_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_MU_RST_SET_MASK    (0x10000000U)
#define RSTCTRL1_PRSTCTL1_SET_MU_RST_SET_SHIFT   (28U)
/*! MU_RST_SET - MU reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_MU_RST_SET(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_MU_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_MU_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_SEMA_RST_SET_MASK  (0x20000000U)
#define RSTCTRL1_PRSTCTL1_SET_SEMA_RST_SET_SHIFT (29U)
/*! SEMA_RST_SET - SEMA reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_SEMA_RST_SET(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_SEMA_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_SEMA_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL1_SET_FREQME_RST_SET_MASK (0x80000000U)
#define RSTCTRL1_PRSTCTL1_SET_FREQME_RST_SET_SHIFT (31U)
/*! FREQME_RST_SET - FREQME reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_SET_FREQME_RST_SET(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_SET_FREQME_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL1_SET_FREQME_RST_SET_MASK)
/*! @} */

/*! @name PRSTCTL2_SET - peripheral reset set register 2 */
/*! @{ */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT0_RST_SET_MASK (0x1U)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT0_RST_SET_SHIFT (0U)
/*! CT32BIT0_RST_SET - CT32BIT0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT0_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_CT32BIT0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_CT32BIT0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT1_RST_SET_MASK (0x2U)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT1_RST_SET_SHIFT (1U)
/*! CT32BIT1_RST_SET - CT32BIT1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT1_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_CT32BIT1_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_CT32BIT1_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT2_RST_SET_MASK (0x4U)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT2_RST_SET_SHIFT (2U)
/*! CT32BIT2_RST_SET - CT32BIT2 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT2_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_CT32BIT2_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_CT32BIT2_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT3_RST_SET_MASK (0x8U)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT3_RST_SET_SHIFT (3U)
/*! CT32BIT3_RST_SET - CT32BIT3 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT3_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_CT32BIT3_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_CT32BIT3_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT4_RST_SET_MASK (0x10U)
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT4_RST_SET_SHIFT (4U)
/*! CT32BIT4_RST_SET - CT32BIT4 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_CT32BIT4_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_CT32BIT4_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_CT32BIT4_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_MRT0_RST_SET_MASK  (0x100U)
#define RSTCTRL1_PRSTCTL2_SET_MRT0_RST_SET_SHIFT (8U)
/*! MRT0_RST_SET - MRT0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_MRT0_RST_SET(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_MRT0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_MRT0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_WWDT1_RST_SET_MASK (0x400U)
#define RSTCTRL1_PRSTCTL2_SET_WWDT1_RST_SET_SHIFT (10U)
/*! WWDT1_RST_SET - WWDT1 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_WWDT1_RST_SET(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_WWDT1_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_WWDT1_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_I3C0_RST_SET_MASK  (0x10000U)
#define RSTCTRL1_PRSTCTL2_SET_I3C0_RST_SET_SHIFT (16U)
/*! I3C0_RST_SET - I3C0 reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_I3C0_RST_SET(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_I3C0_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_I3C0_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_GPIOINTCTL_RST_SET_MASK (0x40000000U)
#define RSTCTRL1_PRSTCTL2_SET_GPIOINTCTL_RST_SET_SHIFT (30U)
/*! GPIOINTCTL_RST_SET - GPIOINTCTL reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_GPIOINTCTL_RST_SET(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_GPIOINTCTL_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_GPIOINTCTL_RST_SET_MASK)
#define RSTCTRL1_PRSTCTL2_SET_PIMCTL_RST_SET_MASK (0x80000000U)
#define RSTCTRL1_PRSTCTL2_SET_PIMCTL_RST_SET_SHIFT (31U)
/*! PIMCTL_RST_SET - PMC reset set
 *  0b0..No Effect
 *  0b1..Sets the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_SET_PIMCTL_RST_SET(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_SET_PIMCTL_RST_SET_SHIFT)) & RSTCTRL1_PRSTCTL2_SET_PIMCTL_RST_SET_MASK)
/*! @} */

/*! @name PRSTCTL0_CLR - peripheral reset clear register 0 */
/*! @{ */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM0_RST_CLR_MASK (0x100U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM0_RST_CLR_SHIFT (8U)
/*! FLEXCOMM0_RST_CLR - FLEXCOMM0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM0_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM1_RST_CLR_MASK (0x200U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM1_RST_CLR_SHIFT (9U)
/*! FLEXCOMM1_RST_CLR - FLEXCOMM1 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM1_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM1_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM1_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM2_RST_CLR_MASK (0x400U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM2_RST_CLR_SHIFT (10U)
/*! FLEXCOMM2_RST_CLR - FLEXCOMM2 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM2_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM2_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM2_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM3_RST_CLR_MASK (0x800U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM3_RST_CLR_SHIFT (11U)
/*! FLEXCOMM3_RST_CLR - FLEXCOMM3 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM3_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM3_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM3_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM4_RST_CLR_MASK (0x1000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM4_RST_CLR_SHIFT (12U)
/*! FLEXCOMM4_RST_CLR - FLEXCOMM4 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM4_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM4_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM4_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM5_RST_CLR_MASK (0x2000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM5_RST_CLR_SHIFT (13U)
/*! FLEXCOMM5_RST_CLR - FLEXCOMM5 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM5_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM5_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM5_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM6_RST_CLR_MASK (0x4000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM6_RST_CLR_SHIFT (14U)
/*! FLEXCOMM6_RST_CLR - FLEXCOMM6 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM6_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM6_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM6_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM7_RST_CLR_MASK (0x8000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM7_RST_CLR_SHIFT (15U)
/*! FLEXCOMM7_RST_CLR - FLEXCOMM7 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM7_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM7_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM7_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM14_SPI_RST_CLR_MASK (0x400000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM14_SPI_RST_CLR_SHIFT (22U)
/*! FLEXCOMM14_SPI_RST_CLR - FLEXCOMM14 SPI reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM14_SPI_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM14_SPI_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM14_SPI_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM15_I2C_RST_CLR_MASK (0x800000U)
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM15_I2C_RST_CLR_SHIFT (23U)
/*! FLEXCOMM15_I2C_RST_CLR - FLEXCOMM15 I2C reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM15_I2C_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM15_I2C_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_FLEXCOMM15_I2C_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_DMIC0_RST_CLR_MASK (0x1000000U)
#define RSTCTRL1_PRSTCTL0_CLR_DMIC0_RST_CLR_SHIFT (24U)
/*! DMIC0_RST_CLR - DMIC0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_DMIC0_RST_CLR(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_DMIC0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_DMIC0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL0_CLR_OSEVT_TIMER_RST_CLR_MASK (0x8000000U)
#define RSTCTRL1_PRSTCTL0_CLR_OSEVT_TIMER_RST_CLR_SHIFT (27U)
/*! OSEVT_TIMER_RST_CLR - osevent timer reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL0 Bit
 */
#define RSTCTRL1_PRSTCTL0_CLR_OSEVT_TIMER_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL0_CLR_OSEVT_TIMER_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL0_CLR_OSEVT_TIMER_RST_CLR_MASK)
/*! @} */

