JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name PRSTCTL1_CLR - peripheral reset clear register 1 */
/*! @{ */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO0_RST_CLR_MASK (0x1U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO0_RST_CLR_SHIFT (0U)
/*! HSGPIO0_RST_CLR - HSGPIO0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO0_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO1_RST_CLR_MASK (0x2U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO1_RST_CLR_SHIFT (1U)
/*! HSGPIO1_RST_CLR - HSGPIO1 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO1_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO1_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO1_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO2_RST_CLR_MASK (0x4U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO2_RST_CLR_SHIFT (2U)
/*! HSGPIO2_RST_CLR - HSGPIO2 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO2_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO2_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO2_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO3_RST_CLR_MASK (0x8U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO3_RST_CLR_SHIFT (3U)
/*! HSGPIO3_RST_CLR - HSGPIO3 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO3_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO3_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO3_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO4_RST_CLR_MASK (0x10U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO4_RST_CLR_SHIFT (4U)
/*! HSGPIO4_RST_CLR - HSGPIO4 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO4_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO4_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO4_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO5_RST_CLR_MASK (0x20U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO5_RST_CLR_SHIFT (5U)
/*! HSGPIO5_RST_CLR - HSGPIO5 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO5_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO5_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO5_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO6_RST_CLR_MASK (0x40U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO6_RST_CLR_SHIFT (6U)
/*! HSGPIO6_RST_CLR - HSGPIO6 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO6_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO6_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO6_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO7_RST_CLR_MASK (0x80U)
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO7_RST_CLR_SHIFT (7U)
/*! HSGPIO7_RST_CLR - HSGPIO7 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_HSGPIO7_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_HSGPIO7_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_HSGPIO7_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_CRC_RST_CLR_MASK   (0x10000U)
#define RSTCTRL1_PRSTCTL1_CLR_CRC_RST_CLR_SHIFT  (16U)
/*! CRC_RST_CLR - CRC reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_CRC_RST_CLR(x)     (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_CRC_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_CRC_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_DMAC0_RST_CLR_MASK (0x800000U)
#define RSTCTRL1_PRSTCTL1_CLR_DMAC0_RST_CLR_SHIFT (23U)
/*! DMAC0_RST_CLR - DMAC0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_DMAC0_RST_CLR(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_DMAC0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_DMAC0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_DMAC1_RST_CLR_MASK (0x1000000U)
#define RSTCTRL1_PRSTCTL1_CLR_DMAC1_RST_CLR_SHIFT (24U)
/*! DMAC1_RST_CLR - DMAC1 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_DMAC1_RST_CLR(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_DMAC1_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_DMAC1_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_MU_RST_CLR_MASK    (0x10000000U)
#define RSTCTRL1_PRSTCTL1_CLR_MU_RST_CLR_SHIFT   (28U)
/*! MU_RST_CLR - MU reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_MU_RST_CLR(x)      (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_MU_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_MU_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_SEMA_RST_CLR_MASK  (0x20000000U)
#define RSTCTRL1_PRSTCTL1_CLR_SEMA_RST_CLR_SHIFT (29U)
/*! SEMA_RST_CLR - SEMA reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_SEMA_RST_CLR(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_SEMA_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_SEMA_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL1_CLR_FREQME_RST_CLR_MASK (0x80000000U)
#define RSTCTRL1_PRSTCTL1_CLR_FREQME_RST_CLR_SHIFT (31U)
/*! FREQME_RST_CLR - FREQME reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL1 Bit
 */
#define RSTCTRL1_PRSTCTL1_CLR_FREQME_RST_CLR(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL1_CLR_FREQME_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL1_CLR_FREQME_RST_CLR_MASK)
/*! @} */

/*! @name PRSTCTL2_CLR - peripheral reset clear register 2 */
/*! @{ */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT0_RST_CLR_MASK (0x1U)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT0_RST_CLR_SHIFT (0U)
/*! CT32BIT0_RST_CLR - CT32BIT0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT0_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_CT32BIT0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_CT32BIT0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT1_RST_CLR_MASK (0x2U)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT1_RST_CLR_SHIFT (1U)
/*! CT32BIT1_RST_CLR - CT32BIT1 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT1_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_CT32BIT1_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_CT32BIT1_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT2_RST_CLR_MASK (0x4U)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT2_RST_CLR_SHIFT (2U)
/*! CT32BIT2_RST_CLR - CT32BIT2 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT2_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_CT32BIT2_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_CT32BIT2_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT3_RST_CLR_MASK (0x8U)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT3_RST_CLR_SHIFT (3U)
/*! CT32BIT3_RST_CLR - CT32BIT3 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT3_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_CT32BIT3_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_CT32BIT3_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT4_RST_CLR_MASK (0x10U)
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT4_RST_CLR_SHIFT (4U)
/*! CT32BIT4_RST_CLR - CT32BIT4 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_CT32BIT4_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_CT32BIT4_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_CT32BIT4_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_MRT0_RST_CLR_MASK  (0x100U)
#define RSTCTRL1_PRSTCTL2_CLR_MRT0_RST_CLR_SHIFT (8U)
/*! MRT0_RST_CLR - MRT0 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_MRT0_RST_CLR(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_MRT0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_MRT0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_WWDT1_RST_CLR_MASK (0x400U)
#define RSTCTRL1_PRSTCTL2_CLR_WWDT1_RST_CLR_SHIFT (10U)
/*! WWDT1_RST_CLR - WWDT1 reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_WWDT1_RST_CLR(x)   (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_WWDT1_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_WWDT1_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_I3C0_RST_CLR_MASK  (0x10000U)
#define RSTCTRL1_PRSTCTL2_CLR_I3C0_RST_CLR_SHIFT (16U)
/*! I3C0_RST_CLR - I3C0 reset clear
 *  0b1..Sets the PRSTCTL2 Bit
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_I3C0_RST_CLR(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_I3C0_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_I3C0_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_GPIOINTCTL_RST_CLR_MASK (0x40000000U)
#define RSTCTRL1_PRSTCTL2_CLR_GPIOINTCTL_RST_CLR_SHIFT (30U)
/*! GPIOINTCTL_RST_CLR - GPIOINTCTL reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_GPIOINTCTL_RST_CLR(x) (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_GPIOINTCTL_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_GPIOINTCTL_RST_CLR_MASK)
#define RSTCTRL1_PRSTCTL2_CLR_PIMCTL_RST_CLR_MASK (0x80000000U)
#define RSTCTRL1_PRSTCTL2_CLR_PIMCTL_RST_CLR_SHIFT (31U)
/*! PIMCTL_RST_CLR - PMC reset clear
 *  0b0..No Effect
 *  0b1..clears the PRSTCTL2 Bit
 */
#define RSTCTRL1_PRSTCTL2_CLR_PIMCTL_RST_CLR(x)  (((uint32_t)(((uint32_t)(x)) << RSTCTRL1_PRSTCTL2_CLR_PIMCTL_RST_CLR_SHIFT)) & RSTCTRL1_PRSTCTL2_CLR_PIMCTL_RST_CLR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RSTCTRL1_Register_Masks */


/* RSTCTRL1 - Peripheral instance base addresses */
#if (__ARM_FEATURE_CMSE & 0x2)
  /** Peripheral RSTCTRL1 base address */
  #define RSTCTRL1_BASE                            (0x50020000u)
  /** Peripheral RSTCTRL1 base address */
  #define RSTCTRL1_BASE_NS                         (0x40020000u)
  /** Peripheral RSTCTRL1 base pointer */
  #define RSTCTRL1                                 ((RSTCTRL1_Type *)RSTCTRL1_BASE)
  /** Peripheral RSTCTRL1 base pointer */
  #define RSTCTRL1_NS                              ((RSTCTRL1_Type *)RSTCTRL1_BASE_NS)
  /** Array initializer of RSTCTRL1 peripheral base addresses */
  #define RSTCTRL1_BASE_ADDRS                      { RSTCTRL1_BASE }
  /** Array initializer of RSTCTRL1 peripheral base pointers */
  #define RSTCTRL1_BASE_PTRS                       { RSTCTRL1 }
  /** Array initializer of RSTCTRL1 peripheral base addresses */
  #define RSTCTRL1_BASE_ADDRS_NS                   { RSTCTRL1_BASE_NS }
  /** Array initializer of RSTCTRL1 peripheral base pointers */
  #define RSTCTRL1_BASE_PTRS_NS                    { RSTCTRL1_NS }
#else
  /** Peripheral RSTCTRL1 base address */
  #define RSTCTRL1_BASE                            (0x40020000u)
  /** Peripheral RSTCTRL1 base pointer */
  #define RSTCTRL1                                 ((RSTCTRL1_Type *)RSTCTRL1_BASE)
  /** Array initializer of RSTCTRL1 peripheral base addresses */
  #define RSTCTRL1_BASE_ADDRS                      { RSTCTRL1_BASE }
  /** Array initializer of RSTCTRL1 peripheral base pointers */
  #define RSTCTRL1_BASE_PTRS                       { RSTCTRL1 }
#endif

/*!
 * @}
 */ /* end of group RSTCTRL1_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- RTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTC_Peripheral_Access_Layer RTC Peripheral Access Layer
 * @{
 */

/** RTC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< RTC control register, offset: 0x0 */
  __IO uint32_t MATCH;                             /**< RTC match register, offset: 0x4 */
  __IO uint32_t COUNT;                             /**< RTC counter register, offset: 0x8 */
  __IO uint32_t WAKE;                              /**< High-resolution/wake-up timer control register, offset: 0xC */
  __I  uint32_t SUBSEC;                            /**< RTC Sub-second Counter register, offset: 0x10 */
       uint8_t RESERVED_0[108];
  __IO uint32_t GPREG[8];                          /**< General Purpose register, array offset: 0x80, array step: 0x4 */
} RTC_Type;

/* ----------------------------------------------------------------------------
   -- RTC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTC_Register_Masks RTC Register Masks
 * @{
 */

/*! @name CTRL - RTC control register */
/*! @{ */
#define RTC_CTRL_SWRESET_MASK                    (0x1U)
#define RTC_CTRL_SWRESET_SHIFT                   (0U)
/*! SWRESET - Software reset control
 *  0b0..Not in reset. The RTC is not held in reset. This bit must be cleared prior to configuring or initiating any operation of the RTC.
 *  0b1..In reset. The RTC is held in reset. All register bits within the RTC will be forced to their reset value
 *       except the OFD bit. This bit must be cleared before writing to any register in the RTC - including writes
 *       to set any of the other bits within this register. Do not attempt to write to any bits of this register at
 *       the same time that the reset bit is being cleared.
 */
#define RTC_CTRL_SWRESET(x)                      (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_SWRESET_SHIFT)) & RTC_CTRL_SWRESET_MASK)
#define RTC_CTRL_OFD_MASK                        (0x2U)
#define RTC_CTRL_OFD_SHIFT                       (1U)
/*! OFD - Oscillator fail detect status.
 *  0b0..Run. The RTC oscillator is running properly. Writing a 0 has no effect.
 *  0b1..Fail. RTC oscillator fail detected. Clear this flag after the following power-up. Writing a 1 clears this bit.
 */
#define RTC_CTRL_OFD(x)                          (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_OFD_SHIFT)) & RTC_CTRL_OFD_MASK)
#define RTC_CTRL_ALARM1HZ_MASK                   (0x4U)
#define RTC_CTRL_ALARM1HZ_SHIFT                  (2U)
/*! ALARM1HZ - RTC 1 Hz timer alarm flag status.
 *  0b0..No match. No match has occurred on the 1 Hz RTC timer. Writing a 0 has no effect.
 *  0b1..Match. A match condition has occurred on the 1 Hz RTC timer. This flag generates an RTC alarm interrupt
 *       request RTC_ALARM which can also wake up the part from any low power mode. Writing a 1 clears this bit.
 */
#define RTC_CTRL_ALARM1HZ(x)                     (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_ALARM1HZ_SHIFT)) & RTC_CTRL_ALARM1HZ_MASK)
#define RTC_CTRL_WAKE1KHZ_MASK                   (0x8U)
#define RTC_CTRL_WAKE1KHZ_SHIFT                  (3U)
/*! WAKE1KHZ - RTC 1 kHz timer wake-up flag status.
 *  0b0..Run. The RTC 1 kHz timer is running. Writing a 0 has no effect.
 *  0b1..Time-out. The 1 kHz high-resolution/wake-up timer has timed out. This flag generates an RTC wake-up
 *       interrupt request RTC-WAKE which can also wake up the part from any low power mode. Writing a 1 clears this bit.
 */
#define RTC_CTRL_WAKE1KHZ(x)                     (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_WAKE1KHZ_SHIFT)) & RTC_CTRL_WAKE1KHZ_MASK)
#define RTC_CTRL_ALARMDPD_EN_MASK                (0x10U)
#define RTC_CTRL_ALARMDPD_EN_SHIFT               (4U)
/*! ALARMDPD_EN - RTC 1 Hz timer alarm enable for Deep power-down.
 *  0b0..Disable. A match on the 1 Hz RTC timer will not bring the part out of Deep power-down mode.
 *  0b1..Enable. A match on the 1 Hz RTC timer bring the part out of Deep power-down mode.
 */
#define RTC_CTRL_ALARMDPD_EN(x)                  (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_ALARMDPD_EN_SHIFT)) & RTC_CTRL_ALARMDPD_EN_MASK)
#define RTC_CTRL_WAKEDPD_EN_MASK                 (0x20U)
#define RTC_CTRL_WAKEDPD_EN_SHIFT                (5U)
/*! WAKEDPD_EN - RTC 1 kHz timer wake-up enable for Deep power-down.
 *  0b0..Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.
 *  0b1..Enable. A match on the 1 kHz RTC timer bring the part out of Deep power-down mode.
 */
#define RTC_CTRL_WAKEDPD_EN(x)                   (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_WAKEDPD_EN_SHIFT)) & RTC_CTRL_WAKEDPD_EN_MASK)
#define RTC_CTRL_RTC1KHZ_EN_MASK                 (0x40U)
#define RTC_CTRL_RTC1KHZ_EN_SHIFT                (6U)
/*! RTC1KHZ_EN - RTC 1 kHz clock enable. This bit can be set to 0 to conserve power if the 1 kHz
 *    timer is not used. This bit has no effect when the RTC is disabled (bit 7 of this register is 0).
 *  0b0..Disable. A match on the 1 kHz RTC timer will not bring the part out of Deep power-down mode.
 *  0b1..Enable. The 1 kHz RTC timer is enabled.
 */
#define RTC_CTRL_RTC1KHZ_EN(x)                   (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC1KHZ_EN_SHIFT)) & RTC_CTRL_RTC1KHZ_EN_MASK)
#define RTC_CTRL_RTC_EN_MASK                     (0x80U)
#define RTC_CTRL_RTC_EN_SHIFT                    (7U)
/*! RTC_EN - RTC enable.
 *  0b0..Disable. The RTC 1 Hz and 1 kHz clocks are shut down and the RTC operation is disabled. This bit should
 *       be 0 when writing to load a value in the RTC counter register.
 *  0b1..Enable. The 1 Hz RTC clock is running and RTC operation is enabled. This bit must be set to initiate
 *       operation of the RTC. The first clock to the RTC counter occurs 1 s after this bit is set. To also enable the
 *       high-resolution, 1 kHz clock, set bit 6 in this register.
 */
#define RTC_CTRL_RTC_EN(x)                       (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC_EN_SHIFT)) & RTC_CTRL_RTC_EN_MASK)
#define RTC_CTRL_RTC_OSC_PD_MASK                 (0x100U)
#define RTC_CTRL_RTC_OSC_PD_SHIFT                (8U)
/*! RTC_OSC_PD - The RTC oscillator enable
 *  0b0..The RTC oscillator is enabled. This bit must be cleared in order for the RTC module to function
 *  0b1..The RTC oscillator is shut-off to reserve power consumption. RTC operation is disabled.
 */
#define RTC_CTRL_RTC_OSC_PD(x)                   (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC_OSC_PD_SHIFT)) & RTC_CTRL_RTC_OSC_PD_MASK)
#define RTC_CTRL_RTC_OSC_BYPASS_MASK             (0x200U)
#define RTC_CTRL_RTC_OSC_BYPASS_SHIFT            (9U)
/*! RTC_OSC_BYPASS - The RTC Oscillator bypass
 *  0b0..The RTC Oscillator operates normally as a crystal oscillator with the crystal connected between the RTC_XTLALIN and RTC_XTALOUT pins.
 *  0b1..The RTC oscillator is in bypass mode. In this mode a clock can be directly input into the RTC_XTALIN pin.
 */
#define RTC_CTRL_RTC_OSC_BYPASS(x)               (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC_OSC_BYPASS_SHIFT)) & RTC_CTRL_RTC_OSC_BYPASS_MASK)
#define RTC_CTRL_RTC_SUBSEC_ENA_MASK             (0x400U)
#define RTC_CTRL_RTC_SUBSEC_ENA_SHIFT            (10U)
/*! RTC_SUBSEC_ENA - The 32 KHz sub-second counter enable
 *  0b0..The sub-second counter (if implemented) is disabled. This bit is cleared by a system-level POR or BOD
 *       reset as well as a by the RTC_ENA bit (bit 7 in this register). On modules not equipped with a sub-second
 *       counter, this bit will always read-back as a '0'
 *  0b1..The 32 KHz sub-second counter is enabled (if implemented). Counting will commence on the start of the
 *       first one-second interval after this bit is set. Note: This bit can only be set after the RTC_ENA bit (bit 7)
 *       has been set by a previous write operation. Note: The RTC sub-second counter must be re-enabled whenever
 *       the chip exits deep_powerdown mode.
 */
#define RTC_CTRL_RTC_SUBSEC_ENA(x)               (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC_SUBSEC_ENA_SHIFT)) & RTC_CTRL_RTC_SUBSEC_ENA_MASK)
#define RTC_CTRL_RTC_OSC_loadcap_MASK            (0xF0000000U)
#define RTC_CTRL_RTC_OSC_loadcap_SHIFT           (28U)
#define RTC_CTRL_RTC_OSC_loadcap(x)              (((uint32_t)(((uint32_t)(x)) << RTC_CTRL_RTC_OSC_loadcap_SHIFT)) & RTC_CTRL_RTC_OSC_loadcap_MASK)
/*! @} */

