JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name GATE1 - Semphores2 Gate n */
/*! @{ */
#define SEMA42_GATE1_GTFSM_MASK                  (0xF0U)
#define SEMA42_GATE1_GTFSM_SHIFT                 (4U)
/*! GTFSM - ate Finite State Machine. The hardware gate is maintained in a 16-state implementation
 *  0b0000..The gate is unlocked (free).
 *  0b0001..The gate has been locked by processor 0.
 *  0b0010..The gate has been locked by processor 1.
 *  0b0011..The gate has been locked by processor 2.
 *  0b0100..The gate has been locked by processor 3
 *  0b0101..The gate has been locked by processor 4
 *  0b0110..The gate has been locked by processor 5
 *  0b0111..The gate has been locked by processor 6
 *  0b1000..The gate has been locked by processor 7
 *  0b1001..The gate has been locked by processor 8
 *  0b1010..The gate has been locked by processor 9
 *  0b1011..The gate has been locked by processor 10
 *  0b1100..The gate has been locked by processor 11
 *  0b1101..The gate has been locked by processor 12
 *  0b1110..The gate has been locked by processor 13
 *  0b1111..The gate has been locked by processor 14
 */
#define SEMA42_GATE1_GTFSM(x)                    (((uint8_t)(((uint8_t)(x)) << SEMA42_GATE1_GTFSM_SHIFT)) & SEMA42_GATE1_GTFSM_MASK)
/*! @} */

/*! @name GATE0 - Semphores2 Gate n */
/*! @{ */
#define SEMA42_GATE0_GTFSM_MASK                  (0xF0U)
#define SEMA42_GATE0_GTFSM_SHIFT                 (4U)
/*! GTFSM - ate Finite State Machine. The hardware gate is maintained in a 16-state implementation
 *  0b0000..The gate is unlocked (free).
 *  0b0001..The gate has been locked by processor 0.
 *  0b0010..The gate has been locked by processor 1.
 *  0b0011..The gate has been locked by processor 2.
 *  0b0100..The gate has been locked by processor 3
 *  0b0101..The gate has been locked by processor 4
 *  0b0110..The gate has been locked by processor 5
 *  0b0111..The gate has been locked by processor 6
 *  0b1000..The gate has been locked by processor 7
 *  0b1001..The gate has been locked by processor 8
 *  0b1010..The gate has been locked by processor 9
 *  0b1011..The gate has been locked by processor 10
 *  0b1100..The gate has been locked by processor 11
 *  0b1101..The gate has been locked by processor 12
 *  0b1110..The gate has been locked by processor 13
 *  0b1111..The gate has been locked by processor 14
 */
#define SEMA42_GATE0_GTFSM(x)                    (((uint8_t)(((uint8_t)(x)) << SEMA42_GATE0_GTFSM_SHIFT)) & SEMA42_GATE0_GTFSM_MASK)
/*! @} */

/*! @name GATE7 - Semphores2 Gate n */
/*! @{ */
#define SEMA42_GATE7_GTFSM_MASK                  (0xF0U)
#define SEMA42_GATE7_GTFSM_SHIFT                 (4U)
/*! GTFSM - ate Finite State Machine. The hardware gate is maintained in a 16-state implementation
 *  0b0000..The gate is unlocked (free).
 *  0b0001..The gate has been locked by processor 0.
 *  0b0010..The gate has been locked by processor 1.
 *  0b0011..The gate has been locked by processor 2.
 *  0b0100..The gate has been locked by processor 3
 *  0b0101..The gate has been locked by processor 4
 *  0b0110..The gate has been locked by processor 5
 *  0b0111..The gate has been locked by processor 6
 *  0b1000..The gate has been locked by processor 7
 *  0b1001..The gate has been locked by processor 8
 *  0b1010..The gate has been locked by processor 9
 *  0b1011..The gate has been locked by processor 10
 *  0b1100..The gate has been locked by processor 11
 *  0b1101..The gate has been locked by processor 12
 *  0b1110..The gate has been locked by processor 13
 *  0b1111..The gate has been locked by processor 14
 */
#define SEMA42_GATE7_GTFSM(x)                    (((uint8_t)(((uint8_t)(x)) << SEMA42_GATE7_GTFSM_SHIFT)) & SEMA42_GATE7_GTFSM_MASK)
/*! @} */

/*! @name GATE6 - Semphores2 Gate n */
/*! @{ */
#define SEMA42_GATE6_GTFSM_MASK                  (0xF0U)
#define SEMA42_GATE6_GTFSM_SHIFT                 (4U)
/*! GTFSM - ate Finite State Machine. The hardware gate is maintained in a 16-state implementation
 *  0b0000..The gate is unlocked (free).
 *  0b0001..The gate has been locked by processor 0.
 *  0b0010..The gate has been locked by processor 1.
 *  0b0011..The gate has been locked by processor 2.
 *  0b0100..The gate has been locked by processor 3
 *  0b0101..The gate has been locked by processor 4
 *  0b0110..The gate has been locked by processor 5
 *  0b0111..The gate has been locked by processor 6
 *  0b1000..The gate has been locked by processor 7
 *  0b1001..The gate has been locked by processor 8
 *  0b1010..The gate has been locked by processor 9
 *  0b1011..The gate has been locked by processor 10
 *  0b1100..The gate has been locked by processor 11
 *  0b1101..The gate has been locked by processor 12
 *  0b1110..The gate has been locked by processor 13
 *  0b1111..The gate has been locked by processor 14
 */
#define SEMA42_GATE6_GTFSM(x)                    (((uint8_t)(((uint8_t)(x)) << SEMA42_GATE6_GTFSM_SHIFT)) & SEMA42_GATE6_GTFSM_MASK)
/*! @} */

/*! @name GATE5 - Semphores2 Gate n */
/*! @{ */
#define SEMA42_GATE5_GTFSM_MASK                  (0xF0U)
#define SEMA42_GATE5_GTFSM_SHIFT                 (4U)
/*! GTFSM - ate Finite State Machine. The hardware gate is maintained in a 16-state implementation
 *  0b0000..The gate is unlocked (free).
 *  0b0001..The gate has been locked by processor 0.
 *  0b0010..The gate has been locked by processor 1.
 *  0b0011..The gate has been locked by processor 2.
 *  0b0100..The gate has been locked by processor 3
 *  0b0101..The gate has been locked by processor 4
 *  0b0110..The gate has been locked by processor 5
 *  0b0111..The gate has been locked by processor 6
 *  0b1000..The gate has been locked by processor 7
 *  0b1001..The gate has been locked by processor 8
 *  0b1010..The gate has been locked by processor 9
 *  0b1011..The gate has been locked by processor 10
 *  0b1100..The gate has been locked by processor 11
 *  0b1101..The gate has been locked by processor 12
 *  0b1110..The gate has been locked by processor 13
 *  0b1111..The gate has been locked by processor 14
 */
#define SEMA42_GATE5_GTFSM(x)                    (((uint8_t)(((uint8_t)(x)) << SEMA42_GATE5_GTFSM_SHIFT)) & SEMA42_GATE5_GTFSM_MASK)
/*! @} */

