JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/** SYSCTL0 - Register Layout Typedef */
typedef struct {
  __IO uint32_t UPDATELCKOUT;                      /**< update clock lock out, offset: 0x0 */
       uint8_t RESERVED_0[8];
  __IO uint32_t DSPSTALL;                          /**< DSP stall register, offset: 0xC */
  __IO uint32_t AHBMATRIXPRIOR;                    /**< AHB matrix priority, offset: 0x10 */
  __IO uint32_t PACKERENABLE;                      /**< , offset: 0x14 */
       uint8_t RESERVED_1[8];
  __IO uint32_t AHBBRIDGEBUFFER[2];                /**< AHB bridge buffer N, array offset: 0x20, array step: 0x4 */
       uint8_t RESERVED_2[8];
  __IO uint32_t M33NMISRCSEL;                      /**< M33 nmi source selection, offset: 0x30 */
  __IO uint32_t SYSTEM_STICK_CALIB;                /**< system stick calibration, offset: 0x34 */
  __IO uint32_t SYSTEM_NSTICK_CALIB;               /**< system nstick calibration, offset: 0x38 */
  __IO uint32_t CONFIG_LCKOUT;                     /**< config lockout, offset: 0x3C */
  __O  uint32_t SRAMCFGENABLE0;                    /**< sram config enable 0, offset: 0x40 */
  __O  uint32_t SRAMCFGENABLE1;                    /**< sram config enable 1, offset: 0x44 */
       uint8_t RESERVED_3[4];
  __IO uint32_t SOFTPARTCFG;                       /**< , offset: 0x4C */
  __IO uint32_t PERICFGENABLE0;                    /**< periperhal config enable 0, offset: 0x50 */
  __IO uint32_t PERICFGENABLE1;                    /**< periperhal config enable 1, offset: 0x54 */
  __IO uint32_t PERICFGENABLE2;                    /**< periperhal config enable 2, offset: 0x58 */
       uint8_t RESERVED_4[4];
  __IO uint32_t PRODUCT_ID;                        /**< product ID, offset: 0x60 */
  __I  uint32_t SILICONREV_ID;                     /**< SILICONREV ID, offset: 0x64 */
  __I  uint32_t JTAG_ID;                           /**< jtag ID, offset: 0x68 */
       uint8_t RESERVED_5[4];
  __IO uint32_t NSGPIO_PSYNC;                      /**< NSGPIO psync, offset: 0x70 */
  __IO uint32_t SGPIO_PSYNC;                       /**< sgpio psync, offset: 0x74 */
       uint8_t RESERVED_6[8];
  __IO uint32_t AUTOCLKGATEOVERRIDE0;              /**< auto clock gating override 0, offset: 0x80 */
  __IO uint32_t AUTOCLKGATEOVERRIDE1;              /**< auto clock gating override 1, offset: 0x84 */
       uint8_t RESERVED_7[24];
  __IO uint32_t CLKGATEOVERRIDE0;                  /**< , offset: 0xA0 */
       uint8_t RESERVED_8[92];
  __IO uint32_t AHB_SRAM_ACCESS_DISABLE;           /**< , offset: 0x100 */
  __IO uint32_t DSP_SRAM_ACCESS_DISABLE;           /**< , offset: 0x104 */
  __IO uint32_t AUTO_SRAM_IG_DISABLE;              /**< , offset: 0x108 */
  __IO uint32_t AUTO_SRAM_STDBY_DISABLE;           /**< , offset: 0x10C */
  __IO uint32_t PQ_SRAM_CTRL;                      /**< , offset: 0x110 */
  __IO uint32_t OSPI_SRAM_CTRL;                    /**< , offset: 0x114 */
  __IO uint32_t USBHS_SRAM_CTRL;                   /**< , offset: 0x118 */
  __IO uint32_t USDHC0_SRAM_CTRL;                  /**< , offset: 0x11C */
  __IO uint32_t USDHC1_SRAM_CTRL;                  /**< , offset: 0x120 */
  __IO uint32_t CASPER_SRAM_CTRL;                  /**< , offset: 0x124 */
  __IO uint32_t ROM_MEM_CTRL;                      /**< , offset: 0x128 */
       uint8_t RESERVED_9[596];
  __IO uint32_t OQSPI_BOOTROM_SCRATCH[2];          /**< , array offset: 0x380, array step: 0x4 */
       uint8_t RESERVED_10[24];
  __IO uint32_t CLOUSTON_PORRST_DR0;               /**< , offset: 0x3A0 */
  __IO uint32_t CLOUSTON_PORRST_DR1;               /**< , offset: 0x3A4 */
  __IO uint32_t CLOUSTON_ALLRST_DR0;               /**< , offset: 0x3A8 */
  __IO uint32_t CLOUSTON_ALLRST_DR1;               /**< , offset: 0x3AC */
       uint8_t RESERVED_11[64];
  __IO uint32_t SCRATCH0;                          /**< scratch 0, offset: 0x3F0 */
  __IO uint32_t SCRATCH1;                          /**< scratch 1, offset: 0x3F4 */
       uint8_t RESERVED_12[20];
  __IO uint32_t USBCLKCTRL;                        /**< USB clock control, offset: 0x40C */
  __I  uint32_t USBCLKSTAT;                        /**< USB clock status, offset: 0x410 */
  __IO uint32_t USBPHYPLL0LOCKTIMEDIV2;            /**< , offset: 0x414 */
       uint8_t RESERVED_13[488];
  __IO uint32_t PDSLEEPCFG0;                       /**< , offset: 0x600 */
  __IO uint32_t PDSLEEPCFG1;                       /**< , offset: 0x604 */
  __IO uint32_t PDSLEEPCFG2;                       /**< , offset: 0x608 */
  __IO uint32_t PDSLEEPCFG3;                       /**< , offset: 0x60C */
  __IO uint32_t PDRUNCFG0;                         /**< , offset: 0x610 */
  __IO uint32_t PDRUNCFG1;                         /**< , offset: 0x614 */
  __IO uint32_t PDRUNCFG2;                         /**< , offset: 0x618 */
  __IO uint32_t PDRUNCFG3;                         /**< , offset: 0x61C */
  __O  uint32_t PDRUNCFG0_SET;                     /**< , offset: 0x620 */
  __O  uint32_t PDRUNCFG1_SET;                     /**< , offset: 0x624 */
  __O  uint32_t PDRUNCFG2_SET;                     /**< , offset: 0x628 */
  __O  uint32_t PDRUNCFG3_SET;                     /**< , offset: 0x62C */
  __O  uint32_t PDRUNCFG0_CLR;                     /**< , offset: 0x630 */
  __O  uint32_t PDRUNCFG1_CLR;                     /**< , offset: 0x634 */
  __O  uint32_t PDRUNCFG2_CLR;                     /**< , offset: 0x638 */
  __O  uint32_t PDRUNCFG3_CLR;                     /**< , offset: 0x63C */
       uint8_t RESERVED_14[64];
  __IO uint32_t STARTEN0;                          /**< , offset: 0x680 */
  __IO uint32_t STARTEN1;                          /**< , offset: 0x684 */
       uint8_t RESERVED_15[24];
  __O  uint32_t STARTEN0_SET;                      /**< , offset: 0x6A0 */
  __O  uint32_t STARTEN1_SET;                      /**< , offset: 0x6A4 */
       uint8_t RESERVED_16[24];
  __O  uint32_t STARTEN0_CLR;                      /**< , offset: 0x6C0 */
  __O  uint32_t STARTEN1_CLR;                      /**< , offset: 0x6C4 */
       uint8_t RESERVED_17[184];
  __IO uint32_t HWWAKE;                            /**< , offset: 0x780 */
       uint8_t RESERVED_18[1672];
  __IO uint32_t TEMPSENSORCTL;                     /**< tempsensor ctrl, offset: 0xE0C */
  __IO uint32_t DSPMEMSPEEDCTL;                    /**< , offset: 0xE10 */
       uint8_t RESERVED_19[232];
  __IO uint32_t SDIOPADCTL;                        /**< sdio pad ctrl, offset: 0xEFC */
  __IO uint32_t DICEHWREG[8];                      /**< DICE General Purpose 32-Bit Data Register, array offset: 0xF00, array step: 0x4 */
       uint8_t RESERVED_20[16];
  __O  uint32_t S0AES_UV;                          /**< , offset: 0xF30 */
  __IO uint32_t S0AES_UV_WLOCK;                    /**< , offset: 0xF34 */
  __O  uint32_t S1UDS_UV;                          /**< , offset: 0xF38 */
  __IO uint32_t S1UDS_UV_WLOCK;                    /**< , offset: 0xF3C */
  __I  uint32_t UDS_SEED;                          /**< , offset: 0xF40 */
  __IO uint32_t UDS_SEED_RLOCK;                    /**< , offset: 0xF44 */
       uint8_t RESERVED_21[8];
  __IO uint32_t UUID[4];                           /**< UUIDn 32-Bit Data Register, array offset: 0xF50, array step: 0x4 */
  __IO uint32_t UUID_WLOCK;                        /**< UUID write lock register, offset: 0xF60 */
       uint8_t RESERVED_22[28];
  __IO uint32_t AESKEY_SRCSEL;                     /**< , offset: 0xF80 */
  __IO uint32_t OTFADKEY_SRCSEL;                   /**< , offset: 0xF84 */
       uint8_t RESERVED_23[24];
  __IO uint32_t DBG_LOCKEN;                        /**< Debug Write Lock registers, offset: 0xFA0 */
  __IO uint32_t DBG_FEATURES;                      /**< , offset: 0xFA4 */
  __IO uint32_t DBG_FEATURES_DP;                   /**< , offset: 0xFA8 */
  __IO uint32_t HWUNLOCK_DISABLE;                  /**< , offset: 0xFAC */
  __IO uint32_t CS_PROTTEST;                       /**< , offset: 0xFB0 */
  __IO uint32_t CS_PROTCPU0;                       /**< , offset: 0xFB4 */
  __IO uint32_t CS_PROTCPU1;                       /**< , offset: 0xFB8 */
       uint8_t RESERVED_24[4];
  __IO uint32_t DBG_AUTH_SCRATCH;                  /**< , offset: 0xFC0 */
       uint8_t RESERVED_25[12];
  __IO uint32_t KEY_BLOCK;                         /**< , offset: 0xFD0 */
} SYSCTL0_Type;

/* ----------------------------------------------------------------------------
   -- SYSCTL0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCTL0_Register_Masks SYSCTL0 Register Masks
 * @{
 */

/*! @name UPDATELCKOUT - update clock lock out */
/*! @{ */
#define SYSCTL0_UPDATELCKOUT_UPDATELCKOUT_MASK   (0x1U)
#define SYSCTL0_UPDATELCKOUT_UPDATELCKOUT_SHIFT  (0U)
/*! UPDATELCKOUT - All Registers
 *  0b0..Normal Mode. Can be written to
 *  0b1..Protected Mode. Cannot be written to.
 */
#define SYSCTL0_UPDATELCKOUT_UPDATELCKOUT(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UPDATELCKOUT_UPDATELCKOUT_SHIFT)) & SYSCTL0_UPDATELCKOUT_UPDATELCKOUT_MASK)
/*! @} */

/*! @name DSPSTALL - DSP stall register */
/*! @{ */
#define SYSCTL0_DSPSTALL_DSPSTALL_MASK           (0x1U)
#define SYSCTL0_DSPSTALL_DSPSTALL_SHIFT          (0U)
/*! DSPSTALL - Run / Stall Register. . .
 *  0b0..Run (Normal) Mode.
 *  0b1..Stall Mode.
 */
#define SYSCTL0_DSPSTALL_DSPSTALL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSPSTALL_DSPSTALL_SHIFT)) & SYSCTL0_DSPSTALL_DSPSTALL_MASK)
/*! @} */

