JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name SRAMCFGENABLE1 - sram config enable 1 */
/*! @{ */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_0_MASK  (0x1U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_0_SHIFT (0U)
/*! SRAM_IF_X_0 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_0(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_0_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_0_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_1_MASK  (0x2U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_1_SHIFT (1U)
/*! SRAM_IF_X_1 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_1(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_1_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_1_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_2_MASK  (0x4U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_2_SHIFT (2U)
/*! SRAM_IF_X_2 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_2(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_2_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_2_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_3_MASK  (0x8U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_3_SHIFT (3U)
/*! SRAM_IF_X_3 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_3(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_3_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_3_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_4_MASK  (0x10U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_4_SHIFT (4U)
/*! SRAM_IF_X_4 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_4(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_4_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_4_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_5_MASK  (0x20U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_5_SHIFT (5U)
/*! SRAM_IF_X_5 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_5(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_5_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_5_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_6_MASK  (0x40U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_6_SHIFT (6U)
/*! SRAM_IF_X_6 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_6(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_6_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_6_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_7_MASK  (0x80U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_7_SHIFT (7U)
/*! SRAM_IF_X_7 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_7(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_7_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_7_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_8_MASK  (0x100U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_8_SHIFT (8U)
/*! SRAM_IF_X_8 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_8(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_8_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_8_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_9_MASK  (0x200U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_9_SHIFT (9U)
/*! SRAM_IF_X_9 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_9(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_9_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_9_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_10_MASK (0x400U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_10_SHIFT (10U)
/*! SRAM_IF_X_10 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_10(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_10_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_10_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_11_MASK (0x800U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_11_SHIFT (11U)
/*! SRAM_IF_X_11 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_11(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_11_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_11_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_12_MASK (0x1000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_12_SHIFT (12U)
/*! SRAM_IF_X_12 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_12(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_12_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_12_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_13_MASK (0x2000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_13_SHIFT (13U)
/*! SRAM_IF_X_13 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_13(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_13_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_13_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_14_MASK (0x4000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_14_SHIFT (14U)
/*! SRAM_IF_X_14 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_14(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_14_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_14_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_15_MASK (0x8000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_15_SHIFT (15U)
/*! SRAM_IF_X_15 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_15(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_15_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_15_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_16_MASK (0x10000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_16_SHIFT (16U)
/*! SRAM_IF_X_16 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_16(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_16_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_16_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_17_MASK (0x20000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_17_SHIFT (17U)
/*! SRAM_IF_X_17 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_17(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_17_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_17_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_18_MASK (0x40000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_18_SHIFT (18U)
/*! SRAM_IF_X_18 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_18(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_18_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_18_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_19_MASK (0x80000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_19_SHIFT (19U)
/*! SRAM_IF_X_19 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_19(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_19_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_19_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_20_MASK (0x100000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_20_SHIFT (20U)
/*! SRAM_IF_X_20 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_20(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_20_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_20_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_21_MASK (0x200000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_21_SHIFT (21U)
/*! SRAM_IF_X_21 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_21(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_21_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_21_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_22_MASK (0x400000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_22_SHIFT (22U)
/*! SRAM_IF_X_22 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_22(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_22_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_22_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_23_MASK (0x800000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_23_SHIFT (23U)
/*! SRAM_IF_X_23 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_23(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_23_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_23_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_24_MASK (0x1000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_24_SHIFT (24U)
/*! SRAM_IF_X_24 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_24(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_24_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_24_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_25_MASK (0x2000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_25_SHIFT (25U)
/*! SRAM_IF_X_25 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_25(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_25_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_25_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_26_MASK (0x4000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_26_SHIFT (26U)
/*! SRAM_IF_X_26 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_26(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_26_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_26_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_27_MASK (0x8000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_27_SHIFT (27U)
/*! SRAM_IF_X_27 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_27(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_27_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_27_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_28_MASK (0x10000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_28_SHIFT (28U)
/*! SRAM_IF_X_28 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_28(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_28_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_28_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_29_MASK (0x20000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_29_SHIFT (29U)
/*! SRAM_IF_X_29 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_29(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_29_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_29_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_30_MASK (0x40000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_30_SHIFT (30U)
/*! SRAM_IF_X_30 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_30(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_30_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_30_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_31_MASK (0x80000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_31_SHIFT (31U)
/*! SRAM_IF_X_31 - SRAM IF X enable
 *  0b0..Disable SRAM IF
 *  0b1..Enable SRAM IF
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_31(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_31_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF_X_31_MASK)
/*! @} */

