JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name SOFTPARTCFG -  */
/*! @{ */
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_MASK (0xFU)
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_SHIFT (0U)
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_SHIFT)) & SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_MASK)
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_MASK (0xF0U)
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_SHIFT (4U)
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_SHIFT)) & SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_MASK)
#define SYSCTL0_SOFTPARTCFG_CLOUSTON_MASK        (0xFFFFFF00U)
#define SYSCTL0_SOFTPARTCFG_CLOUSTON_SHIFT       (8U)
#define SYSCTL0_SOFTPARTCFG_CLOUSTON(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_CLOUSTON_SHIFT)) & SYSCTL0_SOFTPARTCFG_CLOUSTON_MASK)
/*! @} */

/*! @name PERICFGENABLE0 - periperhal config enable 0 */
/*! @{ */
#define SYSCTL0_PERICFGENABLE0_HIFI_DSP_EN_MASK  (0x2U)
#define SYSCTL0_PERICFGENABLE0_HIFI_DSP_EN_SHIFT (1U)
/*! HIFI_DSP_EN - HIFI DSP periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_HIFI_DSP_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_HIFI_DSP_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_HIFI_DSP_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_POWERQUAD_EN_MASK (0x100U)
#define SYSCTL0_PERICFGENABLE0_POWERQUAD_EN_SHIFT (8U)
/*! POWERQUAD_EN - powerquad periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_POWERQUAD_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_POWERQUAD_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_POWERQUAD_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_CASPER_EN_MASK    (0x200U)
#define SYSCTL0_PERICFGENABLE0_CASPER_EN_SHIFT   (9U)
/*! CASPER_EN - CAPSER periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_CASPER_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_CASPER_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_CASPER_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT_EN_MASK (0x400U)
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT_EN_SHIFT (10U)
/*! HASHCRYPT_EN - HASHCRYPT periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_HASHCRYPT_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_HASHCRYPT_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_PUF_EN_MASK       (0x800U)
#define SYSCTL0_PERICFGENABLE0_PUF_EN_SHIFT      (11U)
/*! PUF_EN - PUF periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_PUF_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_PUF_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_PUF_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_RNG_EN_MASK       (0x1000U)
#define SYSCTL0_PERICFGENABLE0_RNG_EN_SHIFT      (12U)
/*! RNG_EN - RNG periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_RNG_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_RNG_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_RNG_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_OTFAD_EN_MASK     (0x8000U)
#define SYSCTL0_PERICFGENABLE0_OTFAD_EN_SHIFT    (15U)
/*! OTFAD_EN - OTFAD periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_OTFAD_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_OTFAD_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_OTFAD_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_OSPI_OTFAD_EN_MASK (0x10000U)
#define SYSCTL0_PERICFGENABLE0_OSPI_OTFAD_EN_SHIFT (16U)
/*! OSPI_OTFAD_EN - OSPI periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_OSPI_OTFAD_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_OSPI_OTFAD_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_OSPI_OTFAD_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_OTP_EN_MASK       (0x20000U)
#define SYSCTL0_PERICFGENABLE0_OTP_EN_SHIFT      (17U)
/*! OTP_EN - OTP periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_OTP_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_OTP_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_OTP_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY_EN_MASK (0x100000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY_EN_SHIFT (20U)
/*! USBHS_PHY_EN - USB PHY periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_PHY_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_PHY_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_EN_MASK (0x200000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_EN_SHIFT (21U)
/*! USBHS_DEVICE_EN - USB DEVICE periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST_EN_MASK (0x400000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST_EN_SHIFT (22U)
/*! USBHS_HOST_EN - USB HOST periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_HOST_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_HOST_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM_EN_MASK (0x800000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM_EN_SHIFT (23U)
/*! USBHS_SRAM_EN - USBHS RAM periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_SRAM_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_SRAM_EN_MASK)
#define SYSCTL0_PERICFGENABLE0_SCT_EN_MASK       (0x1000000U)
#define SYSCTL0_PERICFGENABLE0_SCT_EN_SHIFT      (24U)
/*! SCT_EN - SCT periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE0_SCT_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_SCT_EN_SHIFT)) & SYSCTL0_PERICFGENABLE0_SCT_EN_MASK)
/*! @} */

/*! @name PERICFGENABLE1 - periperhal config enable 1 */
/*! @{ */
#define SYSCTL0_PERICFGENABLE1_SDIO0_EN_MASK     (0x4U)
#define SYSCTL0_PERICFGENABLE1_SDIO0_EN_SHIFT    (2U)
/*! SDIO0_EN - SDIO0 periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE1_SDIO0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE1_SDIO0_EN_SHIFT)) & SYSCTL0_PERICFGENABLE1_SDIO0_EN_MASK)
#define SYSCTL0_PERICFGENABLE1_SDIO1_EN_MASK     (0x8U)
#define SYSCTL0_PERICFGENABLE1_SDIO1_EN_SHIFT    (3U)
/*! SDIO1_EN - SDIO1 periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE1_SDIO1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE1_SDIO1_EN_SHIFT)) & SYSCTL0_PERICFGENABLE1_SDIO1_EN_MASK)
#define SYSCTL0_PERICFGENABLE1_CAPT_EN_MASK      (0x100U)
#define SYSCTL0_PERICFGENABLE1_CAPT_EN_SHIFT     (8U)
/*! CAPT_EN - CAPT periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE1_CAPT_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE1_CAPT_EN_SHIFT)) & SYSCTL0_PERICFGENABLE1_CAPT_EN_MASK)
#define SYSCTL0_PERICFGENABLE1_ACMP0_EN_MASK     (0x8000U)
#define SYSCTL0_PERICFGENABLE1_ACMP0_EN_SHIFT    (15U)
/*! ACMP0_EN - Analog comparator periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE1_ACMP0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE1_ACMP0_EN_SHIFT)) & SYSCTL0_PERICFGENABLE1_ACMP0_EN_MASK)
#define SYSCTL0_PERICFGENABLE1_ADC0_EN_MASK      (0x10000U)
#define SYSCTL0_PERICFGENABLE1_ADC0_EN_SHIFT     (16U)
/*! ADC0_EN - ADC periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE1_ADC0_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE1_ADC0_EN_SHIFT)) & SYSCTL0_PERICFGENABLE1_ADC0_EN_MASK)
/*! @} */

