JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name PERICFGENABLE2 - periperhal config enable 2 */
/*! @{ */
#define SYSCTL0_PERICFGENABLE2_UTICK0_EN_MASK    (0x1U)
#define SYSCTL0_PERICFGENABLE2_UTICK0_EN_SHIFT   (0U)
/*! UTICK0_EN - utick periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE2_UTICK0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE2_UTICK0_EN_SHIFT)) & SYSCTL0_PERICFGENABLE2_UTICK0_EN_MASK)
#define SYSCTL0_PERICFGENABLE2_WWDT0_EN_MASK     (0x2U)
#define SYSCTL0_PERICFGENABLE2_WWDT0_EN_SHIFT    (1U)
/*! WWDT0_EN - wdt periperhal enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL0_PERICFGENABLE2_WWDT0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE2_WWDT0_EN_SHIFT)) & SYSCTL0_PERICFGENABLE2_WWDT0_EN_MASK)
/*! @} */

/*! @name PRODUCT_ID - product ID */
/*! @{ */
#define SYSCTL0_PRODUCT_ID_PRODUCT_ID_MASK       (0xFFFFU)
#define SYSCTL0_PRODUCT_ID_PRODUCT_ID_SHIFT      (0U)
#define SYSCTL0_PRODUCT_ID_PRODUCT_ID(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PRODUCT_ID_PRODUCT_ID_SHIFT)) & SYSCTL0_PRODUCT_ID_PRODUCT_ID_MASK)
/*! @} */

/*! @name SILICONREV_ID - SILICONREV ID */
/*! @{ */
#define SYSCTL0_SILICONREV_ID_MINOR_MASK         (0xFU)
#define SYSCTL0_SILICONREV_ID_MINOR_SHIFT        (0U)
#define SYSCTL0_SILICONREV_ID_MINOR(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SILICONREV_ID_MINOR_SHIFT)) & SYSCTL0_SILICONREV_ID_MINOR_MASK)
#define SYSCTL0_SILICONREV_ID_MAJOR_MASK         (0xF0000U)
#define SYSCTL0_SILICONREV_ID_MAJOR_SHIFT        (16U)
#define SYSCTL0_SILICONREV_ID_MAJOR(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SILICONREV_ID_MAJOR_SHIFT)) & SYSCTL0_SILICONREV_ID_MAJOR_MASK)
/*! @} */

/*! @name JTAG_ID - jtag ID */
/*! @{ */
#define SYSCTL0_JTAG_ID_FIXBIT_MASK              (0x1U)
#define SYSCTL0_JTAG_ID_FIXBIT_SHIFT             (0U)
#define SYSCTL0_JTAG_ID_FIXBIT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCTL0_JTAG_ID_FIXBIT_SHIFT)) & SYSCTL0_JTAG_ID_FIXBIT_MASK)
#define SYSCTL0_JTAG_ID_MANU_MASK                (0xFFEU)
#define SYSCTL0_JTAG_ID_MANU_SHIFT               (1U)
#define SYSCTL0_JTAG_ID_MANU(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_JTAG_ID_MANU_SHIFT)) & SYSCTL0_JTAG_ID_MANU_MASK)
#define SYSCTL0_JTAG_ID_PRODUCT_ID_MASK          (0xFFFF000U)
#define SYSCTL0_JTAG_ID_PRODUCT_ID_SHIFT         (12U)
#define SYSCTL0_JTAG_ID_PRODUCT_ID(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_JTAG_ID_PRODUCT_ID_SHIFT)) & SYSCTL0_JTAG_ID_PRODUCT_ID_MASK)
#define SYSCTL0_JTAG_ID_CHIPREV_MASK             (0xF0000000U)
#define SYSCTL0_JTAG_ID_CHIPREV_SHIFT            (28U)
#define SYSCTL0_JTAG_ID_CHIPREV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCTL0_JTAG_ID_CHIPREV_SHIFT)) & SYSCTL0_JTAG_ID_CHIPREV_MASK)
/*! @} */

/*! @name NSGPIO_PSYNC - NSGPIO psync */
/*! @{ */
#define SYSCTL0_NSGPIO_PSYNC_PSYNC_MASK          (0x1U)
#define SYSCTL0_NSGPIO_PSYNC_PSYNC_SHIFT         (0U)
/*! PSYNC - Synchronization Stage Setting. . .
 *  0b0..2-Stage Sync
 *  0b1..1-Stage Sync
 */
#define SYSCTL0_NSGPIO_PSYNC_PSYNC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_NSGPIO_PSYNC_PSYNC_SHIFT)) & SYSCTL0_NSGPIO_PSYNC_PSYNC_MASK)
/*! @} */

/*! @name SGPIO_PSYNC - sgpio psync */
/*! @{ */
#define SYSCTL0_SGPIO_PSYNC_PSYNC_MASK           (0x1U)
#define SYSCTL0_SGPIO_PSYNC_PSYNC_SHIFT          (0U)
/*! PSYNC - Synchronization Stage Setting. . .
 *  0b0..2-Stage Sync
 *  0b1..1-Stage Sync
 */
#define SYSCTL0_SGPIO_PSYNC_PSYNC(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SGPIO_PSYNC_PSYNC_SHIFT)) & SYSCTL0_SGPIO_PSYNC_PSYNC_MASK)
/*! @} */

/*! @name AUTOCLKGATEOVERRIDE0 - auto clock gating override 0 */
/*! @{ */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB0_MASK (0x1U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB0_SHIFT (0U)
/*! AHB2APB0 - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB0(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB0_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB0_MASK)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB1_MASK (0x2U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB1_SHIFT (1U)
/*! AHB2APB1 - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB1_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_AHB2APB1_MASK)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_CRC_Enginer_MASK (0x4U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_CRC_Enginer_SHIFT (2U)
/*! CRC_Enginer - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_CRC_Enginer(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_CRC_Enginer_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_CRC_Enginer_MASK)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_Casper_MASK (0x8U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_Casper_SHIFT (3U)
/*! Casper - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_Casper(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_Casper_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_Casper_MASK)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC0_MASK  (0x10U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC0_SHIFT (4U)
/*! DMAC0 - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC0(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC0_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC0_MASK)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC1_MASK  (0x20U)
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC1_SHIFT (5U)
/*! DMAC1 - auto clock gating enable
 *  0b0..Enable Auto-Clk
 *  0b1..Disable Auto-Clk
 */
#define SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC1(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC1_SHIFT)) & SYSCTL0_AUTOCLKGATEOVERRIDE0_DMAC1_MASK)
/*! @} */

