JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name AUTO_SRAM_STDBY_DISABLE -  */
/*! @{ */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM00_IF_MASK (0x1U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM00_IF_SHIFT (0U)
/*! SRAM00_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM00_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM00_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM00_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM01_IF_MASK (0x2U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM01_IF_SHIFT (1U)
/*! SRAM01_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM01_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM01_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM01_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM02_IF_MASK (0x4U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM02_IF_SHIFT (2U)
/*! SRAM02_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM02_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM02_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM02_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM03_IF_MASK (0x8U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM03_IF_SHIFT (3U)
/*! SRAM03_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM03_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM03_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM03_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM04_IF_MASK (0x10U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM04_IF_SHIFT (4U)
/*! SRAM04_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM04_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM04_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM04_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM05_IF_MASK (0x20U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM05_IF_SHIFT (5U)
/*! SRAM05_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM05_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM05_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM05_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM06_IF_MASK (0x40U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM06_IF_SHIFT (6U)
/*! SRAM06_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM06_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM06_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM06_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM07_IF_MASK (0x80U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM07_IF_SHIFT (7U)
/*! SRAM07_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM07_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM07_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM07_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM08_IF_MASK (0x100U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM08_IF_SHIFT (8U)
/*! SRAM08_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM08_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM08_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM08_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM09_IF_MASK (0x200U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM09_IF_SHIFT (9U)
/*! SRAM09_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM09_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM09_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM09_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM10_IF_MASK (0x400U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM10_IF_SHIFT (10U)
/*! SRAM10_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM10_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM10_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM10_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM11_IF_MASK (0x800U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM11_IF_SHIFT (11U)
/*! SRAM11_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM11_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM11_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM11_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM12_IF_MASK (0x1000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM12_IF_SHIFT (12U)
/*! SRAM12_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM12_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM12_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM12_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM13_IF_MASK (0x2000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM13_IF_SHIFT (13U)
/*! SRAM13_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM13_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM13_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM13_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM14_IF_MASK (0x4000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM14_IF_SHIFT (14U)
/*! SRAM14_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM14_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM14_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM14_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM15_IF_MASK (0x8000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM15_IF_SHIFT (15U)
/*! SRAM15_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM15_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM15_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM15_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM16_IF_MASK (0x10000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM16_IF_SHIFT (16U)
/*! SRAM16_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM16_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM16_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM16_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM17_IF_MASK (0x20000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM17_IF_SHIFT (17U)
/*! SRAM17_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM17_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM17_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM17_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM18_IF_MASK (0x40000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM18_IF_SHIFT (18U)
/*! SRAM18_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM18_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM18_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM18_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM19_IF_MASK (0x80000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM19_IF_SHIFT (19U)
/*! SRAM19_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM19_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM19_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM19_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM20_IF_MASK (0x100000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM20_IF_SHIFT (20U)
/*! SRAM20_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM20_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM20_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM20_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM21_IF_MASK (0x200000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM21_IF_SHIFT (21U)
/*! SRAM21_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM21_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM21_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM21_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM22_IF_MASK (0x400000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM22_IF_SHIFT (22U)
/*! SRAM22_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM22_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM22_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM22_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM23_IF_MASK (0x800000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM23_IF_SHIFT (23U)
/*! SRAM23_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM23_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM23_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM23_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM24_IF_MASK (0x1000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM24_IF_SHIFT (24U)
/*! SRAM24_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM24_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM24_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM24_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM25_IF_MASK (0x2000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM25_IF_SHIFT (25U)
/*! SRAM25_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM25_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM25_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM25_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM26_IF_MASK (0x4000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM26_IF_SHIFT (26U)
/*! SRAM26_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM26_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM26_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM26_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM27_IF_MASK (0x8000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM27_IF_SHIFT (27U)
/*! SRAM27_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM27_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM27_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM27_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM28_IF_MASK (0x10000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM28_IF_SHIFT (28U)
/*! SRAM28_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM28_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM28_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM28_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM29_IF_MASK (0x20000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM29_IF_SHIFT (29U)
/*! SRAM29_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM29_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM29_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM29_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM30_IF_MASK (0x40000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM30_IF_SHIFT (30U)
/*! SRAM30_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM30_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM30_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM30_IF_MASK)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM31_IF_MASK (0x80000000U)
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM31_IF_SHIFT (31U)
/*! SRAM31_IF
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM31_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM31_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_STDBY_DISABLE_SRAM31_IF_MASK)
/*! @} */

/*! @name PQ_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_IG_MASK        (0x1U)
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_IG_SHIFT       (0U)
/*! SRAM_IG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PQ_SRAM_CTRL_SRAM_IG_SHIFT)) & SYSCTL0_PQ_SRAM_CTRL_SRAM_IG_MASK)
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_STDBY_MASK     (0x2U)
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_STDBY_SHIFT    (1U)
/*! SRAM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_PQ_SRAM_CTRL_SRAM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PQ_SRAM_CTRL_SRAM_STDBY_SHIFT)) & SYSCTL0_PQ_SRAM_CTRL_SRAM_STDBY_MASK)
/*! @} */

/*! @name OSPI_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_IG_MASK       (0x1U)
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_IG_SHIFT      (0U)
/*! MEM_IG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_OSPI_SRAM_CTRL_MEM_IG_SHIFT)) & SYSCTL0_OSPI_SRAM_CTRL_MEM_IG_MASK)
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_STDBY_MASK    (0x2U)
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_STDBY_SHIFT   (1U)
/*! MEM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_OSPI_SRAM_CTRL_MEM_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_OSPI_SRAM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_OSPI_SRAM_CTRL_MEM_STDBY_MASK)
/*! @} */

/*! @name USBHS_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_IG_MASK      (0x1U)
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_IG_SHIFT     (0U)
/*! MEM_IG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_IG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBHS_SRAM_CTRL_MEM_IG_SHIFT)) & SYSCTL0_USBHS_SRAM_CTRL_MEM_IG_MASK)
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_STDBY_MASK   (0x2U)
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_STDBY_SHIFT  (1U)
/*! MEM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USBHS_SRAM_CTRL_MEM_STDBY(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBHS_SRAM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_USBHS_SRAM_CTRL_MEM_STDBY_MASK)
/*! @} */

/*! @name USDHC0_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_RIG_MASK    (0x1U)
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_RIG_SHIFT   (0U)
/*! MEM_RIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_RIG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC0_SRAM_CTRL_MEM_RIG_SHIFT)) & SYSCTL0_USDHC0_SRAM_CTRL_MEM_RIG_MASK)
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_WIG_MASK    (0x2U)
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_WIG_SHIFT   (1U)
/*! MEM_WIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_WIG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC0_SRAM_CTRL_MEM_WIG_SHIFT)) & SYSCTL0_USDHC0_SRAM_CTRL_MEM_WIG_MASK)
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_STDBY_MASK  (0x4U)
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_STDBY_SHIFT (2U)
/*! MEM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC0_SRAM_CTRL_MEM_STDBY(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC0_SRAM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_USDHC0_SRAM_CTRL_MEM_STDBY_MASK)
/*! @} */

/*! @name USDHC1_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_RIG_MASK    (0x1U)
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_RIG_SHIFT   (0U)
/*! MEM_RIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_RIG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC1_SRAM_CTRL_MEM_RIG_SHIFT)) & SYSCTL0_USDHC1_SRAM_CTRL_MEM_RIG_MASK)
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_WIG_MASK    (0x2U)
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_WIG_SHIFT   (1U)
/*! MEM_WIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_WIG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC1_SRAM_CTRL_MEM_WIG_SHIFT)) & SYSCTL0_USDHC1_SRAM_CTRL_MEM_WIG_MASK)
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_STDBY_MASK  (0x4U)
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_STDBY_SHIFT (2U)
/*! MEM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_USDHC1_SRAM_CTRL_MEM_STDBY(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USDHC1_SRAM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_USDHC1_SRAM_CTRL_MEM_STDBY_MASK)
/*! @} */

/*! @name CASPER_SRAM_CTRL -  */
/*! @{ */
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_IG_MASK     (0x1U)
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_IG_SHIFT    (0U)
/*! MEM_IG - Auto IG Control Disable:
 *  0b0..IG is controlled by auto clock gating signal.
 *  0b1..IG Is forced low.
 */
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_IG(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CASPER_SRAM_CTRL_MEM_IG_SHIFT)) & SYSCTL0_CASPER_SRAM_CTRL_MEM_IG_MASK)
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_STDBY_MASK  (0x2U)
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_STDBY_SHIFT (1U)
/*! MEM_STDBY - Auto STDBY Control Disable
 *  0b0..STDBY is controlled by auto clock gating signal.
 *  0b1..STDBY Is forced low.
 */
#define SYSCTL0_CASPER_SRAM_CTRL_MEM_STDBY(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CASPER_SRAM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_CASPER_SRAM_CTRL_MEM_STDBY_MASK)
/*! @} */

