JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name ROM_MEM_CTRL -  */
/*! @{ */
#define SYSCTL0_ROM_MEM_CTRL_MEM_RIG_MASK        (0x1U)
#define SYSCTL0_ROM_MEM_CTRL_MEM_RIG_SHIFT       (0U)
/*! MEM_RIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_ROM_MEM_CTRL_MEM_RIG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_ROM_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCTL0_ROM_MEM_CTRL_MEM_RIG_MASK)
#define SYSCTL0_ROM_MEM_CTRL_MEM_WIG_MASK        (0x2U)
#define SYSCTL0_ROM_MEM_CTRL_MEM_WIG_SHIFT       (1U)
/*! MEM_WIG
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_ROM_MEM_CTRL_MEM_WIG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_ROM_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCTL0_ROM_MEM_CTRL_MEM_WIG_MASK)
#define SYSCTL0_ROM_MEM_CTRL_MEM_STDBY_MASK      (0x4U)
#define SYSCTL0_ROM_MEM_CTRL_MEM_STDBY_SHIFT     (2U)
/*! MEM_STDBY
 *  0b0..enable
 *  0b1..disable
 */
#define SYSCTL0_ROM_MEM_CTRL_MEM_STDBY(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL0_ROM_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCTL0_ROM_MEM_CTRL_MEM_STDBY_MASK)
/*! @} */

/*! @name OQSPI_BOOTROM_SCRATCH -  */
/*! @{ */
#define SYSCTL0_OQSPI_BOOTROM_SCRATCH_scratch_MASK (0xFFFFFFFFU)
#define SYSCTL0_OQSPI_BOOTROM_SCRATCH_scratch_SHIFT (0U)
#define SYSCTL0_OQSPI_BOOTROM_SCRATCH_scratch(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_OQSPI_BOOTROM_SCRATCH_scratch_SHIFT)) & SYSCTL0_OQSPI_BOOTROM_SCRATCH_scratch_MASK)
/*! @} */

/* The count of SYSCTL0_OQSPI_BOOTROM_SCRATCH */
#define SYSCTL0_OQSPI_BOOTROM_SCRATCH_COUNT      (2U)

/*! @name CLOUSTON_PORRST_DR0 -  */
/*! @{ */
#define SYSCTL0_CLOUSTON_PORRST_DR0_CLOUSTON_PORRST_DR0_MASK (0xFFFFFFFFU)
#define SYSCTL0_CLOUSTON_PORRST_DR0_CLOUSTON_PORRST_DR0_SHIFT (0U)
#define SYSCTL0_CLOUSTON_PORRST_DR0_CLOUSTON_PORRST_DR0(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CLOUSTON_PORRST_DR0_CLOUSTON_PORRST_DR0_SHIFT)) & SYSCTL0_CLOUSTON_PORRST_DR0_CLOUSTON_PORRST_DR0_MASK)
/*! @} */

/*! @name CLOUSTON_PORRST_DR1 -  */
/*! @{ */
#define SYSCTL0_CLOUSTON_PORRST_DR1_CLOUSTON_PORRST_DR1_MASK (0xFFFFFFFFU)
#define SYSCTL0_CLOUSTON_PORRST_DR1_CLOUSTON_PORRST_DR1_SHIFT (0U)
#define SYSCTL0_CLOUSTON_PORRST_DR1_CLOUSTON_PORRST_DR1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CLOUSTON_PORRST_DR1_CLOUSTON_PORRST_DR1_SHIFT)) & SYSCTL0_CLOUSTON_PORRST_DR1_CLOUSTON_PORRST_DR1_MASK)
/*! @} */

/*! @name CLOUSTON_ALLRST_DR0 -  */
/*! @{ */
#define SYSCTL0_CLOUSTON_ALLRST_DR0_CLOUSTON_ALLRST_DR0_MASK (0xFFFFFFFFU)
#define SYSCTL0_CLOUSTON_ALLRST_DR0_CLOUSTON_ALLRST_DR0_SHIFT (0U)
#define SYSCTL0_CLOUSTON_ALLRST_DR0_CLOUSTON_ALLRST_DR0(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CLOUSTON_ALLRST_DR0_CLOUSTON_ALLRST_DR0_SHIFT)) & SYSCTL0_CLOUSTON_ALLRST_DR0_CLOUSTON_ALLRST_DR0_MASK)
/*! @} */

/*! @name CLOUSTON_ALLRST_DR1 -  */
/*! @{ */
#define SYSCTL0_CLOUSTON_ALLRST_DR1_CLOUSTON_ALLRST_DR1_MASK (0xFFFFFFFFU)
#define SYSCTL0_CLOUSTON_ALLRST_DR1_CLOUSTON_ALLRST_DR1_SHIFT (0U)
#define SYSCTL0_CLOUSTON_ALLRST_DR1_CLOUSTON_ALLRST_DR1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CLOUSTON_ALLRST_DR1_CLOUSTON_ALLRST_DR1_SHIFT)) & SYSCTL0_CLOUSTON_ALLRST_DR1_CLOUSTON_ALLRST_DR1_MASK)
/*! @} */

/*! @name SCRATCH0 - scratch 0 */
/*! @{ */
#define SYSCTL0_SCRATCH0_Scratch_MASK            (0xFFFFFFFFU)
#define SYSCTL0_SCRATCH0_Scratch_SHIFT           (0U)
#define SYSCTL0_SCRATCH0_Scratch(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SCRATCH0_Scratch_SHIFT)) & SYSCTL0_SCRATCH0_Scratch_MASK)
/*! @} */

/*! @name SCRATCH1 - scratch 1 */
/*! @{ */
#define SYSCTL0_SCRATCH1_Scratch_MASK            (0xFFFFFFFFU)
#define SYSCTL0_SCRATCH1_Scratch_SHIFT           (0U)
#define SYSCTL0_SCRATCH1_Scratch(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SCRATCH1_Scratch_SHIFT)) & SYSCTL0_SCRATCH1_Scratch_MASK)
/*! @} */

/*! @name USBCLKCTRL - USB clock control */
/*! @{ */
#define SYSCTL0_USBCLKCTRL_AP_FS_DEV_CLK_MASK    (0x1U)
#define SYSCTL0_USBCLKCTRL_AP_FS_DEV_CLK_SHIFT   (0U)
/*! AP_FS_DEV_CLK - USB0 Device need clock signal control
 *  0b0..Under hardware control.
 *  0b1..Forced high.
 */
#define SYSCTL0_USBCLKCTRL_AP_FS_DEV_CLK(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKCTRL_AP_FS_DEV_CLK_SHIFT)) & SYSCTL0_USBCLKCTRL_AP_FS_DEV_CLK_MASK)
#define SYSCTL0_USBCLKCTRL_POL_FS_DEV_CLK_MASK   (0x2U)
#define SYSCTL0_USBCLKCTRL_POL_FS_DEV_CLK_SHIFT  (1U)
/*! POL_FS_DEV_CLK - USB0 Device need clock polarity for triggering the USB1 wake-up interrupt
 *  0b0..Falling edge of device need_clock triggers wake-up.
 *  0b1..Rising edge of device need_clock triggers wake-up.
 */
#define SYSCTL0_USBCLKCTRL_POL_FS_DEV_CLK(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKCTRL_POL_FS_DEV_CLK_SHIFT)) & SYSCTL0_USBCLKCTRL_POL_FS_DEV_CLK_MASK)
#define SYSCTL0_USBCLKCTRL_AP_FS_HOST_CLK_MASK   (0x4U)
#define SYSCTL0_USBCLKCTRL_AP_FS_HOST_CLK_SHIFT  (2U)
/*! AP_FS_HOST_CLK - USB0 Host need clock signal control
 *  0b0..Under hardware control.
 *  0b1..Forced high.
 */
#define SYSCTL0_USBCLKCTRL_AP_FS_HOST_CLK(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKCTRL_AP_FS_HOST_CLK_SHIFT)) & SYSCTL0_USBCLKCTRL_AP_FS_HOST_CLK_MASK)
#define SYSCTL0_USBCLKCTRL_POL_FS_HOST_CLK_MASK  (0x8U)
#define SYSCTL0_USBCLKCTRL_POL_FS_HOST_CLK_SHIFT (3U)
/*! POL_FS_HOST_CLK - USB0 HOST need clock polarity for triggering the USB1 wake-up interrupt
 *  0b0..Falling edge of host need_clock triggers wake-up.
 *  0b1..Rising edge of host need_clock triggers wake-up.
 */
#define SYSCTL0_USBCLKCTRL_POL_FS_HOST_CLK(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKCTRL_POL_FS_HOST_CLK_SHIFT)) & SYSCTL0_USBCLKCTRL_POL_FS_HOST_CLK_MASK)
#define SYSCTL0_USBCLKCTRL_HS_DEV_WAKEUP_N_MASK  (0x10U)
#define SYSCTL0_USBCLKCTRL_HS_DEV_WAKEUP_N_SHIFT (4U)
/*! HS_DEV_WAKEUP_N - External user wake-up signal for device mode; asserting this signal (active
 *    low) will result in exiting the low power mode; input to asynchronous control logic
 *  0b0..Forces USB0 PHY to wake-up.
 *  0b1..Normal USB0 PHY behavior.
 */
#define SYSCTL0_USBCLKCTRL_HS_DEV_WAKEUP_N(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKCTRL_HS_DEV_WAKEUP_N_SHIFT)) & SYSCTL0_USBCLKCTRL_HS_DEV_WAKEUP_N_MASK)
/*! @} */

/*! @name USBCLKSTAT - USB clock status */
/*! @{ */
#define SYSCTL0_USBCLKSTAT_DEV_NEED_CLKST_MASK   (0x1U)
#define SYSCTL0_USBCLKSTAT_DEV_NEED_CLKST_SHIFT  (0U)
/*! DEV_NEED_CLKST - USB0 Device USB0_NEEDCLK signal status:
 *  0b0..low
 *  0b1..high
 */
#define SYSCTL0_USBCLKSTAT_DEV_NEED_CLKST(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKSTAT_DEV_NEED_CLKST_SHIFT)) & SYSCTL0_USBCLKSTAT_DEV_NEED_CLKST_MASK)
#define SYSCTL0_USBCLKSTAT_HOST_NEED_CLKST_MASK  (0x2U)
#define SYSCTL0_USBCLKSTAT_HOST_NEED_CLKST_SHIFT (1U)
/*! HOST_NEED_CLKST - USB0 Device Host USB0_NEEDCLK signal status:
 *  0b0..low
 *  0b1..high
 */
#define SYSCTL0_USBCLKSTAT_HOST_NEED_CLKST(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_USBCLKSTAT_HOST_NEED_CLKST_SHIFT)) & SYSCTL0_USBCLKSTAT_HOST_NEED_CLKST_MASK)
/*! @} */

