JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name HWWAKE -  */
/*! @{ */
#define SYSCTL0_HWWAKE_FORCEWAKE_MASK            (0x1U)
#define SYSCTL0_HWWAKE_FORCEWAKE_SHIFT           (0U)
#define SYSCTL0_HWWAKE_FORCEWAKE(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL0_HWWAKE_FORCEWAKE_SHIFT)) & SYSCTL0_HWWAKE_FORCEWAKE_MASK)
#define SYSCTL0_HWWAKE_FCWAKE_MASK               (0x2U)
#define SYSCTL0_HWWAKE_FCWAKE_SHIFT              (1U)
#define SYSCTL0_HWWAKE_FCWAKE(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCTL0_HWWAKE_FCWAKE_SHIFT)) & SYSCTL0_HWWAKE_FCWAKE_MASK)
#define SYSCTL0_HWWAKE_DMICWAKE_MASK             (0x4U)
#define SYSCTL0_HWWAKE_DMICWAKE_SHIFT            (2U)
#define SYSCTL0_HWWAKE_DMICWAKE(x)               (((uint32_t)(((uint32_t)(x)) << SYSCTL0_HWWAKE_DMICWAKE_SHIFT)) & SYSCTL0_HWWAKE_DMICWAKE_MASK)
#define SYSCTL0_HWWAKE_DMAC0WAKE_MASK            (0x8U)
#define SYSCTL0_HWWAKE_DMAC0WAKE_SHIFT           (3U)
#define SYSCTL0_HWWAKE_DMAC0WAKE(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL0_HWWAKE_DMAC0WAKE_SHIFT)) & SYSCTL0_HWWAKE_DMAC0WAKE_MASK)
#define SYSCTL0_HWWAKE_DMAC1WAKE_MASK            (0x10U)
#define SYSCTL0_HWWAKE_DMAC1WAKE_SHIFT           (4U)
#define SYSCTL0_HWWAKE_DMAC1WAKE(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL0_HWWAKE_DMAC1WAKE_SHIFT)) & SYSCTL0_HWWAKE_DMAC1WAKE_MASK)
/*! @} */

/*! @name TEMPSENSORCTL - tempsensor ctrl */
/*! @{ */
#define SYSCTL0_TEMPSENSORCTL_TSSRC_MASK         (0x1U)
#define SYSCTL0_TEMPSENSORCTL_TSSRC_SHIFT        (0U)
/*! TSSRC - Temperature Sensor Source. . .
 *  0b0..ADC Built-in Temperature Sensor.
 *  0b1..PMC Temperature Sensor.
 */
#define SYSCTL0_TEMPSENSORCTL_TSSRC(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL0_TEMPSENSORCTL_TSSRC_SHIFT)) & SYSCTL0_TEMPSENSORCTL_TSSRC_MASK)
/*! @} */

/*! @name DSPMEMSPEEDCTL -  */
/*! @{ */
#define SYSCTL0_DSPMEMSPEEDCTL_DSPCAC_MASK       (0x3U)
#define SYSCTL0_DSPMEMSPEEDCTL_DSPCAC_SHIFT      (0U)
/*! DSPCAC - DSP Cache Register File Speed: DSPCAC[1]: HS, DSPCAC[0]: LS
 *  0b00..default
 *  0b01..low speed
 *  0b10..high speed
 *  0b11..low speed
 */
#define SYSCTL0_DSPMEMSPEEDCTL_DSPCAC(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSPMEMSPEEDCTL_DSPCAC_SHIFT)) & SYSCTL0_DSPMEMSPEEDCTL_DSPCAC_MASK)
#define SYSCTL0_DSPMEMSPEEDCTL_DSPTCM_MASK       (0xCU)
#define SYSCTL0_DSPMEMSPEEDCTL_DSPTCM_SHIFT      (2U)
/*! DSPTCM - DSP TCM Speed: DSPTCM[1]: HS, DSPTCM[0]: LS
 *  0b00..default
 *  0b01..low speed
 *  0b10..high speed
 *  0b11..low speed
 */
#define SYSCTL0_DSPMEMSPEEDCTL_DSPTCM(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSPMEMSPEEDCTL_DSPTCM_SHIFT)) & SYSCTL0_DSPMEMSPEEDCTL_DSPTCM_MASK)
/*! @} */

/*! @name SDIOPADCTL - sdio pad ctrl */
/*! @{ */
#define SYSCTL0_SDIOPADCTL_RASRCN_MASK           (0xFU)
#define SYSCTL0_SDIOPADCTL_RASRCN_SHIFT          (0U)
#define SYSCTL0_SDIOPADCTL_RASRCN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_RASRCN_SHIFT)) & SYSCTL0_SDIOPADCTL_RASRCN_MASK)
#define SYSCTL0_SDIOPADCTL_RASRCP_MASK           (0xF0U)
#define SYSCTL0_SDIOPADCTL_RASRCP_SHIFT          (4U)
#define SYSCTL0_SDIOPADCTL_RASRCP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_RASRCP_SHIFT)) & SYSCTL0_SDIOPADCTL_RASRCP_MASK)
#define SYSCTL0_SDIOPADCTL_FASTFRZ_MASK          (0x100U)
#define SYSCTL0_SDIOPADCTL_FASTFRZ_SHIFT         (8U)
#define SYSCTL0_SDIOPADCTL_FASTFRZ(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_FASTFRZ_SHIFT)) & SYSCTL0_SDIOPADCTL_FASTFRZ_MASK)
#define SYSCTL0_SDIOPADCTL_FREEZE_MASK           (0x200U)
#define SYSCTL0_SDIOPADCTL_FREEZE_SHIFT          (9U)
#define SYSCTL0_SDIOPADCTL_FREEZE(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_FREEZE_SHIFT)) & SYSCTL0_SDIOPADCTL_FREEZE_MASK)
#define SYSCTL0_SDIOPADCTL_COMPTQ_MASK           (0x400U)
#define SYSCTL0_SDIOPADCTL_COMPTQ_SHIFT          (10U)
#define SYSCTL0_SDIOPADCTL_COMPTQ(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_COMPTQ_SHIFT)) & SYSCTL0_SDIOPADCTL_COMPTQ_MASK)
#define SYSCTL0_SDIOPADCTL_COMPEN_MASK           (0x800U)
#define SYSCTL0_SDIOPADCTL_COMPEN_SHIFT          (11U)
#define SYSCTL0_SDIOPADCTL_COMPEN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_COMPEN_SHIFT)) & SYSCTL0_SDIOPADCTL_COMPEN_MASK)
#define SYSCTL0_SDIOPADCTL_NASRCN_MASK           (0xF0000U)
#define SYSCTL0_SDIOPADCTL_NASRCN_SHIFT          (16U)
#define SYSCTL0_SDIOPADCTL_NASRCN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_NASRCN_SHIFT)) & SYSCTL0_SDIOPADCTL_NASRCN_MASK)
#define SYSCTL0_SDIOPADCTL_NASRCP_MASK           (0xF00000U)
#define SYSCTL0_SDIOPADCTL_NASRCP_SHIFT          (20U)
#define SYSCTL0_SDIOPADCTL_NASRCP(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_NASRCP_SHIFT)) & SYSCTL0_SDIOPADCTL_NASRCP_MASK)
#define SYSCTL0_SDIOPADCTL_COMPOK_MASK           (0x1000000U)
#define SYSCTL0_SDIOPADCTL_COMPOK_SHIFT          (24U)
#define SYSCTL0_SDIOPADCTL_COMPOK(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SDIOPADCTL_COMPOK_SHIFT)) & SYSCTL0_SDIOPADCTL_COMPOK_MASK)
/*! @} */

/*! @name DICEHWREG - DICE General Purpose 32-Bit Data Register */
/*! @{ */
#define SYSCTL0_DICEHWREG_DICEHWREG_MASK         (0xFFFFFFFFU)
#define SYSCTL0_DICEHWREG_DICEHWREG_SHIFT        (0U)
#define SYSCTL0_DICEHWREG_DICEHWREG(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DICEHWREG_DICEHWREG_SHIFT)) & SYSCTL0_DICEHWREG_DICEHWREG_MASK)
/*! @} */

/* The count of SYSCTL0_DICEHWREG */
#define SYSCTL0_DICEHWREG_COUNT                  (8U)

/*! @name S0AES_UV -  */
/*! @{ */
#define SYSCTL0_S0AES_UV_S0AES_UV_MASK           (0xFFFFFFFFU)
#define SYSCTL0_S0AES_UV_S0AES_UV_SHIFT          (0U)
#define SYSCTL0_S0AES_UV_S0AES_UV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S0AES_UV_S0AES_UV_SHIFT)) & SYSCTL0_S0AES_UV_S0AES_UV_MASK)
/*! @} */

/*! @name S0AES_UV_WLOCK -  */
/*! @{ */
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_MASK (0x1U)
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_SHIFT (0U)
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_SHIFT)) & SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_MASK)
/*! @} */

/*! @name S1UDS_UV -  */
/*! @{ */
#define SYSCTL0_S1UDS_UV_S1UDS_UV_MASK           (0xFFFFFFFFU)
#define SYSCTL0_S1UDS_UV_S1UDS_UV_SHIFT          (0U)
#define SYSCTL0_S1UDS_UV_S1UDS_UV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S1UDS_UV_S1UDS_UV_SHIFT)) & SYSCTL0_S1UDS_UV_S1UDS_UV_MASK)
/*! @} */

/*! @name S1UDS_UV_WLOCK -  */
/*! @{ */
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_MASK (0x1U)
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_SHIFT (0U)
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_SHIFT)) & SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_MASK)
/*! @} */

/*! @name UDS_SEED -  */
/*! @{ */
#define SYSCTL0_UDS_SEED_UDS_SEED_MASK           (0xFFFFFFFFU)
#define SYSCTL0_UDS_SEED_UDS_SEED_SHIFT          (0U)
#define SYSCTL0_UDS_SEED_UDS_SEED(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UDS_SEED_UDS_SEED_SHIFT)) & SYSCTL0_UDS_SEED_UDS_SEED_MASK)
/*! @} */

