JayHeng/cortex-m-apps/devices/MIMXRT685S/MIMXRT685S.h
/*! @name PERICFGENABLE0 - peripheral enable register 0 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE0_FC0_EN_MASK       (0x100U)
#define SYSCTL1_PERICFGENABLE0_FC0_EN_SHIFT      (8U)
/*! FC0_EN - flexcomm 0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC0_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC0_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC1_EN_MASK       (0x200U)
#define SYSCTL1_PERICFGENABLE0_FC1_EN_SHIFT      (9U)
/*! FC1_EN - flexcomm 1 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC1_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC1_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC1_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC2_EN_MASK       (0x400U)
#define SYSCTL1_PERICFGENABLE0_FC2_EN_SHIFT      (10U)
/*! FC2_EN - flexcomm 2 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC2_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC2_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC2_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC3_EN_MASK       (0x800U)
#define SYSCTL1_PERICFGENABLE0_FC3_EN_SHIFT      (11U)
/*! FC3_EN - flexcomm 3 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC3_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC3_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC3_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC4_EN_MASK       (0x1000U)
#define SYSCTL1_PERICFGENABLE0_FC4_EN_SHIFT      (12U)
/*! FC4_EN - flexcomm 4 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC4_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC4_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC4_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC5_EN_MASK       (0x2000U)
#define SYSCTL1_PERICFGENABLE0_FC5_EN_SHIFT      (13U)
/*! FC5_EN - flexcomm 5 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC5_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC5_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC5_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC6_EN_MASK       (0x4000U)
#define SYSCTL1_PERICFGENABLE0_FC6_EN_SHIFT      (14U)
/*! FC6_EN - flexcomm 6 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC6_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC6_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC6_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC7_EN_MASK       (0x8000U)
#define SYSCTL1_PERICFGENABLE0_FC7_EN_SHIFT      (15U)
/*! FC7_EN - flexcomm 7 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC7_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC7_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC7_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC14_SPI_EN_MASK  (0x400000U)
#define SYSCTL1_PERICFGENABLE0_FC14_SPI_EN_SHIFT (22U)
/*! FC14_SPI_EN - flexcomm 14 spi peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC14_SPI_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC14_SPI_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC14_SPI_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_FC15_I2C_EN_MASK  (0x800000U)
#define SYSCTL1_PERICFGENABLE0_FC15_I2C_EN_SHIFT (23U)
/*! FC15_I2C_EN - flexcomm 15 i2c peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_FC15_I2C_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FC15_I2C_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_FC15_I2C_EN_MASK)
#define SYSCTL1_PERICFGENABLE0_DMIC0_EN_MASK     (0x1000000U)
#define SYSCTL1_PERICFGENABLE0_DMIC0_EN_SHIFT    (24U)
/*! DMIC0_EN - DMIC0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE0_DMIC0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_DMIC0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE0_DMIC0_EN_MASK)
/*! @} */

/*! @name PERICFGENABLE1 - peripheral enable register 1 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE1_HSGPIO0_EN_MASK   (0x1U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO0_EN_SHIFT  (0U)
/*! HSGPIO0_EN - HSGPIO0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO0_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO1_EN_MASK   (0x2U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO1_EN_SHIFT  (1U)
/*! HSGPIO1_EN - HSGPIO1 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO1_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO1_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO2_EN_MASK   (0x4U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO2_EN_SHIFT  (2U)
/*! HSGPIO2_EN - HSGPIO2 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO2_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO2_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO2_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO3_EN_MASK   (0x8U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO3_EN_SHIFT  (3U)
/*! HSGPIO3_EN - HSGPIO3 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO3_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO3_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO3_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO4_EN_MASK   (0x10U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO4_EN_SHIFT  (4U)
/*! HSGPIO4_EN - HSGPIO4 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO4_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO4_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO4_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO5_EN_MASK   (0x20U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO5_EN_SHIFT  (5U)
/*! HSGPIO5_EN - HSGPIO5 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO5_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO5_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO5_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO6_EN_MASK   (0x40U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO6_EN_SHIFT  (6U)
/*! HSGPIO6_EN - HSGPIO6 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO6_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO6_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO6_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO7_EN_MASK   (0x80U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO7_EN_SHIFT  (7U)
/*! HSGPIO7_EN - HSGPIO7 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO7_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO7_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO7_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_CRC_EN_MASK       (0x10000U)
#define SYSCTL1_PERICFGENABLE1_CRC_EN_SHIFT      (16U)
/*! CRC_EN - CRC peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_CRC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_CRC_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_CRC_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_DMAC0_EN_MASK     (0x800000U)
#define SYSCTL1_PERICFGENABLE1_DMAC0_EN_SHIFT    (23U)
/*! DMAC0_EN - DMAC0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_DMAC0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_DMAC0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_DMAC0_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_DMAC1_EN_MASK     (0x1000000U)
#define SYSCTL1_PERICFGENABLE1_DMAC1_EN_SHIFT    (24U)
/*! DMAC1_EN - DMAC1peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_DMAC1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_DMAC1_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_DMAC1_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_MU_EN_MASK        (0x10000000U)
#define SYSCTL1_PERICFGENABLE1_MU_EN_SHIFT       (28U)
/*! MU_EN - MU peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_MU_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_MU_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_MU_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_SEMA_EN_MASK      (0x20000000U)
#define SYSCTL1_PERICFGENABLE1_SEMA_EN_SHIFT     (29U)
/*! SEMA_EN - SEMA peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_SEMA_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_SEMA_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_SEMA_EN_MASK)
#define SYSCTL1_PERICFGENABLE1_FREQME_EN_MASK    (0x80000000U)
#define SYSCTL1_PERICFGENABLE1_FREQME_EN_SHIFT   (31U)
/*! FREQME_EN - FREQME peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE1_FREQME_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_FREQME_EN_SHIFT)) & SYSCTL1_PERICFGENABLE1_FREQME_EN_MASK)
/*! @} */

/*! @name PERICFGENABLE2 - peripheral enable register 2 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE2_CT32BIT0_EN_MASK  (0x1U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT0_EN_SHIFT (0U)
/*! CT32BIT0_EN - ct32bit timer 0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT0_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT0_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT1_EN_MASK  (0x2U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT1_EN_SHIFT (1U)
/*! CT32BIT1_EN - ct32bit timer 1 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT1_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT1_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT1_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT2_EN_MASK  (0x4U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT2_EN_SHIFT (2U)
/*! CT32BIT2_EN - ct32bit timer 2 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT2_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT2_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT2_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT3_EN_MASK  (0x8U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT3_EN_SHIFT (3U)
/*! CT32BIT3_EN - ct32bit timer 3 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT3_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT3_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT3_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT4_EN_MASK  (0x10U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT4_EN_SHIFT (4U)
/*! CT32BIT4_EN - ct32bit timer 4 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT4_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT4_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT4_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_RTC_LITE_EN_MASK  (0x80U)
#define SYSCTL1_PERICFGENABLE2_RTC_LITE_EN_SHIFT (7U)
/*! RTC_LITE_EN - rtc lite peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_RTC_LITE_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_RTC_LITE_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_RTC_LITE_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_MRT0_EN_MASK      (0x100U)
#define SYSCTL1_PERICFGENABLE2_MRT0_EN_SHIFT     (8U)
/*! MRT0_EN - mrt0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_MRT0_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_MRT0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_MRT0_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_WWDT1_EN_MASK     (0x400U)
#define SYSCTL1_PERICFGENABLE2_WWDT1_EN_SHIFT    (10U)
/*! WWDT1_EN - wdt1 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_WWDT1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_WWDT1_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_WWDT1_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_I3C0_EN_MASK      (0x10000U)
#define SYSCTL1_PERICFGENABLE2_I3C0_EN_SHIFT     (16U)
/*! I3C0_EN - i3c0 peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_I3C0_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_I3C0_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_I3C0_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL_EN_MASK (0x40000000U)
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL_EN_SHIFT (30U)
/*! GPIOINTCTL_EN - GPIOINTCTL peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_GPIOINTCTL_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_GPIOINTCTL_EN_MASK)
#define SYSCTL1_PERICFGENABLE2_PIMCTL_EN_MASK    (0x80000000U)
#define SYSCTL1_PERICFGENABLE2_PIMCTL_EN_SHIFT   (31U)
/*! PIMCTL_EN - PIMCTL peripheral enable
 *  0b0..Disable Peripheral
 *  0b1..Enable Peripheral
 */
#define SYSCTL1_PERICFGENABLE2_PIMCTL_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_PIMCTL_EN_SHIFT)) & SYSCTL1_PERICFGENABLE2_PIMCTL_EN_MASK)
/*! @} */

/*! @name RXEVPULSEGEN - RX Event Pulse Generator */
/*! @{ */
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_MASK   (0x1U)
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT  (0U)
/*! RXEVPULSEGEN - RX Event Pulse Generator. Writing a '1' to this register will create a one PSCLK
 *    pulse width of logic '1'. It is automatically cleared.
 *  0b0..No effect.
 *  0b1..Pulse RXEV High for one PSCLK cycle.
 */
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT)) & SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_MASK)
/*! @} */

/*! @name SCRATCH0 - general purpose register 0 */
/*! @{ */
#define SYSCTL1_SCRATCH0_Scratch_MASK            (0xFFFFFFFFU)
#define SYSCTL1_SCRATCH0_Scratch_SHIFT           (0U)
#define SYSCTL1_SCRATCH0_Scratch(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL1_SCRATCH0_Scratch_SHIFT)) & SYSCTL1_SCRATCH0_Scratch_MASK)
/*! @} */

/*! @name SCRATCH1 - general purpose register 1 */
/*! @{ */
#define SYSCTL1_SCRATCH1_Scratch_MASK            (0xFFFFFFFFU)
#define SYSCTL1_SCRATCH1_Scratch_SHIFT           (0U)
#define SYSCTL1_SCRATCH1_Scratch(x)              (((uint32_t)(((uint32_t)(x)) << SYSCTL1_SCRATCH1_Scratch_SHIFT)) & SYSCTL1_SCRATCH1_Scratch_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCTL1_Register_Masks */


